[
    {
        "title": "\n\t\tHTC U12 Plus vs. Galaxy S9 Plus: Clash of the plus-sized phones\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>We love the early months of the year, since it always means a deluge of new devices vying to take the market by storm. The latest to make its mighty presence known is the <a href=\"https://www.digitaltrends.com/mobile/htc-u12-plus-news/\">HTC U12 Plus</a>, and it comes with all the power you’d expect from a 2018 flagship, along with a few of HTC’s special features.</p>",
            "<p>But the Taiwanese company has competition, specifically the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-plus-review/\">Samsung Galaxy S9 Plus</a>. How do these two mighty behemoths fare head-to-head? We take a look in this specs comparison. And be sure to check out our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u12-plus-review/\">HTC U12 Plus hands-on review</a> for our impressions of the phone.</p>",
            "<p>On paper, the performance on these two phones appears to be a dead heat. Both are equipped with the Snapdragon 845’s blisteringly powerful performance, and with 6GB of RAM apiece, we’d expect both of these phones to be fairly snappy, and very similar in real-life usage.</p>",
            "<p>It’s the same story when we turn to batteries. The 3,500mAh batteries in each are hefty, but with the energy demands from such large screens, we expect that they’ll equal about the same battery life — roughly a day. We see some differences in charging rate though — while the Galaxy S9 Plus is stuck with <a href=\"https://www.qualcomm.com/news/onq/2015/06/30/qualcomm-quick-charge-20-technology-explained\">QuickCharge 2.0</a>, the HTC U12 Plus comes with <a href=\"https://www.qualcomm.com/products/quick-charge-3\">QuickCharge 3.0</a> out of the box, and the option for <a href=\"https://www.qualcomm.com/solutions/mobile-computing/features/quick-charge\">QuickCharge 4.0</a> with a compatible adapter. However, despite having flagship specs and a high price point, the U12 Plus does not have wireless charging — which seems more than a tad odd for a 2018 flagship with glass on the back.</p>",
            "<p>We can’t separate these two yet — this has to be a tie for now.</p>",
            "<p><strong>Winner: Tie<br>\n</strong></p>",
            "<p>This should be completely clear from the outset — both of these phones are drop-dead gorgeous, glass-wrapped beauties. The Galaxy S9 Plus takes its style cues from its older sibling, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s8-review/\">S8 Plus</a> — but that’s no bad thing, since the gentle curves, slim bezels, and sleek design look stunning. The HTC U12 Plus takes a similar route, bringing back the Liquid Surface design from the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u11-review/\">HTC U11</a>, but slimming down the bezels significantly. And how could we not mention the slight transparency of the Translucent Blue model? Brilliant. In terms of pure bezel size, though, Samsung takes the win for its skimpier edges around the screen.</p>",
            "<p>Durability is always going to be an issue with glass phones of course, and you’re probably <a href=\"https://www.digitaltrends.com/mobile/best-samsung-galaxy-s9-plus-cases/\">going to want cases</a> for both devices, just in case the worst does happen. It’s all good news on the water-resistance front though, as both phones come with an <a href=\"https://www.digitaltrends.com/mobile/how-rugged-is-your-phone/\">IP68 rating</a> and should be able to resist a trip down the toilet or into the pool. The U12 Plus may even be even better at water resistance, because it doesn’t have any mechanical buttons, just touch-sensitive ones.</p>",
            "<p>It’s more or less even on this front. But there is something of a tie-breaker if you’re passionate about your old headphones — the HTC U12 Plus has no headphone jack. It comes with some USB-C headphones in the box to offset this, but for us it’s a missing feature, so the Galaxy S9 Plus ekes out the win.</p>",
            "<p><strong>Winner: Samsung Galaxy S9 Plus<br>\n</strong></p>",
            "<p>You’ll find a 6-inch Super LCD screen dominating the front of the HTC U12 Plus, with a 2,880 x 1,440 pixel resolution. With a pixels-per-inch (ppi) measurement of 537 , HTC’s phone delivers a sharper display than the S9 Plus’ 529 pp. But no matter how good the U12 Plus’ display is, it still can’t beat the AMOLED display on the S9 Plus. AMOLED screens are capable of much deeper colors and inkier blacks than LCD screens, and it’s clear that there’s something of a mismatch here.</p>",
            "<p>That’s not to say the HTC U12 Plus’ display isn’t good, but it’s up against one of <a href=\"http://www.displaymate.com/Galaxy_S9_ShootOut_1s.htm\">the world’s best displays here</a>.</p>",
            "<p><strong>Winner: Samsung Galaxy S9 Plus<br>\n</strong></p>",
            "<p>The S9 Plus comes with two 12-megapixel lenses on the rear, plus an 8-megapixel selfie shooter on the front. The HTC U12 Plus goes a step further with two lenses on the back (a 12-megapixel lens and a 16-megapixel telephoto lens), but it also comes with two 8-megapixel selfie lenses. That sounds exciting, but in practice, most of what the front two lenses do is Portrait Mode selective blur for selfies, and not much else. It’s a feature that was already possible on the Galaxy S8, never mind the S9 Plus.</p>",
            "<p>In terms of raw camera hardware, we suspect the Galaxy S9 Plus’ <a href=\"https://www.digitaltrends.com/photography/what-is-variable-aperture-samsung-galaxy-s9/\">variable aperture</a> and <a href=\"https://www.digitaltrends.com/mobile/galaxy-s9-plus-camera/\">great low-light performance</a> gives it the edge over the HTC U12 Plus, but we need more time to be absolutely sure of that. You’ll find bokeh-style selective blur on both cameras, and both phones are capable of 2x optical zoom thanks to telephoto lenses.</p>",
            "<p>In terms of video, you can expect solid performance from both, with both being able to record in 60 frames per second at 4K resolutions. The S9 Plus’ 960 fps super slow-motion video is more impressive than the U12 Plus’ regular slow-mo, but HTC’s Sonic Zoom tech wins it some points back. Sonic Zoom is a feature that lets you zoom in during a video, and the camera will suppress other sounds to focus on your zoomed-in-on subject.</p>",
            "<p>Honestly, without further testing, we’re finding it hard to separate the two phones. <a href=\"https://www.dxomark.com/htc-u11-mobile-review-retested-new-dxomark-mobile/\">HTC’s phones have beaten Samsung’s</a> before, so we’re not confident enough to declare a winner yet. It’s a draw, for now.</p>",
            "<p><strong>Winner: Tie<br>\n</strong></p>",
            "<p>These aren’t phones for <a href=\"https://www.digitaltrends.com/mobile/what-is-stock-android/\">stock Android</a> enthusiasts — both phones come with manufacturer skins of Android, and your choice between the two is going to be personal. Rest assured though, both are accessible for anyone with prior experience of Android. Both also come with <a href=\"https://www.digitaltrends.com/mobile/android-o-news/\">Android 8.0 Oreo</a>, and as flagships, we expect both will be supported for years to come, especially with the upcoming <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android P</a>.</p>",
            "<p>In terms of update speed, HTC has continuously beaten Samsung. The HTC U11 was <a href=\"https://www.digitaltrends.com/mobile/android-oreo-when-do-you-get-it/\">one of the first</a> non-Google devices to get Android 8.0 Oreo, and it’s fair to assume this will still be the case with Android P. While we laud Samsung’s breadth of updates (the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s7-review/\">Galaxy S7</a> recently received the Oreo update), it’s just too slow in getting the ball rolling.</p>",
            "<p><strong>Winner: HTC U12 Plus<br>\n</strong></p>",
            "<p>Being top-of-the-line flagship phones, you’d be right to expect a good amount of special features from both of these phones. The Galaxy S9 Plus’ roster is well known at this point — there’s virtual reality with the <a href=\"https://www.digitaltrends.com/vr-headset-reviews/samsung-gear-vr-review/\">Gear VR</a>, the ability to turn your phone into a desktop computer with the <a href=\"https://www.digitaltrends.com/gadget-reviews/samsung-dex-station-review/\">Dex Station</a> or <a href=\"https://www.digitaltrends.com/mobile/samsung-trademarks-dex-pad/\">Dex Pad</a>, <a href=\"https://www.digitaltrends.com/mobile/how-to-use-bixby/\">A.I. assistant Bixby</a> — and finally — the <a href=\"https://www.digitaltrends.com/mobile/ar-emojis-samsung-galaxy-s9-test/\">hit-and-miss AR Emojis</a>.</p>",
            "<p>That’s a formidable arsenal, but the U12 Plus has its own strengths. <a href=\"https://www.digitaltrends.com/mobile/htc-edge-sense-update/\">Edge Sense</a> is back from the U11, and in addition to squeezing the sides, there’s also a new action — double tapping either side of the phone There’s also face unlock — also available on the S9 Plus — as well as the BoomSound speakers that was one of the highest points of <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u11-review/\">last year’s HTC U11</a>.</p>",
            "<p>There’s a lot to love on both of these phones, and there’s no particular feature on either of these phones that signify a clear winner. It’s another tie.</p>",
            "<p><strong>Winner: Tie<br>\n</strong></p>",
            "<p>The Samsung Galaxy S9 Plus is currently available on all major carriers, and prices start at $840 for the 64GB model. The HTC U12 Plus can be pre-ordered from May 23 from HTC’s website and Amazon, with prices starting at $800 for the 64GB model. It’s certified to work on AT&amp;T, T-Mobile, and Verizon.</p>",
            "<p>This was a very hard choice to make — there’s a lot to love in both of these phones, including stunning designs, tons of power, and some wonderful additional features. While the HTC U12 Plus certainly has a lead in some areas, it’s not quite enough to topple the Galaxy S9 Plus based on specifications alone. That may not be the case after we’ve tested features like the camera and battery, so stay tuned for our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u12-plus-review/\">full review</a>.</p>"
        ]
    },
    {
        "title": "\n\t\tDT Daily: Subaru Ascent attempts to climb a mountain of competition\t",
        "author": [
            "\n\t\t\t\t\t\tBill Roberson\t\t\t\t\t"
        ],
        "text": [
            "<p><strong><div class=\"dtvideos-container\" itemprop=\"video\" itemtype=\"http://schema.org/VideoObject\"><div id=\"dt-video-embed-5c549d9b499b1\" style=\"padding-bottom:56.2499999993%;\"></div><script>window.DTVideos = window.DTVideos || [];window.DTVideos.push(function() {window.DTVideos.PlayerFactory.create({\"aspect\":1.7777777778,\"autoplay\":false,\"id\":\"dt-video-embed-5c549d9b499b1\",\"lazy\":true,\"mute\":false,\"playlist\":{\"imageUrl\":\"https:\\/\\/icdn6.digitaltrends.com\\/image\\/poster-for-5788226236001-720x720.jpg\",\"mediaId\":\"5788226236001\"}}).catch(function(err) { console.error(err.message); });});</script><meta itemprop=\"name\" content=\"Video: DT Daily: Subaru Ascent attempts to climb a mountain of competition\"><meta itemprop=\"url discussionUrl\" content=\"https://www.digitaltrends.com/digital-trends-live/subaru/\"><meta itemprop=\"description\" content=\"\"><meta itemprop=\"uploadDate\" content=\"2018-05-22T11:23:27+00:00\"><meta itemprop=\"embedUrl\" content=\"https://players.brightcove.net/5340004208001/Hkov7xwff_default/index.html?videoId=5788226236001\"><meta itemprop=\"thumbnail thumbnailUrl\" content=\"https://icdn6.digitaltrends.com/image/poster-for-5788226236001-720x720.jpg\"></div>Six Stars Ascending </strong></p>",
            "<p>Here in the Northwest where Digital Trends is headquartered, just about every third car on the road (or off of it) is a Subaru Outback or Forester. OK, maybe every <em>fourth</em> car. Why? Because with everything from sandy beaches to high desert to ski-resort tipped mountains, <a href=\"https://www.facebook.com/Oregon-Off-Road-Subaru-Club-488401814602206/\" target=\"_blank\" rel=\"noopener\">we need a car that can essentially go… anywhere</a>. And up until now, the one type of car Subaru hasn’t really perfected is the “Big SUV.” But at long last, the Japanese automaker has birthed their biggest baby, the Subaru Ascent. Automotive tester Stephen Edelstein took the new Suby to task, after Subaru kindly decided to roll it out here in Oregon, where Subarus literally outsell… just about everything.</p>",
            "<p>The Ascent features a new 2.4-liter turbo flat-four engine, their latest All Wheel Drive (AWD) system, and a whole bunch of tech including their suite of “EyeSight”driver aids, Android Auto, Apple Carplay, and a booming Harman/Kardon sound system. The Ascent starts at about $32,000, but our test rig was kitted out to the tune of about $45,000. And yes, the roof rails are already car-top-tent compatible. Bottom line? The Ascent is a capable rig that competes, but there is a lot of competition. <a href=\"https://www.digitaltrends.com/car-reviews/2019-subaru-ascent-review/\">Check out Stephen’s hands-on review to see how it stacks up.</a></p>",
            "<p><strong>Guessing game </strong></p>",
            "<p>Just when you thought the nightmare of the Spectre and Meltdown CPU bugs was over, here it comes again. <a href=\"https://www.digitaltrends.com/computing/intel-spectre-like-bug-firmware/\">This time, the problem is called “speculative store bypass,”</a> and it’s related to the Spectre bug afflicting Intel CPUs and some other computer chips. A patch, update and so forth to deal with the problem is already available, but the downside is that those fixes can also affect CPU performance. One test by Intel indicated that CPU performance could suffer from 2 to 8 percent.</p>",
            "<p>However, it looks like the SSB exploit is pretty tough to exploit, as it were, so some users may decide to pass on the patch in order to preserve performance. Good idea? It might depend on how you – and others – use your PC. The Spectre, Meltdown and SSB bugs are hardware-related (the flaw is in the physical CPU), so while software and firmware can patch things up, they are not permanent fixes. Intel says <a href=\"https://www.digitaltrends.com/computing/intel-meltdown-spectre-silicon-fixes-ice-lake/\">the next generation of chips will not have the flaws,</a> but at this point, we’ll just have to take their word for it.</p>",
            "<p><strong>Whoopsies</strong></p>",
            "<p>HTC has just let slip their next flagship phone, <a href=\"https://www.digitaltrends.com/mobile/htc-u12-plus-news/\">the U12 Plus</a>, according to an eagle-eyed tech watcher who says the company “accidentally” posted up the phone on a “test” website. The page has since been pulled down, but of course, not fast enough for tech watcher <a href=\"https://twitter.com/rquandt/status/998847658205892608\" target=\"_blank\" rel=\"noopener\">Roland Quandt</a>, who quickly sucked up all the tech details.</p>",
            "<p>The U12 Plus will likely feature a notch-free 6-inch 2880×1440 LCD screen with minimal bezels, 6 gigs of RAM, 64 or 128 gigs of storage, the new Snapdragon 645 chip, “BoomSound” speakers, Android Oreo, dual cameras out back and a toilet-resistant IP68 rating. Sounds pretty solid. Pricing looks to be more than $900 but less than $1,000, and there will be several color options. The <em>officia</em>l U12 release date is Wednesday.</p>",
            "<p><strong><em>We’ve got more news on our <a href=\"https://www.facebook.com/DigitalTrends/?ref=br_rs\" target=\"_blank\" rel=\"noopener\">Facebook page</a> and <a href=\"https://www.youtube.com/channel/UC8wXC0ZCfGt3HaVLy_fdTQw\" target=\"_blank\" rel=\"noopener\">YouTube channel</a>, and be sure to tune in to this week’s DT podcasts: <a href=\"\">Trends with Benefits</a> (general tech shenanigans)  on Thursdays, and <a href=\"\">Between the Streams</a> (movie and TV topics) every Friday.</em></strong></p>"
        ]
    },
    {
        "title": "\n\t\tHTC U12 vs Google Pixel 2 XL: Can HTC take out the stock Android king?\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>HTC has finally unveiled the new HTC U12 Plus, its latest and greatest flagship phone aimed at taking on the likes of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Samsung Galaxy S9</a>, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-g7-thinq-review/\">LG G7 ThinQ</a>, and the Google Pixel 2 XL. The new device boasts the latest Qualcomm chip, plenty of RAM, and dual-sensor cameras on both the front and the back.</p>",
            "<p>But just how does it compare with the likes of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-xl-review/\">Google Pixel 2 XL</a>, considered by many to be the best Android phone on the market? We put the HTC U12 Plus and Google Pixel 2 XL head-to-head to find out.</p>",
            "<p>Both the HTC U12 Plus and Google Pixel 2 XL may be flagship phones, but that doesn’t mean that they feature the same specs. In fact, they don’t. The Google Pixel 2 XL, for starters, is a 2017 flagship, meaning that it uses the slightly outdated Qualcomm Snapdragon 835 processor and 4GB of RAM, compared to the <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a> and 6GB of RAM on offer in the HTC U12 Plus. In other words, while the Google Pixel 2 XL will perform perfectly well for the vast majority of users, the HTC U12 Plus will simply be faster. It may not necessarily feel much faster because the stock Android experience on the Pixel 2 XL is as slick as they come.</p>",
            "<p>Both of the phones offer options for 64GB or 128GB of storage, but the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u12-plus-review/\">HTC U12 Plus</a> has a MicroSD card slot — meaning you can expand upon that storage if you want.</p>",
            "<p>When it comes to battery capacity, the phones are very similar. The HTC U12 Plus’ battery comes in at 3,500mAh, while the Pixel 2 XL has a 3,520mAh battery. Both the phones support Qualcomm’s Quick Charge 3.0.</p>",
            "<p>In the end, the phones have some similarities, but the HTC U12 Plus has more raw power under the hood and expandable storage.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/e1c6d7ade51687c100dce24a52914d8f0f54c8ea/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"HTC\">HTC U12 Plus</a></strong></p>",
            "<p>When it comes to design, the phones are a little different. The HTC U12 Plus features a glass-back design with a few different color options. It also offers a dual-sensor camera with a fingerprint sensor. The Google Pixel 2 XL also has a fingerprint sensor on its back, but only a single-lens camera and a half-glass back.</p>",
            "<p>On the front, the two phones have some similar features. The display on the Google Pixel 2 XL features rounded corners and a forehead and chin — unlike many 2018 flagships. The HTC U12 Plus actually keeps the forehead and chin, doing away with the rounded corners on the display.</p>",
            "<p>The phones are a little hit-and-miss when it comes to durability. The HTC U12 Plus features IP68 water-resistance, meaning it should withstand up to 1.5 meters of water for up to 30 minutes, while the Google Pixel 2 XL offers a IP67 rating, limiting the depth of water to 1 meter. Still, the glass back on the HTC U12 Plus means it’s more prone to shattering.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>Both the Google Pixel 2 XL and the HTC U12 Plus feature a 6-inch display, along with a resolution of 2,880 x 1,440 pixels. Where they differ, however, is in display type — while the HTC U12’s display is a Super LCD, the Google Pixel 2 XL instead offers a P-OLED display — meaning it should offer deeper blacks and slightly brighter colors.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/8d798beeb500b69003fbbbfc9c01c2c699198f59/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Google Pixel 2 XL</a></strong></p>",
            "<p>Perhaps the most interesting thing to note about the HTC U12 Plus is that it features two dual-sensor cameras — one on the back, and one on the front. On the back of the phone, you’ll find a 12 megapixel wide-angle lens with an aperture of f/1.8, coupled with a 16 megapixel telephoto lens which has an aperture of f/2.6.</p>",
            "<p>The Google Pixel 2 XL’s camera is a whole different beast. Google has decided to develop artificial intelligence to perform many of the same tasks you would expect from a dual-sensor camera, and it manages to do so pretty well. Many consider it to be the <a href=\"https://www.digitaltrends.com/mobile/best-camera-phones/\">best phone camera</a> on the market. The device has a 12.2 megapixel rear-facing camera with an aperture of f/1.8.</p>",
            "<p>Around the front, HTC has again gone for the dual-sensor camera. The device offers a dual 8-megapixel camera aimed at applying Portrait Mode effects to selfies. The front-facing camera on the Google Pixel 2 XL comes in at 8 megapixels.</p>",
            "<p>We’ll have to wait to see just how good the HTC U12 Plus’ camera really is. For now, this one’s a tie.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The HTC U12 Plus and Google Pixel 2 XL both currently have Android 8.0 Oreo, and they’ll both be getting the update to <a href=\"https://www.digitaltrends.com/mobile/possible-android-p-names/\">Android P, whatever it ends up being called</a>, once it becomes available to customers. Still, when it comes to updates, Google will likely be much faster at getting them out to customers.</p>",
            "<p>While the Google Pixel 2 XL offers a stock take on Android, HTC has made a few tweaks for the U12 Plus. The tweaks fall under the HTC Sense UI, and they include things like support for Amazon’s Alexa and an A.I. Companion.</p>",
            "<p>Still, given the quick updates, we’re giving Google the win here.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/8d798beeb500b69003fbbbfc9c01c2c699198f59/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Google Pixel 2 XL</a></strong></p>",
            "<p>HTC offers the innovative Edge Sense, a feature that allows you to squeeze the phone to activate certain functions. You can use it to open Google Assistant or snap a photo, for example. HTC has gone a step further this time around to allow users to double tap the side of the phone to activate a feature. Thankfully, Edge Sense is user programmable, so you can dictate what each action should do.</p>",
            "<p>The U12 Plus also offers HTC’s BoomSound speakers, which aim to offer stereo sound through the bottom-firing speaker and top earpiece.</p>",
            "<p>The Google Pixel 2 XL may feature stock Android, but that doesn’t mean it doesn’t have some cool features of its own — though most of those cool features are available on non-Pixel phones. For example, Google Lens, which offers intelligent image recognition, was <a href=\"https://www.digitaltrends.com/mobile/google-lens-on-all-android-coming-to-ios/\">expanded to other phones</a> a few months ago.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/e1c6d7ade51687c100dce24a52914d8f0f54c8ea/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"HTC\">HTC U12 Plus</a></strong></p>",
            "<p>The phones are both flagship devices, but they don’t have the exact same price. The Google Pixel 2 XL starts at $850, while the HTC U12 Plus starts at only $800 for the 64GB version. For the 128GB Google Pixel 2 XL, you’ll need to shell out a cool $950, while the HTC U12 Plus 128GB model rings in at $850.</p>",
            "<p>This is a close contest. The HTC U12 Plus may feature improved performance and newer specs, but the Google Pixel 2 XL is able to hold its own when it comes to things like the display. That begs the question: Which one should you buy? Well, if you’re looking for a phone with the best performance possible, then the HTC U12 Plus is an excellent choice. If, however, you prefer to get a stock Android experience with quick updates and the best camera software, the Pixel 2 XL still tops the charts.</p>"
        ]
    },
    {
        "title": "\n\t\tNew HTC U12 Plus literally puts the squeeze on more expensive top-tier phones\t",
        "author": [
            "\n\t\t\t\t\t\tBill Roberson\t\t\t\t\t"
        ],
        "text": [
            "<p><strong><div class=\"dtvideos-container\" itemprop=\"video\" itemtype=\"http://schema.org/VideoObject\"><div id=\"dt-video-embed-5c549d9b59078\" style=\"padding-bottom:56.2499999993%;\"></div><script>window.DTVideos = window.DTVideos || [];window.DTVideos.push(function() {window.DTVideos.PlayerFactory.create({\"aspect\":1.7777777778,\"autoplay\":false,\"id\":\"dt-video-embed-5c549d9b59078\",\"lazy\":true,\"mute\":false,\"playlist\":{\"imageUrl\":\"https:\\/\\/icdn5.digitaltrends.com\\/image\\/poster-for-5788794895001-720x720.jpg\",\"mediaId\":\"5788794895001\"}}).catch(function(err) { console.error(err.message); });});</script><meta itemprop=\"name\" content=\"Video: HTC U12 Plus puts the (literal) squeeze on more expensive top-tier phones\"><meta itemprop=\"url discussionUrl\" content=\"https://www.digitaltrends.com/digital-trends-live/htc-u12-plus/\"><meta itemprop=\"description\" content=\"\"><meta itemprop=\"uploadDate\" content=\"2018-05-23T12:16:29+00:00\"><meta itemprop=\"embedUrl\" content=\"https://players.brightcove.net/5340004208001/Hkov7xwff_default/index.html?videoId=5788794895001\"><meta itemprop=\"thumbnail thumbnailUrl\" content=\"https://icdn5.digitaltrends.com/image/poster-for-5788794895001-720x720.jpg\"></div><a href=\"https://www.frameandoptic.com/novelty-x-ray-vision-mad-scientist-horned-rim-sunglasses.html?_vsrefdom=adwords&amp;gclid=EAIaIQobChMI_uPXjcGc2wIVhUsNCh0ZNgpMEAQYAyABEgIEnfD_BwE\" target=\"_blank\" rel=\"noopener\"> X-Ray Spex</a> not included (or needed)</strong></p>",
            "<p>We hinted at it yesterday, and today it’s out and we have our hot little hands on it: HTC’s new U12 Plus flagship smartphone. Just as we predicted yesterday, the phone has made its debut today, May 23<sup>rd</sup>, and DT’s Mobile tech editor <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u12-plus-review/\">Julian Chokkatu spent some time poking around with a pre-release unit and came away impressed</a>. But how does it hold up against some serious competition, such as the iPhone X and Galaxy S9? Pretty well, with dual cameras front and rear, the new Snapdragon chip and a largely expected list of high-end specs.</p>",
            "<p>One thing we were pleased to see? The back of the phone is slightly translucent, letting you see some of the internal components. But it’s not transparent per se, and overall looks normal. And the buttons on the phone are a bit different as well: They are fixed and don’t move when you press them; they register the pressure of how hard you press them. That “not really a button” approach helps keep the phone sealed to an IP68 standard, so feel free to use it in the rain, and it should survive an accidental plunge into a pool just fine as well.</p>",
            "<p>The phone retains the EdgeSense squeeze control system, which is quirky but useful. One thing the U12 Plus does not have is wireless charging. After years of being the big upcoming feature for cell phones, HTC told us they’re actually kind of meh on the idea now, and the U12 Plus uses a friendly USB-C jack to juice up. We were a bit off on the price, looks like the U12 Plus – and there is no “non-Plus” model – is $800 for the base model.</p>",
            "<p><strong>Here’s what we know</strong></p>",
            "<p>After the Cambridge Analytica scandal rocked Facebook, a lot of people downloaded their Facebook data and were amazed – and often terrified – at the vast amount of information the social network had learned about them. Now, Apple is letting customers do the same thing with a new privacy information download section on their site, and initial impressions seem to indicate that Apple stores up a lot less information about you than expected – or at least a lot less than Facebook.</p>",
            "<p>Instead of burying their data and privacy policies on some nearly unfindable back alley on their site, <a href=\"https://privacy.apple.com/account\" target=\"_blank\" rel=\"noopener\">Apple has expanded their policy page into a full-blown portal</a> where you can see – and download – everything Apple knows about you – or at least what they are willing to say they know. And once you sign in, you can also change up your information metrics – or just delete your account all together. So while you should be rightfully concerned about how much data about you is floating around on the web, it’s good to see some companies are finally make it easier to see what they know about you – and even delete that data if need be.</p>",
            "<p><strong>Also works as a small heater</strong></p>",
            "<p>How do you make a gaming PC perform better? <a href=\"https://www.digitaltrends.com/desktop-computer-reviews/alienware-area-51-r5-review/\">Just add money</a> (as usual), and maybe some high-performance GPUs, right? But that gets to be a bit more difficult if your gaming rig is a laptop, because of that whole not-much-room-for-a-better-graphics-card problem. Solution? <em>The external GPU</em>, something now available from gaming and graphics PC purveyor Razer. The new Razer Stealth gaming laptop is a capable performer to be sure, <a href=\"https://www.digitaltrends.com/laptop-reviews/razer-blade-stealth-2018-review/\">just read Luke Larsen’s review.</a></p>",
            "<p>But you <em>also</em> have the option to take the fun to the next level <a href=\"https://www.razer.com/gaming-laptops/razer-core-v2\" target=\"_blank\" rel=\"noopener\">by looping in the Razer Core V2 external graphics processor case</a>, which is essentially a $500 box that you drop your shiny new thousand-dollar GPU into. It connects through super-fast Thunderbolt 3 ports and once up and running, should give most sane desktop PCs a run for their gaming money. Plus it’s small enough to slip into a normal backpack if you gotta game and go. Luke put both the Stealth and the Core setups to the test to see how they compare, <a href=\"https://www.digitaltrends.com/laptop-reviews/razer-blade-stealth-2018-review/\">so check out the whole review.</a></p>",
            "<p><strong><em>We’ve got more news on our <a href=\"https://www.facebook.com/DigitalTrends/?ref=br_rs\" target=\"_blank\" rel=\"noopener\">Facebook page</a> and <a href=\"https://www.youtube.com/channel/UC8wXC0ZCfGt3HaVLy_fdTQw\" target=\"_blank\" rel=\"noopener\">YouTube channel</a>, and be sure to tune in to this week’s DT podcasts: <a href=\"\">Trends with Benefits</a> (general tech shenanigans)  on Thursdays, and <a href=\"\">Between the Streams</a> (movie and TV topics) every Friday.</em></strong></p>"
        ]
    },
    {
        "title": "\n\t\tHTC U12 Plus vs. OnePlus 6: The new kids battle for supremacy\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>If you’re looking for premium smartphone options outside of Samsung and Apple (<a href=\"https://www.digitaltrends.com/mobile/debating-between-apple-and-samsung-phones-open-your-eyes-a-little-wider/\">and you really should be</a>), then the latest flagships from HTC and OnePlus should be on your radar. As luck would have it, these two have been revealed close to each other, and they each provide incredible good looks, powerful hardware, and some amazingly fun new features.</p>",
            "<p>But, chances are, you only have the budget for one, so which is better for you? We took a look to find out.</p>",
            "<p>You’re going to get great performance regardless of your choice because both of these phones are powered by Qualcomm’s latest <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a> processor, and it’s a beast that outpaces almost everything else on the market. While OnePlus put a lot into the OnePlus 6’s lightning fast speed, the performance on the U12 Plus isn’t to be sniffed at, either, and we’re reserving judgement until we’ve had a chance to properly test both.</p>",
            "<p>In terms of battery life, you’re likely to see similar results from both of these hefty batteries — though the U12 Plus has the edge with 200mAh more capacity. We got at least a day out of the OnePlus 6, and we expect similar out of the U12 Plus. You won’t be able to wirelessly charge with either phone, despite the glass backs, but the snappy fast charging on both makes up for that. OnePlus’ <a href=\"https://www.oneplus.com/uk/3t/dashcharge\">Dash Charge</a> offers some seriously fast charging, but the <a href=\"https://www.qualcomm.com/products/quick-charge-3\">QuickCharge 3.0</a> (and optional <a href=\"https://www.qualcomm.com/news/onq/2018/02/23/how-can-quick-charge-4-turbocharge-your-mobile-device\">QuickCharge 4.0</a> support) on the U12 Plus is also very speedy. There’s nothing to separate them here, so this category has to be a tie.</p>",
            "<p><strong>Winner: Tie<br>\n</strong></p>",
            "<p>We’ve seen some jaw-droppingly beautiful phones in 2018, and these two are no exception. The OnePlus 6 has a bezel-less design, coupled with vertically stacked cameras on the rear and a cool, stadium-shaped fingerprint scanner. But it’s the glass back that’s the real draw here and the mirror-like reflective surface is incredible. OnePlus used multiple layers of glass to create the effect, and it’s clear the extra effort has been worth it. The HTC U12 Plus has a similar bezel-less design on the front, but flip it over and it’s definitely different. The arrangement of the cameras and fingerprint scanner reminds us of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v30-review/\">LG V30</a>, but like the OnePlus 6, it’s the glass back that’s the wow factor here. Specifically, the transparent effect on the Translucent Blue option. It’s very different, and not something we’ve seen from a recent flagship phone.</p>",
            "<p>Moving on to durability — you don’t need us to tell you that glass is fragile. A protective case is a good idea with both the <a href=\"https://www.digitaltrends.com/mobile/best-oneplus-6-cases/\">OnePlus 6</a> and the <a href=\"https://www.digitaltrends.com/mobile/best-htc-u12-plus-cases/\">HTC U12 Plus</a>. In terms of water resistance, only the HTC U12 Plus has any significant resistance, offering an <a href=\"https://www.digitaltrends.com/mobile/how-rugged-is-your-phone/\">IP68-rating</a> that should make sure the phone survives a trip into the toilet, or into a puddle. The OnePlus 6 has a water-resistant coating on the phone itself, but nothing to stop ingress.</p>",
            "<p>Design is a tough area to call, and we’re glad we have the difference in durability to break the stalemate here. The enhanced water resistance on the HTC U12 Plus wins this round.</p>",
            "<p><strong>Winner: HTC U12 Plus<br>\n</strong></p>",
            "<p>Like big screens? Good, because you’ll find large screens on both. You’ll find a 6-inch Super LCD display on the U12 Plus, running a 2,880 x 1,440-pixel resolution. It’s a bright, sharp screen with a pixels-per-inch (ppi) measurement of 537, making it pretty crisp. The 6.28-inch screen on the OnePlus 6 is huge, bright, and colorful — though you won’t get the same sharpness as you would on the HTC U12 Plus, with the OnePlus phone’s resolution maxing out at 2,280 x 1,080 pixels (402 ppi). However, the LCD in the U12 Plus can’t match the inky blacks you’ll get with the OnePlus 6’s AMOLED screen.</p>",
            "<p>The HTC U12 Plus’s screen is big and beautiful, but we’re suckers for the inky blacks and vibrant colors on an AMOLED display. Despite the sharper HTC display, the OnePlus 6 takes this.</p>",
            "<p><strong>Winner: OnePlus 6<br>\n</strong></p>",
            "<p>Hubble bubble, double trouble — both of these phones are rocking dual-lens cameras. You’ll find a 16-megapixel and 20-megapixel lens on the back of the OnePlus 6, while the HTC U12 Plus comes with a 12-megapixel and 16-megapixel duo for snapping goodness. We’ve not finished our tests on either of these phones yet, but the initial impressions of both are pretty good — though the HTC U12 Plus has passed <a href=\"https://www.dxomark.com/htc-u12-camera-review-knockout-results/\">DxOMark’s camera tests</a> with flying colors, coming second only to the stupendous <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">Huawei P20 Pro</a>, so we’re expecting great things.</p>",
            "<p>If you’re more of a fan of video, then you’ve come to the right place regardless, since both phones can shoot in 4K resolution at 60 frames per second. You’ll get more out of the OnePlus 6 though, as it offers slow-motion videos at 480 fps — the HTC U12 Plus can only manage 240 fps slo-mo. That said, the U12 Plus also comes with the Sonic Zoom video feature, which easily matches OnePlus’s slow motion, allowing you to focus on and boost the sound of your subject.</p>",
            "<p>Which one you prefer is likely going to come down to personal preference. We suspect that the HTC U12 Plus will outperform the OnePlus 6 in our longer tests, but we wouldn’t bet the farm on that yet. This has to be a tie.</p>",
            "<p><strong>Winner: Tie<br>\n</strong></p>",
            "<p>Open up either of these phones and you’ll recognize the latest version of Android on both. The OnePlus 6 comes with a slightly altered version of Android — OnePlus’ own OxygenOS — but it’s easily used by anyone with previous Android experience. The same is true of the HTC U12 Plus, which is running mostly standard <a href=\"https://www.digitaltrends.com/mobile/android-o-news/\">Android 8.0 Oreo</a>, with a couple of HTC additions thrown in.</p>",
            "<p>If you’re looking for devices that are likely to be updated to the latest versions of Android quickly then you’re also in luck — both OnePlus and HTC have <a href=\"https://www.digitaltrends.com/mobile/android-oreo-when-do-you-get-it/\">excellent records with Android updates</a>, being among the first brands to update their back catalog of phones when the newest version of Android surfaces. Expect to see <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android P</a> on both of these phones not too long after it arrives.</p>",
            "<p><strong>Winner: Tie<br>\n</strong></p>",
            "<p>The OnePlus 6 brings you flagship specs at a midrange price — as such, corners do have to be cut elsewhere to make sure the quality is kept high in the areas that count. That’s probably why you won’t see much in the way of special features on the OnePlus 6. You’ll find face unlock on the OnePlus 6, as well as an optional gesture-based navigation system that replaces the navigation keys — both similar to the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a>. There’s also the “Shelf,” which shows your most recent apps, contacts, and other information, for quick access.</p>",
            "<p>In contrast, the U12 Plus comes with more special features than you can shake a stick at. The <a href=\"https://www.htc.com/uk/support/htc-u11/howto/what-is-edge-sense.html\">Edge Sense</a> squeezable sides are back from the HTC U11, with the addition of a new, single-side squeeze command. The sensors will also sense which way you’re holding your phone, and not rotate the view if you’re lying on your side. HTC has also included “<a href=\"https://www.htc.com/us/phone-features/htc-boomsound/\">BoomSound,</a>” making for better speaker quality.</p>",
            "<p><strong>Winner: HTC U12 Plus<br>\n</strong></p>",
            "<p>The HTC U12 Plus is currently up for pre-order from HTC’s website and Amazon, with prices starting at $800 for the 64GB model. You’ll need to be with specific carriers though, as it’s only certified to work on AT&amp;T, T-Mobile, and Verizon. The OnePlus 6 is a lot cheaper, with prices starting at just $530 — though it’ll only work on AT&amp;T and T-Mobile.</p>",
            "<p>The OnePlus 6 is one hell of a machine, with some incredible hardware and zippy software. However, money talks, and the HTC U12 Plus is just slightly stronger in a few categories, making it the phone to buy. However, if your budget isn’t up to tackling an $800 phone, then the OnePlus 6 is a strong choice. But otherwise, it’s the HTC phone all the way.</p>"
        ]
    },
    {
        "title": "\n\t\tHTC U12 Plus vs. LG G7 ThinQ: Which powerful flagship prevails?\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>While we’re always the first to acknowledge excellence, it’s important to remember there are <a href=\"https://www.digitaltrends.com/mobile/debating-between-apple-and-samsung-phones-open-your-eyes-a-little-wider/\">a lot of great phones</a> out there that don’t have “Apple” or “Samsung” stamped on them. High on that list will almost always be the latest offerings from LG and HTC, and if you’re not keen on the latest iPhone or Galaxy flagship, then these companies are a great place to start. That’s especially true with the <a href=\"https://www.digitaltrends.com/mobile/lg-g7-news-version-1527796570/\">LG G7 ThinQ</a> and the <a href=\"https://www.digitaltrends.com/digital-trends-live/htc-u12-plus/\">HTC U12 Plus</a>.</p>",
            "<p>Now, the question becomes which of these two should you buy? With powerful specs, great displays, and 2018-worthy designs, it can be hard to pick between the two. We’ve taken an in-depth look at both phones, so you know which one is best for you.</p>",
            "<p>With the brand-new and powerful <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a> powering these devices, you’re likely to get similar great performance out of them. The U12 Plus has a small advantage with 6GB of RAM as standard, but the impact is <a href=\"https://www.digitaltrends.com/mobile/how-much-ram-does-a-smartphone-need/\">likely to be minimal</a>. Expect great performance from both in a variety of apps and games.</p>",
            "<p>The G7 ThinQ’s 3,000mAh battery surprised us <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-g7-thinq-review/\">during testing</a>, providing strong performance that belied its smaller capacity. It could easily manage more than one day on standard usage, and it’s unlikely to disappoint. We’ve not had a chance to fully test the HTC U12 Plus’ 3,500mAh battery yet, but we expect the extra capacity will prove to be a strong contender in this fight. There’s <a href=\"https://www.qualcomm.com/products/quick-charge-3\">QuickCharge 3.0</a> support enabled for both right out of the box, with the option to attach a <a href=\"https://www.qualcomm.com/solutions/mobile-computing/features/quick-charge\">QuickCharge 4.0</a> adapter, if you have one. There’s wireless charging on the G7 ThinQ, but none on the U12 Plus, despite the glass back.</p>",
            "<p>This is an exceptionally tough fight for us to judge. There’s a lot here that’s equal between the two phones. Without proper testing of the HTC’s battery life, we think the inclusion of wireless charging just ekes out the win for the G7 ThinQ.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/d2d2191d6a731416e491cb3b4a102deda3778411/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">LG G7 ThinQ</a><br>\n</strong></p>",
            "<p>The LG G7 ThinQ boasts an extremely up-to-date design with a glass body, notched display, and bezel-less design — and while that’s a good thing, it’s also a little boring. While it’s a pretty enough phone, there’s not much here to differentiate the G7 ThinQ from the competition, and that’s honestly a real downside. In contrast, while the U12 Plus hits similar notes — bezel-less design and glass build — there’s enough of HTC’s unique touches to make it really stand out. The Liquid Surface design ethos that debuted last year is beautiful, and the Translucent Blue’s transparent back is stunning. There’s at least one major downside to HTC’s design choices — the death of the headphone jack started with the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u11-review/\">HTC U11</a> and it has not been resurrected here.</p>",
            "<p>Durability-wise, you can expect similar performance from both of these phones. Both are water- and dust-resistant up to an IP68 rating, but with all that glass, you can bet you’re going to want a <a href=\"https://www.digitaltrends.com/mobile/best-lg-g7-thinq-cases/\">protective case</a> <a href=\"https://www.digitaltrends.com/mobile/best-htc-u12-plus-cases/\">for both</a>.</p>",
            "<p>Despite the lack of headphone jack, the U12 Plus’ improved design just barely puts it ahead of the G7 ThinQ.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/f61a25b884b67d88e8f8515cbc7b55ba18c8cf8a/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">HTC U12 Plus</a><br>\n</strong></p>",
            "<p>There are two great 1,440p screens on display here. The G7 ThinQ’s screen is the larger of the two, a 6.1-inch LCD display running a taller than average 19.5:9 aspect ratio, 3,120 x 1,440-pixel resolution. It supports <a href=\"https://www.digitaltrends.com/home-theater/what-is-hdr-tv/\">HDR10</a>, and comes with a boosted brightness mode for direct sunlight. LG refers to the area around the notch as the “second screen,” and you can turn it into black bars if you want to hide the notch.</p>",
            "<p>The U12 Plus’ 6-inch Super LCD display has a more standard 18:9 aspect ratio, running a 2,880 x 1,440-pixel resolution. It’s not as sharp as the G7 ThinQ’s display, but we doubt anyone would notice the tiny difference between the two. We did notice that the U12 Plus’ display was slightly harder to see in direct sunlight though, and while we haven’t finished our full tests on the U12 Plus’ display, that leads us to suspect the G7 ThinQ has a slight lead here.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/d2d2191d6a731416e491cb3b4a102deda3778411/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Verizon\">LG G7 ThinQ</a><br>\n</strong></p>",
            "<p>The G7 ThinQ comes with a pair of 16-megapixel lenses — one standard, one wide-angle — and they provided some decent test images during our review. The wide-angle mode took some especially notable shots, but it’s let down by the low light performance, even with the Super Bright Camera enabled. The AI Cam does help in some circumstances, but on the whole, low-light performance is fairly disappointing. Still, the overall performance is solid.</p>",
            "<p>We haven’t had a chance to really dig into the U12 Plus’ capabilities yet, but we’re hopeful. The phone has been <a href=\"https://www.dxomark.com/htc-u12-camera-review-knockout-results/\">awarded a high mark</a> by camera tester DxOMark, placing it second only to the stunning <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">Huawei P20 Pro</a> right now, and the dual 12-megapixel and 16-megapixel telephoto lenses really seem to take care of business. We reckon the U12 Plus’ camera will be a surprise hit when we fully test it.</p>",
            "<p>In terms of video, both are capable of 4K recording and slow motion of up to 240 frames per second — the U12 Plus can achieve 240fps at 1080p, while the G7 ThinQ is stuck at 720p.</p>",
            "<p>Initial tests of the U12 Plus are strong, and we’re expecting it’ll do very well in our tests. It wins this round.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/f61a25b884b67d88e8f8515cbc7b55ba18c8cf8a/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">HTC U12 Plus</a><br>\n</strong></p>",
            "<p>You won’t find pure stock Android on either of these phones, but they’re pretty close. The U12 Plus is the closest to <a href=\"https://www.digitaltrends.com/mobile/what-is-stock-android/\">stock Android</a>, with the phone running on <a href=\"https://www.digitaltrends.com/mobile/android-o-news/\">Android 8.0 Oreo</a>, with a few HTC additions like Blinkfeed. The G7 ThinQ uses a slightly adapted skin over the top of Android 8.0 Oreo, but it’s still fairly close to a stock experience. Either way, no one with previous Android experience should have an issue with these quick and snappy interfaces.</p>",
            "<p>You can bet your bottom dollar that both of these phones will be getting an eventual upgrade to <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android P</a>. However, HTC has generally been <a href=\"https://www.digitaltrends.com/mobile/android-oreo-when-do-you-get-it/\">quicker with Android upgrades</a> than LG, which wins the U12 Plus this round.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/f61a25b884b67d88e8f8515cbc7b55ba18c8cf8a/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">HTC U12 Plus</a><br>\n</strong></p>",
            "<p>As befits premium flagships, both of these phones are chock-full of special features. The G7 ThinQ is part of the <a href=\"http://www.lg.com/us/discover/smartthinq/thinq\">ThinQ brand</a>, which means it’ll be able to talk with other LG devices with the ThinQ name. We suspect you’ll find some of the other features more useful though, with the amazing Boombox sound especially worthy of note, as is the dedicated button for activating the Google Assistant.</p>",
            "<p>The U12 Plus also has its own special way of activating the Google Assistant — <a href=\"https://www.digitaltrends.com/mobile/htc-edge-sense-update/\">Edge Sense</a>. The “squeeze-to-activate” feature from the HTC U11 is back, and it’s better than ever. HTC has added some new options in there, with the U12 Plus supporting single-edge squeezing. A double tap on either side will activate one-handed mode — a great idea on a phone this large. The U12 Plus also uses the Edge Sense sensors to detect how you’re holding your phone, so it’ll know whether to rotate your view based on how you’re holding it. The U12 Plus comes with HTC’s <a href=\"https://www.htc.com/us/phone-features/htc-boomsound/\">BoomSound</a> for better sound quality.</p>",
            "<p>In our eyes, the HTC phone has more special features that you’re likely to use day-to-day.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/f61a25b884b67d88e8f8515cbc7b55ba18c8cf8a/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">HTC U12 Plus</a><br>\n</strong></p>",
            "<p>The HTC U12 Plus is currently available for pre-order, and the base model will set you back $800. However, it’s only available on AT&amp;T, T-Mobile, and Verizon’s networks. The LG G7 ThinQ is now available for sale, with prices starting from $750. The G7 ThinQ is available from most carriers, with the exception of AT&amp;T.</p>",
            "<p>It was a hard-fought battle on both sides, but thanks to its fresh design, incredible camera, and special features, the HTC U12 Plus has come out the other end as the stronger phone. That’s not to say the G7 ThinQ is a bad choice, though — it’s got amazing power, some fresh ideas, and a super-sharp display, even if the design leaves a bit to be desired. But for our money, the HTC U12 Plus is simply the better phone of the two.</p>"
        ]
    },
    {
        "title": "\n\t\tApple iPhone XS Max vs. HTC U12 Plus: Does more expensive mean better?\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>Apple has finally taken the wraps off the latest and greatest set of iPhones, including the ultra-premium iPhone XS, the massive iPhone XS Max, and the so-called “budget” device, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xr-review/\">iPhone XR</a>. Featuring a new processor, improved camera features, and more, the new iPhones have a lot going for them. In particular, it seems like the iPhone XS Max is a great phone — considering its huge display and top-tier specs.</p>",
            "<p>But how does the iPhone XS Max fare against other flagship phones for the year? The HTC U12 Plus is HTC’s best phone so far, boasting premium specs, a dual-sensor camera, and more. In case you’re considering buying one of these phones, we’ve put them head-to-head to find out which is better.</p>",
            "<p>Under the hood, the two phones are pretty different devices. While many Android flagships feature the latest Qualcomm processor, Apple makes its own mobile processors for its smartphones. The iPhone XS Max features Apple’s all-new A12 Bionic chip with 4GB of RAM, while the HTC U12 Plus boasts a <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Qualcomm Snapdragon 845</a> and 6GB of RAM. Both chips are very powerful, though when it comes to sheer performance, it seems as though the A12 Bionic is ahead of the pack, based on early benchmarks.</p>",
            "<p>The actual battery capacity on the two phones is similar, but the HTC U12 Plus comes out ahead, with its 3,500mAh battery — versus the 3,174mAh battery on the iPhone XS Max. That, however, doesn’t necessarily mean that the HTC U12 Plus will last longer on a charge, especially considering the improvements Apple has made in the processor to boost power efficiency. On top of that, the iPhone features wireless charging, something that the HTC U12 Plus does not offer.</p>",
            "<p>Because of the better performance and the addition of wireless charging, the iPhone is the winner here.</p>",
            "<p><strong>Winner: Apple iPhone XS Max</strong></p>",
            "<p>Both the HTC U12 Plus and the iPhone XS Max are relatively well-designed, but the iPhone simply seems a little more modern. Part of that has to do with the fact that the iPhone boasts an edge-to-edge display, while the HTC U12 Plus has a small forehead and chin. Both phones have a metal frame and a glass back. The U12 Plus has a fingerprint sensor on the back below the camera module, while the iPhone XS Max relies on the front-facing camera for <a href=\"https://www.digitaltrends.com/mobile/apple-face-id-head-start/\">FaceID</a>.</p>",
            "<p>While both phones feature IP68 water resistance, which safeguards against drops into shallow water, they won’t cope well with drops, so cases are a good idea. Neither of the two phones feature a headphone jack. The HTC U12 Plus features a USB-C port, while the iPhone XS Max, as you’d expect, has a Lightning port.</p>",
            "<p>The iPhone XS Max is the more modern and attractive of the two.</p>",
            "<p><strong>Winner: Apple iPhone XS Max</strong></p>",
            "<p>The HTC U12 Plus and iPhone XS Max have pretty different displays. For starters, the HTC U12 Plus features a higher resolution, thanks to its 2880 x 1440-pixel display. But in almost every other metric, the iPhone wins out. The iPhone’s display, for example, is larger, and it’s an OLED display which offers much higher contrast and inky blacks you just won’t find with LCD.</p>",
            "<p>While the resolution is slightly higher on the HTC phone, considering the fact that the iPhone’s display is better in every other metric, it’s the winner here.</p>",
            "<p><strong>Winner: Apple iPhone XS Max</strong></p>",
            "<p>Both the HTC U12 Plus and the iPhone XS Max feature dual-sensor rear-facing cameras, but they’re not necessarily created equal. The HTC U12 Plus features a dual 12-megapixel and 16-megapixel rear-facing camera. The main lens has an aperture of f/1.75, which should be fine for many low-light shots. The secondary lens on the HTC U12 Plus offers 2x optical zoom and a Portrait Mode, which we found to perform decently well in <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u12-plus-review/\">our review</a>.</p>",
            "<p>The iPhone XS Max, on the other hand, offers dual 12-megapixel lenses with an aperture of f/1.8 in the main lens. Like the U12 Plus, the iPhone XS Max’s secondary lens offers 2x optical zoom, and also supports things like Portrait Mode, with the option to adjust background blur after capturing the shot. There’s also a new sensor and software in the iPhone XS Max, compared to last year’s iPhone X, enabling it to combine frames for perfect exposure.</p>",
            "<p>The cameras are similar, but ultimately the image processing and software of the iPhone beat out the camera on the HTC U12 Plus. At this point, if you’re an Android user and want the device with the best camera, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-xl-review/\">Google Pixel</a> series is probably the way to go.</p>",
            "<p>The front-facing cameras are also relatively different on the two devices. The HTC U12 Plus offers dual 8-megapixel lenses on the front, while the iPhone XS Max instead offers a single 7-megapixel sensor. The iPhone, however, boasts features like Face ID — something the HTC U12 Plus doesn’t have.</p>",
            "<p><strong>Winner: Apple iPhone XS Max</strong></p>",
            "<p>We’re not going to do a deep dive into the <a href=\"https://www.digitaltrends.com/mobile/android-vs-ios/\">Android vs. iOS debate</a> — but we will go through a few main points. Android, for starters, is generally a little more customizable. You can add widgets where you want to add them, install apps from third-party app stores, and so on. With iOS, on the other hand, you get a slick, accessible platform that’s a little more organized. Everything is pretty much where you expect it to be, and it’s generally pretty secure.</p>",
            "<p>Updates, however, are another issue — and one that iOS far excels in. With an iPhone, you’ll get the update as soon as it’s available, as long as your phone is compatible. With an Android phone, that’s really only true for Pixel phones — HTC phones will likely take a few months to get new Android version updates, if they get the update at all. Because of that, the iPhone’s the winner here.</p>",
            "<p><strong>Winner: Apple iPhone XS Max</strong></p>",
            "<p>Both the iPhone XS Max and HTC U12 Plus offer a few interesting features. For starters, the iPhone XS Max features Apple’s Face ID — and while some will prefer a fingerprint sensor, it’s still an interesting bit of tech that enables other features, like Animoji.</p>",
            "<p>The HTC U12 Plus offers a few special features, but not all of them will be considered advantages. For example, we found that the digital buttons, while interesting, were overly sensitive and didn’t really work the way they should. One thing that the HTC U12 Plus does offer over the iPhone is the inclusion of Google Assistant and Amazon’s Alexa — so you can use your digital assistant of choice when you want to.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The iPhone XS Max and the HTC U12 Plus come at very different prices. While the HTC U12 Plus starts at $799, the iPhone XS Max costs $300 more than that at $1,099. Safe to say, if you’re on the fence between these two phones and money is a concern, the HTC U12 Plus may be a better choice.</p>",
            "<p>It’s hard to get around the fact that the <a href=\"https://www.digitaltrends.com/go/2869ef7e2bd2c6fba910a15a53acc25bb8e3405e/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Apple\">Apple iPhone XS Max</a> is simply a better device — but it’s also a whole lot more expensive. The iPhone is more powerful, has a better display, a better camera, and will get updates nice and quickly. You do, however, pay for those advantages — so if money is an issue and you’re not too concerned about the special features the iPhone XS Max has to offer, then the HTC U12 Plus may be for you.</p>"
        ]
    },
    {
        "title": "\n\t\tLG V35 ThinQ vs. HTC U12 Plus: Which big beauty should you buy?\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>It’s worth noting that <a href=\"https://www.digitaltrends.com/mobile/debating-between-apple-and-samsung-phones-open-your-eyes-a-little-wider/\">Apple and Samsung are not the only smartphone makers</a> turning out great devices. LG and HTC have been making <a href=\"https://www.digitaltrends.com/mobile/best-android-phones/\">great Android phones</a> for years and years — and they deserve some attention. If you’re in the market for a powerful, big smartphone packed with innovative features, then the LG V35 ThinQ and the HTC U12 Plus should both be on your radar. The question is — which phone is better? We decided to put the two devices head-to-head to find out.</p>",
            "<p>The standard flagship combination for 2018 is Qualcomm’s Snapdragon 845 processor backed by 6GB of RAM — and that’s precisely what both of these phones have inside. You can expect speedy, slick performance and the ability to multitask gracefully. Both come with 64GB of storage and have MicroSD card slots for expansion. You can also get the U12 Plus with 128GB of internal storage.</p>",
            "<p>In terms of battery life, the U12 Plus has the edge on paper with an extra 200mAh over the 3,300mAh battery in the LG V35 ThinQ, but we’re not sure that will make a big difference in every day se. They both support Quick Charge 3.0 out of the box, but the U12 Plus can also support the slightly faster <a href=\"https://www.qualcomm.com/solutions/mobile-computing/features/quick-charge\" target=\"_blank\" rel=\"noopener\">Quick Charge 4.0 standard</a>, though it will require you to buy a compatible charger separately.</p>",
            "<p>The LG V35 ThinQ scores some points back here with support for Qi wireless charging, which is sadly lacking in the HTC U12 Plus. This is a very tight category, but we’re giving the V35 ThinQ the win for the wireless charging support.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/bc02c42cf209b94d5ab79a08b12dc27579cfaffe/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"AT&amp;T\">LG V35 ThinQ</a></strong></p>",
            "<p>The LG V35 ThinQ is almost identical to the LG V30 in terms of design, which means it’s a good-looking device. There are slim bezels above and below the large screen, with no notch in sight. Rounded corners and curved aluminum edges give way to a glass back. The dual-lens camera has a fingerprint sensor below it. It’s a surprisingly light phone, but it’s big, so it’s not the easiest to manage one-handed.</p>",
            "<p>The HTC U12 Plus is very similar in size, slightly taller and thicker but not quite as wide. It also has a horizontally arranged dual-lens camera on the back, with fingerprint sensor below and an all-screen front with bezels top and bottom, though they’re a bit bigger than LG’s bezels. It’s a heavier phone, but that actually lends it a more expensive feel. HTC offers some innovation here with a complete lack of mechanical buttons, instead relying on touch-sensitive buttons and the squeezable edges for operation.</p>",
            "<p>In terms of looks, we prefer HTC’s eye-catching, liquid glass finish, with the translucent blue model being an interesting option. The V35 ThinQ looks conservative by comparison, but that will suit some people better.</p>",
            "<p>Both phones are IP68 rated, so there’s no need to panic about short dunks into water or being caught in the rain. Because of the glass sandwich designs, we strongly advise cases for both of these phones.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/3d88d0bb195db9938e4ce442824d671e7ca5c171/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">HTC U12 Plus</a></strong></p>",
            "<p>With 6-inch screens, these smartphones are among the largest on the market. Both the V35 ThinQ and the U12 Plus sports resolutions of 2,880 x 1,440 pixels. They both have an 18:9 aspect ratio and a pixel density of 538 pixels per inch. They’re both sharp and a pleasure to read on, but LG has a slight edge. The OLED screen in the V35 ThinQ offers much better contrast and we prefer it to the Super LCD in the U12 Plus. LG has also managed to achieve a slightly higher <a href=\"https://www.digitaltrends.com/mobile/bezel-less-phone-comparison/\">screen-to-body ratio</a>, which makes the large screen just a touch more manageable.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/bc02c42cf209b94d5ab79a08b12dc27579cfaffe/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"AT&amp;T\">LG V35 ThinQ</a></strong></p>",
            "<p>The dual camera is very much here to stay, and LG and HTC have embraced the trend. The V35 ThinQ pairs two 16-megapixel lens, one with an f/1.6 aperture and optical image stabilization and the other a wide-angle lens with an f/1.9 aperture. The U12 Plus has a 12-megapixel standard lens with an f/1.75 aperture, as well as a 16-megapixel telephoto lens with an f/2.6 aperture.</p>",
            "<p>Low-light photography is a weakness for the V35 ThinQ, though there is a Super Bright Camera mode, and we love the versatility of the wide angle lens. The U12 Plus boasts a superb camera that justifies the early plaudits. We know that HTC is capable of delivering strong photography, and the single-lens U11 camera impressed us last year, so it’s exciting to see what the Taiwanese manufacturer can do with a dual-lens setup.</p>",
            "<p>HTC has also chosen to go with a dual setup on the front, pairing two 8-megapixel cameras with f/2.0 apertures for great portrait selfies with blurred backgrounds. The V35 ThinQ has a single 8-megapixel camera on the front with an f/1.9 aperture.</p>",
            "<p>LG has stirred some A.I. smarts into the mix, but the AI Cam has failed to impress us so far. The V in the V35 stands for video, so there are some interesting modes you can try out to help make your home movies a bit more arresting. However, in terms of the upper limits, the U12 Plus is actually more capable, because it can capture 4K at up to 60 frames per second or 1080p at 240 fps, while the V35 is limited to 30fps and 60fps respectively.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/3d88d0bb195db9938e4ce442824d671e7ca5c171/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">HTC U12 Plus</a></strong></p>",
            "<p>Both phones run Android 8.0 Oreo out of the box, with manufacturer skins over the top. They will both get upgraded to <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android P</a>, but beyond that, it’s hard to say when. Both manufacturers have done fairly well with <a href=\"https://www.digitaltrends.com/mobile/android-oreo-when-do-you-get-it/\">Oreo rollouts</a>, so we don’t really know which will deliver the freshest flavor of Android first.</p>",
            "<p>We prefer HTC’s user interface, though the U12 Plus does have some bloatware onboard. The V35 ThinQ has some special Google Assistant commands, but we’re not keen on the look of the skin, and there’s some bloatware there too.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/3d88d0bb195db9938e4ce442824d671e7ca5c171/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">HTC U12 Plus</a></strong></p>",
            "<p>The ThinQ part of the V35 name means that your smartphone can double as a smart home controller, provided you have a bunch of ThinQ-branded LG devices. For some people, the inclusion of a 3.5mm headphone jack with a Quad DAC in the V35 will score as a special feature, especially since the U12 Plus doesn’t have one. There’s also the A.I. smarts in the camera and the video modes that we highlighted in the camera section, not to mention Google Lens integration in the camera app.</p>",
            "<p>HTC won’t be outdone in the special features department, adding new gestures to <a href=\"https://www.digitaltrends.com/mobile/htc-edge-sense-update/\">Edge Sense</a> which allows you to squeeze your phone to snap a photo, trigger Google Assistant, or something else you decide upon. With a new double tap option, it’s more versatile than ever, and the touch-sensitive buttons feel like another step toward a completely button-free phone. The powerful camera also has a few tricks up its sleeve, such as Sonic Zoom, which boosts the audio for any subject you zoom in on when shooting video.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The HTC U12 Plus costs $800 (add $50 for the 128GB model) and you can buy one direct from HTC or on Amazon. It’s certified to work on AT&amp;T, Verizon, and T-Mobile.</p>",
            "<p>You can get the LG  V35 ThinQ exclusively on AT&amp;T and Google’s Project Fi, but it costs $900.</p>",
            "<p>There really isn’t a big gap here. The LG V35 ThinQ has a superior display, a refined design, and an impressive set of features, but it doesn’t do enough to justify the extra cost. The U12 Plus boasts an excellent camera, just as much power under the hood, and plenty of tempting features of its own. We like both phones, but the HTC U12 Plus narrowly ekes out the win.</p>"
        ]
    },
    {
        "title": "\n\t\tThe best HTC U12 Plus cases to keep your phone safe and beautiful\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>So you’re a fan of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u12-plus-review/\">HTC U12 Plus</a> — and why shouldn’t you be? <a href=\"https://www.htc.com/us/\">HTC</a> has outdone itself once again with a device that is packed to the brim with the latest powerful hardware, an impressive camera suite, and some utterly gorgeous good looks. But even with all that backing it up, the <a href=\"https://www.htc.com/us/smartphones/htc-u12-plus/\">U12 Plus</a> isn’t invincible, and that’s why, if you want your phone to keep looking pretty and stay crack and scratch-free, you better look at getting some protection for it.</p>",
            "<p>But where to start? There is nowhere better than right here — we found the best HTC U12 Plus cases that will keep your phone safe.</p>"
        ]
    },
    {
        "title": "\n\t\tHTC ditches digital buttons for its midrange U12 Life\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>Last year’s <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u11-life-review/\">HTC U11 Life</a> was a midrange phone with it all — affordable with an attractive design, good performance, and some water resistance thrown in for good measure. We liked it enough to choose it as the best phone under $400 in our list of the <a href=\"https://www.digitaltrends.com/mobile/best-cheap-smartphones/\">best cheap phones</a>. HTC is back with a follow-up — aptly called the HTC U12 Life.</p>",
            "<p>The HTC U12 Life could be as good as its predecessor, boasting decent midrange specs at an affordable price, but you should know it’s not coming to the U.S. Here’s everything you need to know.</p>",
            "<p>While most 2018 flagship phones have adopted the edge-to-edge design similar to the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a> with a notch, HTC has stuck to slimmed down bezels. You get a 6-inch display with an 18:9 aspect ratio and a resolution of 2,160 x 1,080 on the front, and a noticeable forehead and chin around the screen.</p>",
            "<p>On the back, the HTC U12 Life looks a lot like a mixture between the iPhone X and a <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-review/\">Google Pixel</a>, featuring a dual-finish back. At the top, there’s a glossy finish, while the bottom two-thirds is slightly more matte. There’s a vertically-aligned dual-sensor camera in the top left-hand corner, and a fingerprint sensor at the center top. Unlike the more expensive <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u12-plus-review/\">HTC U12 Plus</a>, the U12 Life does have a headphone jack.</p>",
            "<p>One notable difference between the HTC U12 Life and HTC U12 Plus is that HTC has done away with the Digital Buttons — a feature that we found was frustrating and overly sensitive. We’re glad to see those go.</p>",
            "<p>The phone is available in two colors: Midnight blue and twilight purple.</p>",
            "<p>Expect satisfactory performance that can easily handle most day-to-day tasks. It’s the same processor as the one inside the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-z3-play-review/\">Moto Z3 Play</a>, and we didn’t have any performance problems on that phone.</p>",
            "<p>When it comes to battery life, the phone packs a large 3,600mAh battery and can be charged through the USB-C port. The battery capacity is a pretty significant jump from the HTC U11 Life, which had a 2,600mAh battery. There is no wireless charging support.</p>",
            "<p>Unlike the HTC U11 Life, HTC has given the U12 Life a dual-sensor rear-facing camera, which features one 16-megapixel primary sensor, and one 5-megapixel secondary sensor. The camera features an f/2.0 aperture, along with phase detection autofocus, a dual LED flash, and 4K video recording.</p>",
            "<p>At the front of the phone, you’ll find a 13-megapixel front-facing camera, which is a solid inclusion — though we will have to wait and see if the high megapixel count translates to a good image quality.</p>",
            "<p>Not much is known about the pricing and availability of the HTC U12 Life, but we do know that it will not be coming to North America. HTC says that an “example of pricing” is 299 pounds (around $390). We’ll update this story when we hear more.</p>",
            "<p><em>Updated on August 30: HTC has taken the wraps off the U12 Life, and we’ve added official details. </em></p>"
        ]
    },
    {
        "title": "\n\t\tSay hello to the U12 Plus: Everything you need to know about HTC’s latest phone\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>HTC has put out two great flagship phones in consecutive years with the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-10-review/\">HTC 10</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u11-review/\">HTC U11</a>. Now, the Taiwanese company is looking to continue that streak with the newly announced HTC U12 Plus, its flagship phone for 2018. But what does the new device have to offer? Here’s everything you need to know about the HTC U12 Plus.</p>",
            "<p>You can check out our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u12-plus-review/\">HTC U12 Plus</a> hands-on review to learn more about our impressions of the phone.</p>",
            "<p><strong>HTC U12 Plus</strong> <strong>now available in Flame Red</strong></p>",
            "<p>The HTC U12 Plus is now available in Flame Red. The new Flame Red edition of the U12 Plus has a color-shifting surface that changes depending on lighting conditions. It’s available to order now on the <a href=\"http://www.htc.com/\">HTC website</a> and should begin shipping in September.</p>",
            "<p><a href=\"https://www.cryptokitties.co/\">CryptoKitties</a>, the popular blockchain-based collectible kitty breeding game, will be bringing out a mobile app before the end of 2018, and that app will debut on HTC’s U12 Plus before any other phone.</p>",
            "<p>According to a post on <a href=\"https://www.htc.com/us/apps/cryptokitties/\">HTC’s U.S. website</a>, the CryptoKitties mobile app will be exclusive to HTC, and it’s unclear how long the exclusivity deal will last. We have reached out to CryptoKitties for clarification. Other sources have also intimated that the app will only be available in the U.S., and it’s also unclear if the app will be coming to other markets, and if so, whether HTC’s exclusivity deal will continue in those areas.</p>",
            "<p>The U12 Plus won’t be the only HTC phone to receive the CryptoKitties app either — blockchain-based phone the <a href=\"https://www.digitaltrends.com/mobile/htc-exodus-news/\">HTC Exodus</a> will also be receiving the app.</p>",
            "<p>Images and renders of the HTC U12 Plus leaked heavily in the past few months, and it turns out those images were accurate. HTC is reusing its Liquid Surface design that it introduced last year, which adds subtle color changes in layers of glass on the rear. This means the color slightly changes when the glass back catches the light.</p>",
            "<p>This year, there are three color versions of this Liquid Surface design: Flame Red, which will be available later this year; Translucent Blue, where you can see some of the internal components on the rear; and Ceramic Black.</p>",
            "<p>Starting on the back, the phone resembles LG’s V30 smartphone. You’ll find dual rear-facing cameras, a fingerprint sensor, and an HTC logo — and that’s about it. The Translucent Blue model also has a few faint vertical lines below the HTC logo. The back and front glass use Gorilla Glass 3, which is quite dated considering most other modern flagships use Gorilla Glass 5. If you were also hoping that glass meant wireless charging, you’ll unfortunately be disappointed. Glass is here is purely for aesthetic reasons.</p>",
            "<p>Over on the front, HTC has added a much larger display over the HTC U11. Yes, the bezels surrounding the screen are thinner than ever before, but they’re not as skimpy as bezels on other flagship phones. You may just be satisfied that there’s <a href=\"https://www.digitaltrends.com/mobile/why-are-android-phone-makers-embracing-the-notch/\">no notch at the top</a>.</p>",
            "<p>Speaking of the display, it’s a 6-inch Super LCD display with a resolution of 2,880 x 1,440. That resolution on the 6-inch screen size equates to a pixel density of 537 pixels-per-inch. We would have liked to see HTC adopt OLED technology, but LCD should be more than satisfactory. On the front, you may also have noticed dual front-facing cameras. The additional camera helps with Portrait Mode selfies, but more on that later.</p>",
            "<p>There are two speakers — one in the earpiece and one bottom-firing speaker. HTC is still utilizing its “BoomSound” audio technology, and hopefully, that means better sound than ever before. The phone is water-resistant, coming in with an IP68 rating, which means it should survive in the dip in the pool.</p>",
            "<p>HTC has brought back Edge Sense for the U12 Plus, meaning that you can set different functions for when you squeeze the phone, depending on how hard you squeeze. The company has also introduced a new gesture — you can double-tap each side of the phone. By default, this will put the phone into one-handed mode, though you can change it to whatever you want.</p>",
            "<p>What’s unique is the buttons on the U12 Plus are not mechanical — the power and volume buttons stick out of the phone, but you can’t push them down. They’re digital, or touch sensitive, so just tap them and you should be able to achieve the same function. It’s the first time HTC has used digital buttons, and the company said it should help with water resistance.</p>",
            "<p>Under the hood, the HTC U12 Plus is powered by a <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Qualcomm Snapdragon 845 processor</a>, along with 6GB of RAM and either 64GB or 128GB of storage. If that isn’t enough storage for you, there is a MicroSD card slot, so you can expand it if you so choose. As far as connectivity goes, the phone has Bluetooth 5.0, along with a USB Type-C port on the bottom.</p>",
            "<p>Then there’s the camera, and on paper it has a lot to offer. There are two cameras on the rear, with one 12-megapixel lens with an aperture of f/1.75, and one 16-megapixel telephoto lens with an aperture of f/2.6. The camera also has features like phase detection and laser autofocus, along with an optical zoom of up to 2x and digital zoom up to 10x. It also has “bokeh mode in real time,” which is similar to the Portrait Mode found on the iPhone X.</p>",
            "<p>The front-facing camera has two 8-megapixel sensors with an aperture of f/2.0, and it too boasts bokeh mode, which is perfect for selfies. HTC says you can also use the phone for facial unlock, though, like other Android phones, the feature is meant for convenience and not security. There are also augmented reality stickers built into the camera app, and these are similar to Snapchat filters.</p>",
            "<p>The battery on the phone sits in at 3,500mAh, and the phone supports <a href=\"https://www.digitaltrends.com/mobile/how-does-fast-charging-work/\">Quick Charge 3.0</a> — meaning it can charge up to 50 percent in 35 minutes. It does support Quick Charge 4.0, but you’ll need to buy the appropriate adapter and cable yourself.</p>",
            "<p>When it comes to software, the phone ships with <a href=\"https://www.digitaltrends.com/mobile/android-o-news/\">Android 8.0 Oreo</a> — but HTC says it will update the phone to <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android P</a> once the new operating system is available. Generally, HTC ships a fairly stripped back version of Android, but it does make some tweaks to things like icons and settings.</p>",
            "<p>The phone is available <a href=\"https://www.htc.com/us/smartphones/htc-u12-plus/\">now</a>, with the Translucent Blue version of the phone starting at $800 for the 64GB version and $850 for the 128GB version. The Ceramic Black model is also available for $800 for 64GB. You can also finance the phone for $34 per month for 24 months. It’s certified to work on AT&amp;T, T-Mobile, and Verizon.<i> </i></p>",
            "<p><i>Updated on August 17, 2018: The HTC U12 Plus is now available in Flame Red. </i></p>"
        ]
    },
    {
        "title": "\n\t\tHere’s everything we know about the HTC Exodus smartphone\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>Nowadays, it seems tough to escape <a href=\"https://www.digitaltrends.com/computing/what-is-a-blockchain/\">blockchain technology</a> — especially with the rise of Bitcoin and other cryptocurrencies. As part of what HTC claims is its “effort to expand the blockchain ecosystem,” the company introduced its latest blockchain phone known as the <a href=\"https://www.htcexodus.com/\" rel=\"noopener\">HTC Exodus</a>.</p>",
            "<p>While details have been slow to emerge, we now finally have a much better idea of what the phone will look like. Here’s everything we know about the HTC Exodus so far.</p>",
            "<p>While we initially didn’t know too much about the HTC Exodus, more information about the device has slowly been seeping out. We now know that the device features a 6-inch HD+ display with an 18:9 aspect ratio, along with a 16-megapixel dual rear-facing camera and an 8-megapixel front-facing camera. Under the hood, the device boasts a Qualcomm Snapdragon 845 processor, coupled with 6GB of RAM, 128GB of storage, and a 3,500mAh battery powering it all.</p>",
            "<p>There are a few advantages to the phone over others. For starters, HTC has developed a cryptocurrency wallet called Zion, which allows you to store cryptocurrency on the phone itself. That’s all stored in the secure enclave — a part of the system that’s kept separate from Android, and uses SoftBank’s Arm Holdings to keep everything safe. That’s also where you can store keys to your cryptocurrency and tokens like CryptoKitties.</p>",
            "<p>As part of the HTC Exodus, HTC has also built a social key recovery system. Basically, you can keep recovery details about your phone with a trusted friend, after which they’ll have to download a key management app. Then, HTC will use a sharing algorithm to send information to your friends, which can then be pieced together if need be.</p>",
            "<p>Initially, it will launch with support for Bitcoin, Ethereum, Dfinity networks, and Lightning Network, but the company says it will eventually support the entire blockchain ecosystem. HTC plans on creating a native blockchain network with all Exodus phones, in an effort to double and triple the number of nodes of Ethereum and Bitcoin.</p>",
            "<p>The device will also feature what’s supposed to be a trusted and user-friendly UI for DApps. By bringing DApps to mobile, HTC hopes to streamline the mobile user experience throughout the DApp community as a whole.</p>",
            "<p>Want to get the HTC Exodus for yourself? You’ll have to own some cryptocurrency to do so — but if you do, the device is now up for pre-order from the <a href=\"https://www.htcexodus.com/us/\" target=\"_blank\" rel=\"noopener\">HTC Exodus website</a>. The phone will sell for 0.15 BTC, or 4.78 ETH, which equates to around $960 at the time of this writing. It’s expected to ship in December, and will be available in a hefty 34 countries, including the U.S., parts of Europe, New Zealand, the U.K., Taiwan, and more. Of note, the phone will not be available in China — largely because of the fact that the country bans cryptocurrency trading.</p>",
            "<p>While full details about the design of the HTC Exodus are a little vague right now, HTC has released some images that give us a basic idea of what the phone will look like. Despite the technology under the hood, the phone doesn’t look all that different from other smartphones on the market. It’s got a dual-sensor camera on the back with a fingerprint sensor about a third of the way down. No word yet on the design on the front — or if it’ll feature a notch or headphone jack.</p>",
            "<p><em>Updated on October 23, 2018: The HTC Exodus is now available for pre-order.</em></p>"
        ]
    },
    {
        "title": "\n\t\tHTC U12 Plus vs. HTC U11: Is it time to upgrade?\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>Things have been tough for HTC over the last couple of years, but that hasn’t stopped the Taiwanese manufacturer from releasing some great Android smartphones. We were blown away by the camera quality in last year’s <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u11-review/\">HTC U11</a> and we loved the budget <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u11-life-review/\">HTC U11 Life</a>. The latest release is the impressive <a href=\"https://www.digitaltrends.com/mobile/htc-u12-news-and-rumors-version-1527005536/\">HTC U12 Plus</a>, which sports dual cameras front and back, a 6-inch display, and the usual host of innovative features we’ve come to expect from HTC.</p>",
            "<p>We’ve tested the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u12-plus-review/\">HTC U12 Plus</a> out, but in this article we’re going to compare it with last year’s flagship — the U11 — to see what has changed and improved. If you’re considering buying one of these phones, or upgrading from the U11 to the U12 Plus, then this spec comparison should help you decide.</p>",
            "<p>The HTC U11 was a fine performer, with plenty of stamina and speed, but the HTC U12 Plus brings some important improvements. For a start, there’s the latest Snapdragon 845 processor, which is faster and more power efficient than last year’s 835. While the U11 came with a choice of 4GB or 6GB of RAM, paired with 64GB or 128GB of storage respectively, both storage models of the U12 Plus boast 6GB of RAM.</p>",
            "<p>There’s also an extra 500mAh of capacity in the U12 Plus battery, though it is tasked with powering a bigger display. We found the U11 easily lasted a day-and-a- half between charges, so we’re hoping the U12 Plus will match it. Both phones support Quick Charge 3.0, but only the U12 Plus supports Quick Charge 4.0 — though you will need to buy a compatible charger separately as you don’t get one in the box. Sadly, neither phone has support for wireless charging.</p>",
            "<p><strong>Winner: HTC U12 Plus</strong></p>",
            "<p>One of the few things that disappointed us about the U11 was the chunky design and large bezels around the display. HTC has clearly worked on this, shaving down the bezels in the U12 Plus and moving the fingerprint sensor around to the back of the phone. As a result it has managed to pack in a much larger display without making the body too much bigger. There are still bezels above and below the screen, but mercifully there’s no notch. The stunning, color-changing, liquid glass finish on the back is still present, but the U12 Plus comes in new colors, including a Translucent Blue that shows some of the inner workings of the device.</p>",
            "<p>There have also been improvements in the durability stakes, with the U12 Plus scoring an IP68 rating compared to the IP67 rating for the U11. That means it can be dunked in slightly deeper water without damage. A part of that improvement comes with the introduction of digital buttons — the power and volume buttons are not mechanical buttons, but they’re touch-sensitive.</p>",
            "<p>Because of the glass finish, you’ll still need cases to protect these phones.</p>",
            "<p><strong>Winner: HTC U12 Plus</strong></p>",
            "<p>You’ll find the Super LCD screens in HTC’s phones are sharp and pleasant to read on, though they lack the vibrancy of Samsung’s AMOLED screens. The U12 Plus boasts a 6-inch display with a resolution of 2,880 x 1,440 pixels, which works out to 537 pixels per inch. That’s very similar to the U11, which has a 5.5-inch screen with a resolution of 2,560 x 1,440 pixels, or 534 pixels per inch. It’s essentially a jump from the old 16:9 aspect ratio to the modern 18:9 and it gives you a slightly taller display.</p>",
            "<p><strong>Winner: HTC U12 Plus</strong></p>",
            "<p>On paper, the HTC U11’s 12-megapixel, single-lens camera didn’t generate too much excitement, but in practice, we found it capable of capturing some truly excellent photographs. In fact, it’s one of our <a href=\"https://www.digitaltrends.com/mobile/best-camera-phones/\">favorite phone cameras</a> of recent months. The U11 also has a capable 16-megapixel front-facing camera.</p>",
            "<p>With the U12 Plus, HTC has gone dual-camera crazy, pairing a 12-megapixel lens with an f/1.75 aperture and a 16-megapixel telephoto lens with an f/2.6 aperture on the rear, both with optical image stabilization (OIS). There are also dual 8-megapixel lenses on the front, for superior portrait mode selfies. We can’t wait to put the U12 Plus camera through its paces and find out what it can do. We’re expecting something special that should surpass last year’s flagship. After all, it scored a DxOMark rating of 103 — just below the top <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">Huawei P20 Pro</a>.</p>",
            "<p><strong>Winner: HTC U12 Plus</strong></p>",
            "<p>The HTC U11 launched with Android 7.1 Nougat and has since been updated to Android 8.0 Oreo. The U12 Plus is launching with Android 8.0 Oreo and will definitely be getting <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android P</a>. Both phones have HTC’s Sense user interface on top, which doesn’t deviate too far from stock Android. There are a few extras like A.I. Companion and Alexa support, but they complement, rather than replace, Google’s superior suite of apps and services.</p>",
            "<p>As the newer and more powerful device, the U12 Plus will continue to get software updates for longer than the U11.</p>",
            "<p><strong>Winner: HTC U12 Plus</strong></p>",
            "<p>The innovative <a href=\"https://www.digitaltrends.com/mobile/htc-edge-sense-update/\">Edge Sense</a> feature made its debut in the U11, allowing you to squeeze your phone to snap a photo or launch Google Assistant. In the U12 Plus, it has been expanded to allow you to double tap either side of the phone to trigger an action.</p>",
            "<p>The BoomSound speakers, which provide stereo sound via the bottom-firing speaker and the top earpiece, also sound better. Speaking of audio, HTC has also developed Sonic Zoom further in the U12 Plus, allowing you to focus in on the sound of a subject you are recording when you zoom in on them.</p>",
            "<p>One new trick that the U12 Plus has up its sleeve is the ability to understand when to rotate from portrait to landscape based on how you’re holding and looking at the phone, which means it won’t rotate to landscape when you’re holding it in portrait and you lie down to read.</p>",
            "<p><strong>Winner: HTC U12 Plus</strong></p>",
            "<p>The HTC U12 Plus costs $800 for the 64GB model or $850 for the 128GB model. You can buy the HTC U11 for $650, but you’ll probably find deeper discounts if you shop around, especially now that the U12 Plus has arrived. Both phones will work on all major carriers.</p>",
            "<p>You would expect a new flagship to best its predecessor, and the U12 Plus certainly doesn’t disappoint. With improvements across the board — some minor, some major — there’s little doubt that this year’s HTC is the one to go for. Smart design tweaks, a slightly bigger display, software evolution, and a faster processor are all steps in the right direction, but the camera overhaul is probably the biggest change. Whether it’s enough to persuade U11 owners to upgrade is harder to say right now, so check out our full <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u12-plus-review/\">U12 Plus review</a>.</p>"
        ]
    },
    {
        "title": "\n\t\tHTC U12 Plus tips and tricks\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u12-plus-review/\">HTC U12 Plus</a> is an ambitious phone. Following in the footsteps of its predecessor, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u11-review/\">HTC U11</a>, the phone offers top-of-the-line specs, a capable camera, and controversial digital buttons. Like all recent HTC phones, the U12 Plus runs Android with HTC’s custom UI Sense skin on top. Whether you’re new to HTC or just upgrading, here are a few HTC U12 Plus tips and tricks to help you get to grips with your new phone.</p>",
            "<p>To set up Edge Sense you’ll need to go to <em>Settings &gt; Edge Sense. </em>If the feature is not toggled on you’ll need to do so first, otherwise just tap on <em>Edge Sense. </em>Once you’re in the Edge Sense menu you’ll see three different sections.</p>",
            "<p><em>Squeeze </em>allows you to open apps and other features via a short squeeze or by squeezing and holding the phone. In-app, <i>squeeze</i> is used to automatically adjust your phone’s orientation depending on how you hold the phone. <em>Double Tap </em>allows you to quickly access the one-handed mode.</p>",
            "<p>To customize each of the squeeze gestures you’ll need to make sure the slider is toggled to on before tapping on the actual gesture name. Once you tap on the gesture name you’ll see an option to map each action to your preference.</p>",
            "<p>If you’re used to the typical Android screenshot method of pressing the Power and Volume Down buttons simultaneously, you’re going to be in for a surprise with the HTC U12 Plus. Since the phone uses digital as opposed to analog buttons, HTC had to come up with a different method to get a screenshot.</p>",
            "<p>So how do you take a screenshot on the HTC U12 Plus? Simply swipe the navigation button to the left and tap the <em>screen capture</em> (phone) icon.</p>",
            "<p>One thing HTC handsets are known for is good sound. The HTC U12 Plus is no exception. The phone offers custom audio options for its external speakers as well as headphones.</p>",
            "<p>BoomSound, for the most part works automatically by adjusting your phone’s audio to either a theater or music mode, depending on the app you’re using. Each time the mode changes you’ll see a persistent notification. While the feature works pretty flawlessly in our experience, you can manually change the mode by going to <em>Settings </em>and tapping <em>HTC BoomSound for built-in speakers.</em></p>",
            "<p>In addition to BoomSound, the HTC U12 Plus also features USonic noise-canceling earbuds in the box. In addition to the earbuds, the USonic app allows you to create a custom sound profile based on sonar measurements of the ear canal. To get started with USonic, go to <em>Settings &gt; HTC USonic with Active Noise Cancellation. </em>Tap <em>Start Scanning Now </em>and wait for USonic to complete its measurement. When complete you’ll see a screen displaying your audio profile information. Just name your profile and tap <em>Done. </em></p>",
            "<p>BlinkFeed, a mainstay of HTC’s Sense UI, brings news, social media updates, appointments and other information to your home screen. While the idea is good in theory, execution seems to be the problem: In our experience, it tends to provide news and other information we’re just not interested in. Luckily, HTC allows you to turn off BlinkFeed pretty easily.</p>",
            "<p>To disable BlinkFeed slide two fingers together on the home screen. Tap the <em>Pencil </em>icon to see a carousel of minimized home screens. Swipe until the BlinkFeed screen is selected and tap the <em>Remove </em>icon.</p>",
            "<p>In addition to its really wonky digital buttons, one of the most annoying features of the HTC U12 Plus is the amount of bloatware that ships on the phone. And while you can’t uninstall all of these extra apps, you can disable the apps, which removes them from your app drawer.</p>",
            "<p>To disable apps, go to <em>Settings &gt; Apps &amp; notifications &gt; App info.  </em>Select the offending app and tap <em>Disable &gt; Ok.</em></p>",
            "<p>Sense Home recommends apps based on your location, preferences, and phone use. It’s a useful app for some, but others find its constant notifications to be excessive. Luckily you can easily turn off notifications for the app by long-pressing on the home screen and tapping the <em>Sense Home settings </em>icon. Next, select <em>Sense Home notifications </em>and toggle the <em>On </em>slider to the left.</p>",
            "<p>News Republic, an app that uses machine learning to find the breaking and viral news, comes preinstalled on the HTC U12 Plus. Like other bloatware apps, it cannot be uninstalled, but only disabled. However, even when the app is disabled we noticed it continues to send notifications throughout the day.  If you don’t want to be bothered by News Republic, you’ll want to disable the app and turn off notifications.</p>",
            "<p>First, you’ll want to disable News Republic by going to <em>Settings &gt; Apps &amp; notifications &gt; App info.  </em>Select <em>News Republic</em> and tap <em>Disable &gt; Ok. </em>To turn off notifications, go to <em>Settings &gt; Apps &amp; notifications &gt; Notifications. </em>Select <em>News Republic</em> and toggle off the <em>On </em>slider.</p>",
            "<p>HTC Sense Companion is an AI virtual assistant that combines voice control features alongside contextual suggestions. It’s similar to Google Assistant however it tends to be a little more invasive as suggestions pop up as a persistent icon on the home screen.</p>",
            "<p>To get the most out of Sense Companion you’ll want to make sure it has access to your location data, device data, and activity data; these are usually approved when setting up your phone. They can also be added later. Simply tap the <em>Sense Companion </em>icon followed by the <em>overflow </em>(three dots) icon. Select <em>Privacy Settings </em>and tap on all of the radio boxes. While you’re in the settings menu you’ll also want to tap <em>Personal info </em>and add your personal details so Sense Companion can make more appropriate suggestions.</p>",
            "<p>Once you have Sense Companion set up, you’ll see an icon appear on the screen when there are new suggestions for you to review.  You’ll want to make sure you offer feedback on each suggestion so the assistant can learn your preferences.</p>",
            "<p>Finally, if Sense Companion is just not your cup of tea, you can turn off notifications. Just go to <em>Settings &gt; Apps &amp; notifications &gt; Notifications. </em>Select <em>HTC Sense Companion</em> and toggle off the<em> </em>slider.</p>",
            "<p>Sure, the HTC U12 Plus may not have the same depth-sensing camera you’ll find on the iPhone X, but that doesn’t mean it doesn’t have an option to unlock the phone using your face. If you want to give Face Unlock a try, go to <em>Settings &gt; Face Unlock. </em>Next, authenticate with your fingerprint, PIN, passcode, or pattern. Tap <em>Register face data &gt; Continue &gt; Next &gt; Start &gt; Allow.  </em>Position your face within the circular frame and allow the phone to collect the necessary data. When complete just press <em>Turn On </em>to activate the feature.</p>",
            "<p>If you encounter problems when authenticating with Face Unlock, you may want to try capturing your image again in a bright location or selecting the <i>Low light recognition </i>option in the settings menu.</p>"
        ]
    }
]