[
    {
        "title": "\n\t\tEssential is reportedly building an A.I.-powered phone that mimics its user\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>It looks like the <a href=\"https://www.digitaltrends.com/mobile/essential-phone-news/\">Essential Phone</a> is getting a successor. According to a new <a href=\"https://www.bloomberg.com/news/articles/2018-10-10/android-creator-is-said-to-build-ai-phone-that-texts-for-you\" target=\"_blank\" rel=\"noopener\">report from Bloomberg</a>, Essential has begun work on a new phone that will use artificial intelligence that mimics the user to perform tasks like automatically respond to messages.</p>",
            "<p>It seems as though Essential is working full steam ahead on the new project — in fact, it has reportedly paused development on things like a planned home speaker and potentially some other products in order to put its focus on the new phone.</p>",
            "<p>Even the design of the new phone would be totally different than other smartphones, according to the report. It will reportedly have a small screen, and the user will mostly interact with it through voice controls, which will work with Essential’s own artificial intelligence software. In other words, the device will aim to be more of a digital assistant than any phone before it.</p>",
            "<p>It all sounds a bit sci-fi, but that’s apparently the point. Andy Rubin, co-founder of Android and founder of Essential Products, is reportedly trying to build a device that “captures people’s imagination” by being something that’s totally different from the competition.</p>",
            "<p>Of course, Essential has a long road ahead of it. Currently, the consumer A.I. space is dominated by the likes of Google, Amazon, and Apple, but even the assistants from those companies sometimes fail, forcing the user to manually perform the task they’re asking the assistant to do. With a phone that has only a small display, manually doing tasks may be much harder. The new device, however, could be targeted at those who want to spend less time using their phones.</p>",
            "<p>So when will we see Essential’s new device? Essential reportedly aims to have the first prototype ready by the end of the year, but it’s unlikely consumers will see what that prototype looks like. According to the Bloomberg report, Essential is aiming to show the device off to industry partners at the Consumer Electronics Show in January in Las Vegas — though consumers probably won’t see the device until well into 2019.</p>",
            "<p>Even when Essential does eventually release the new device, there’s no guarantee that it will sell — and if it doesn’t, this could be one of the last devices we see from Essential.</p>"
        ]
    },
    {
        "title": "\n\t\tHold my beer, I’ve got a new UTV!\t",
        "author": [
            "\n\t\t\t\t\t\tJeff Zurschmeide\t\t\t\t\t"
        ],
        "text": [
            "<p> <span class=\"dropcap\">W</span>hen you see one at a desert race sitting next to a full-tilt Trophy Truck most UTVs look almost fragile, like something that was built for the SEMA show but never intended for real use. Yet looks can be deceiving. The UTV is quickly becoming one of the most popular off-road racing vehicles because of its extreme capability, speed, and most of all, its ability to take the toughest punishment and still get you to the finish line.</p>",
            "<p>To give you an idea of how tough these vehicles are, a Bombardier Can-Am just won its class at the grueling Dakar Rally in South America, finishing the 14 stages from Lima, Peru to Cordoba, Argentina in 72 hours, 44 minutes and six seconds. Of the 11 entries in the UTV class, three were Bombardiers, three were Yamahas, and five were made by Polaris.</p>",
            "<p>The term side-by-side (sometimes SXS) covers a broad category of vehicles, from a gardener’s micro-truck to a desert racer. The desert racing versions are more properly called MOHUVs, for Multipurpose Off-Highway Utility Vehicle. There are many different brands on the market, but <a href=\"https://offroad.polaris.com/en-us/\" target=\"_blank\" rel=\"noopener\">Polaris</a> is leading the charge into affordable off-road racing with several different models of its popular RZR (pronounced Razor) and a factory-backed racing effort.</p>",
            "<p>The anatomy of a MOHUV is pretty simple. The vehicle is built around a tube frame with rollover protection, and a few plastic body panels to help keep some of the rocks outside the vehicle. The part you care more about is the driveline. The most basic <a href=\"https://www.digitaltrends.com/cars/desert-racing-polaris-rzr/\">Polaris RZR</a> you’d want to use for racing is the XP, powered by a 1000cc ProStar two-cylinder engine with 110 horsepower. There are less expensive 45- and 75-horsepower models, but they’re not affordable enough to justify the power loss.</p>",
            "<p>The RZR uses an on-demand all-wheel drive system, which makes it primarily a rear-wheel-drive vehicle with the ability to transfer torque to the front wheels as needed for traction. Fully loaded with driver and passenger, you’re looking at about 1700 pounds. With the Polaris’ continuously variable transmission, you’ve got plenty of power at all times for about $17,999. But if that’s not enough, you can move up to the <a href=\"https://www.digitaltrends.com/cars/2018-polaris-rzr-xp-turbo-eps-dynamix/\">RZR XP Turbo</a>, with 168 horsepower for $19,999. That’s money well spent, right there.</p>",
            "<p>The real magic of the RZR comes with the suspension. It looks positively spindly, with slender rods holding the wheels out past the corners of the vehicle, but it’s the hardiest part of the Polaris. The leggy suspension design gives you a huge range of motion, which keeps the wheels in contact with uneven ground.</p>",
            "<p>You’ve got your choice of three different shock setups. You can go with the basic needle valve shocks, and they’re very good. Depending on the terrain, that may be all you need. If you’re running around on powder like I did at Coral Pink Sand Dunes state park in Utah, the RZR will be silky smooth. On the rough rocks of the Mint 400 course outside Las Vegas, not so much. You can upgrade to Fox internal bypass shocks with five separate compression zones for about $3,000 more, but the RZR you want has Polaris’ new Dynamix active suspension. All-in with the turbo engine, it’s $25,999.</p>",
            "<p>The Dynamix suspension is something like you find on the latest Corvette. It’s an active system that monitors everything going on several hundred times a second. You can dial up comfort, sport, or firm settings from the RZR’s dashboard-mounted touch screen. Once you get moving, the Dynamix system is looking at compression and extension, grip, braking, and weight to figure out how to keep the Polaris under control and moving fast.</p>",
            "<p>When you get on the brake pedal, the Dynamix system firms up the front shocks to stop nose dive. When you race into a corner, the outside shocks respond to keep the RZR level. It’s a magic carpet, capable of turning a rough rocky surface into a smooth highway where you can put your foot down.</p>",
            "<p>For a test run on part of the Mint 400 racing course, I was driving the RZR XP 1000 with the standard needle valve suspension. For all my raving about the Dynamix, this is still a very capable setup. The course we ran featured all kinds of surfaces, from rough rocks to silty lake beds to uneven wavy ground the racers call “whoops.” Of all these, the whoops really show the benefit of the RZR.</p>",
            "<p>When you’re headed over whoops, the best way forward is to go fast enough to get up on the tops of the bumps so you’re not being tossed around. This lets the RZR suspension soak up the motion while you stay relatively stable. With the RZR’s variable transmission, you just put your foot down to go faster and hang on. The RZR comes with electric power steering, so the wheel won’t rip itself out of your hands.</p>",
            "<p>Out on the silt, it’s wide-open racing. We saw speeds north of 80 mph across the smooth surface. We could have gone faster with a bit more space and perhaps a bit more confidence. The lakebed gives way to a climb over hilly country, where we had to pick our way over larger rocks, experiencing some truly impressive suspension articulation on our way back to the pits.</p>",
            "<p>For a counterpoint to the rough Las Vegas desert, we headed over to Coral Pink Sand Dunes on the Utah/Arizona border. This off-road vehicle park offers a constantly changing landscape of powdery sand with long, steep climbs and heart-pounding descents. Traction is the name of the game in this environment, and the AWD system in the RZR XP 1000 proved its mettle. Spraying sand from all four corners, the RZR floats over the powdery pink surface, never staying in one place long enough to dig in.</p>",
            "<p>One major difference between the two environments was the choice of tires. For sand, you need balloon tires with aggressive tread designed to stay on top of the shifting surface while providing as much traction as it’s possible to get without digging a hole. Out on the rocky Nevada desert, we used BF Goodrich Baja KR2 tires sized and designed for the RZR. In the Nevada environment, we needed tread that would not only grip the sharp rocks, but will also withstand the abuse of racing long distances over the rocks.</p>",
            "<p>It takes just one taste of the RZR in the desert to make a believer. If you’ve got any racing at all in your DNA, you’ll pull your helmet off and start scheming about how to get one of these for yourself. Depending on the racing series you choose, you can effectively run a showroom-stock UTV and have a competitive ride. If you decide to go to Baja with SCORE, or run the Mint 400 with Best in the Desert, you’ll have a little work to do, mostly in the safety area, but you’ll also need a radio for team and official communications and a GPS system.</p>",
            "<p>There’s more you can do for performance, but that comes later as you gain experience. Assuming you start with a brand new RZR XP 1000 for about $20,000, you can be ready to race for another $10,000 to $20,000. Or you can buy a turn-key, race-ready UTV from several different brands on a variety of online forums and save a bundle while you get good enough to justify a newer ride.</p>",
            "<p>Sure, it may sound like a lot of money, especially after you add the truck and trailer and about a million other things you’ll need. But when you stack up a UTV against just about anything else racing in the desert, it’s a bargain. And the limited development allowed in the UTV classes means that you won’t be outclassed by someone who can spend truckloads of cash to win a trophy.</p>",
            "<p>There are UTV rental places all over Las Vegas, and you can get that first taste for just a couple hundred bucks. The question is, are you going to do it or not?</p>"
        ]
    },
    {
        "title": "\n\t\tThe Razer Phone, with its Snapdragon 835 and 8GB of RAM, is finally here\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p><figure><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"https://icdn4.digitaltrends.com/image/razer-phone-720x720.jpg\" onerror=\"dti_load_error(this)\" class=\"attachment-large size-large wp-image-1265766 dt-lazy-load dt-lazy-pending\" alt=\"Razer Phone\"></figure><a href=\"https://www.razerzone.com/\" target=\"_blank\" rel=\"noopener\">Razer</a> — the gaming company known for its computers, keyboards, and mice — is getting into the smartphone game. After months of rumors, the company has finally unveiled the all-new <a href=\"https://www.razerzone.com/mobile/razer-phone\">Razer Phone</a>, a top-tier smartphone with what the company says is the first with a 120Hz Ultramotion display. And Razer’s partnership with Netflix, announced at the <a href=\"https://www.digitaltrends.com/ces-2019/\">Consumer Electronics Show</a>, will make the Razor Phone not just awesome for gaming, but for watching your favorite streaming movies as well.</p>",
            "<p>Display aside, however, the device is a pretty powerful one. It has to specs you would expect from any flagship <a href=\"https://www.android.com/\" target=\"_blank\" rel=\"noopener\">Android</a> phone, and should be able to handle pretty much everything you can throw at it. Here’s everything you need to know about the new Razer Phone, and if you want to see the phone in action, check out our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/razer-phone-review/\">hands-on review of the phone</a>.</p>",
            "<p>The first thing to notice about the Razer Phone is its design, and it looks pretty sleek, if not a little plain. The device itself has sharp-ish corners, similar to what you would expect from a <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz1-review/\">Sony phone</a>. The display comes in at 5.72 inches, but it’s not a big edge-to-edge display that you might find on other 2017 flagship phones — instead the device follows a rather conventional look. Along with that is a slightly large chin and forehead, though they’re not big enough to look too out of place.</p>",
            "<p>On the back of the phone, as you would expect, is the Razer logo and the camera, which is found on the top right-hand corner. New for 2018, the phone is also available in a limited-edition version “gold” color. It’s not the phone that’s gold, but rather the logo on the back, and it was launched in celebration of the beginning of the Year of the Dog on the Chinese calendar. Along with the limited phone, you also get some nice red and gold packaging.</p>",
            "<p>While the design of the phone may not be all that special, under the hood it has some serious power. For starters, it boasts a <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-835-benchmarks/\">Qualcomm Snapdragon 835</a> processor — <a href=\"https://www.qualcomm.com/\" target=\"_blank\" rel=\"noopener\">Qualcomm</a>‘s flagship processor for 2017, and the one you would expect to see in a flagship Android phone. That processor is coupled with a hefty 8GB of RAM — which obviously makes it a good device for mobile gamers. It also offers 64GB of storage, though that storage can be expanded by up to a hefty 2TB using the included MicroSD card slot.</p>",
            "<p>As mentioned, the display sits in at 5.72 inches, and it has a resolution of 1440 x 2560, which is pretty good. What really sets the display apart from the competition, however, is the 120Hz refresh rate, and it’s not the first with such a refresh rate, it’s still one of the only devices with the feature. You could argue that a 120Hz display on a phone is a gimmick — though some say it provides a much more fluid experience.</p>",
            "<p>The phone also has dual front-facing speakers, which is always better for a great gaming experience, and should help make the phone better for media consumption.</p>",
            "<p>The rear-facing camera is dual-sensor, with one sensor being a 12-megapixel f/1.75 wide-angle sensor, and the other being a 12-megapixel f/2.6 zoom lens. We’ll have to wait and see how the cameras perform in the real world, but the specs suggest it should do pretty well. The front-facing camera comes in at 8 megapixels.</p>",
            "<p>Another interesting feature that sets this phone apart is that it’s the first to support <a href=\"https://www.digitaltrends.com/mobile/qualcomm-quick-charge-4-plus/\">Qualcomm’s Quick Charge 4.0 Plus</a> — so it will be able to charge that 4,000mAh battery nice and quick.</p>",
            "<p>The Razer Phone ships with Android 7.1 Nougat. While Nougat is a bit of a disappointment, the company said an Oreo update will likely come in 2018.  The interface is very close to stock Android which is very nice, however, Nova Launcher Prime comes pre-installed so it’s easy to customize your phone.</p>",
            "<p>In December, Razer released a software update for the Razer Phone that focused on software improvements for the camera. The December update improved shutter speed as well as color optimization. A quick zoom feature was also added.</p>",
            "<p>At the 2018 Consumer Electronics Show, Razer announced a partnership with Netflix. Razer Phone users will be able to watch their favorite Netflix movies and shows in HDR with Dolby Digital Plus 5.1. Current Razer Phone users will receive an update in January that adds the Netflix app and widget to the phone. The premium Netflix feature, however, will come at a premium price. Users will need to pay $14 a month for Netflix Premium to take advantage of HDR viewing and Dolby Digital Plus 5.1.</p>",
            "<p>The Razer Phone is available online for $700. The phone comes unlocked and works on the major U.S. networks, however, Sprint and Verizon users are out of luck. If you want to see the Razer Phone in action, check out our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/razer-phone-review/\">hands-on review.</a></p>",
            "<p><em>Updated on February 2: Added news of limited edition gold Razer Phone. </em></p>"
        ]
    },
    {
        "title": "\n\t\tFeet on: Razor Hovertrax 2.0\t",
        "author": [
            "\n\t\t\t\t\t\tJeremy Kaplan\t\t\t\t\t"
        ],
        "text": [
            "<p>\n\t\t\t</p>",
            "<p>That’s the premise behind the new Hovertrax 2.0 from scooter company Razor, which carries a sticker for the brand-new UL 2272 standard, a certification from the authorities at Underwriters Lab specifically designed to ensure that so-called hoverboards meet safety standards. And there are only a handful of boards that meet the standard to date.</p>",
            "<p>“Last year Razor shipped 1.2 million units,” David Kim, director of sales for the company, told Digital Trends. “We know a little something about this stuff.”</p>",
            "<p>The <a href=\"http://www.ul.com/hoverboards/\">UL 2272 standard</a> evaluates the safety of the electrical drive train, battery, charger, and how the systems work together, the group explains. The new standard focuses on individual lithium-ion cells and multicell battery packs, which are of particular concern. “This is where most of the issues could arise from, because the battery pack carries a lot of energy in a small package. The battery pack is something that, when one of the cells faults, it could involve others,” Consumer Safety Director John Drengenberg, who has worked for UL for more than 50 years, <a href=\"http://www.cnet.com/news/new-safety-standards-might-save-hoverboards-from-extinction/\">told Cnet</a>. “It has a domino effect that could cause the fires that we might have seen.”</p>",
            "<p>Kim confirmed that it’s battery packs causing the problem. “Most of the fires that we know of are because of the cheap, knock-off batteries and the chargers that are associated with it.” Razor’s product uses only premium batteries from LG, Kim said, another thing that makes them safer, he claims.</p>",
            "<p>You see, hoverboards are awesome. Hoverboards also blow up, which has led to nationwide bans on their use in subways, on airplanes, and in your living room (oh come on, Mom!). The UL 2272 standard aims to guide consumers toward those electric scooter that don’t blow up. This is a Good Thing.</p>",
            "<p>The Hovertrax 2.0 looks like any other electric scooter: It’s two feet wide, with two rubber wheels covered by plastic hoods with bumpers. Our model was a beautiful shade of blue, with LED taillights in front and a battery indicator and power-on switch in the middle, between where your feet fit. It supports up to 220 pounds. Cheap models (and cheap drones, for that matter) come with cheap chargers that don’t shut themselves down when the battery is fully charged. Razor’s will, meaning you can leave it plugged in to charge overnight; a full charge takes four hours and supports up to 60 minutes of continuous riding.</p>",
            "<p>It’s also a self-balancing unit: “All the other products out there don’t self balance — you have to actually get on it and balance yourself,” Kim explained. Getting on and off these devices is the most dangerous (and most challenging) part. Your foot movements control the board’s forward and backward movements: Angle a foot forward and the motor in that wheel housing will start the board going. With models that don’t automatically level themselves, the rider must do that – and it’s easy to activate the motor at the same time.</p>",
            "<p>The entire Digital Trends office has now tested out the Hovertrax 2.0, and with very few exceptions, we’ve become pretty solid riders. We can do tricks. We zip back and forth, and do spins fast enough to make your head start spinning. We’ve fallen off too, of course, but only once or twice. And most importantly, we haven’t exploded.</p>",
            "<p>Remember I said that only a few models meet the standard? One of the others is the Ninebot by Segway miniPRO, which was certified in May, 2016 (along with the Razor product and models from Hangzhou Chic Intelligent Technology Co Ltd., PTX Performance Products, Shenzhen Global E-Commerce Co Ltd., and Wuyi Chuangxin Metal Tools Co Ltd.). You might recall Segway as the company that sought to change the world with its self-balancing two-wheeled vehicles. Hoverboards ate Segway’s lunch, however, as did cheap Chinese knock-offs – one of <a href=\"https://www.digitaltrends.com/features/chinas-patent-infringement-problem-on-display-at-ces-asia-2016/\">which ended up swallowing the company whole</a>.</p>",
            "<p>Razor says it’s the only model with an actual license to the patent covering hoverboards, which is owned by Californian inventor Shane Chen. In January, Segway filed its latest lawsuit against Razor (and a company called Swagway), alleging that its patents cover self-balancing scooters, not Chen’s. Meanwhile, Razor has been on a tear too, suing anyone and everyone in order to stem the flow of cheap products.</p>",
            "<p>“In America, we’re the only brand [with a license from Chen], and we will litigate wherever possible,” Kim told me.</p>"
        ]
    },
    {
        "title": "\n\t\tRazer Phone 2 vs. Galaxy Note 9: They’re closer than you think\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/razer-phone-review/\">Razer Phone</a> was a great gaming-focused phone from 2017, but it fell short of being a great smartphone because of a weak camera and a lack of water-resistance. Razer has taken the criticism to heart with the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/razer-phone-2-review/\">Razer Phone 2</a>, enhancing the weaker points to deliver a phone that hopes to be a great gaming device and smartphone. But the <a href=\"https://www.digitaltrends.com/mobile/razer-phone-2-news/\">Razer Phone 2</a> has a lot of competition, and it’s eventually going to find itself up against one of the biggest and best smartphones around — the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Galaxy Note 9</a>.</p>",
            "<p>Which phone comes out on top when these two titans clash and which should you buy? We found out.</p>",
            "<p>Both of these phones put a heavy emphasis on gaming performance, and so it’s unsurprising that we see some exceptionally powerful hardware here. Both the Razer Phone 2 and the Note 9 are equipped with this year’s “flagchip,” the <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a>. Thanks to that chip, you get smooth performance whether you’re playing the latest mobile game or just checking your emails. Both have innovative cooling systems too — the Note 9 comes with water-cooling, while the Razer Phone 2 comes with the Vapor Chamber cooling system, which spreads heat around the phone.</p>",
            "<p>There is lots of RAM here with 8GB in the Razer and 6GB or 8GB in the Note 9. While the Razer Phone 2 has just 64GB of onboard storage compared to the Note 9’s 128GB, both have a MicroSD card slot to boost that, so the lower capacity shouldn’t matter too much. Both phones come with whopping 4,000 mAh battery capacities that should easily last the day. Both also come with Qi wireless charging but the Razer Phone 2 comes with much faster charging, thanks to the rare inclusion of <a href=\"https://www.qualcomm.com/news/onq/2018/02/23/how-can-quick-charge-4-turbocharge-your-mobile-device\">QuickCharge 4.0+</a>.</p>",
            "<p>It’s an exceptionally tough category to judge since both phones rock similar specs. We’re calling this section a tie.</p>",
            "<p><strong>Winner: Tie<br>\n</strong></p>",
            "<p>Call 2018 the year of repeated designs because both of these phones (<a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-review/\">and</a> <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v40-thinq-review/\">many</a> <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-plus-review/\">others</a>) are calling upon their predecessors for style tips. Most people would be hard-pressed to tell the Note 9 apart from the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-8-review/\">Note 8</a>, while the Razer Phone 2’s front is a doppelganger for the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/razer-phone-review/\">Razer Phone</a>, and it’s only when you see the glass back that the differences become obvious.</p>",
            "<p>But that’s where similarities end. The Razer Phone 2’s design has angular corners and hard edges, as well as sizable top and bottom bezels that house the front-facing speakers. It’s definitely a <a href=\"https://www.digitaltrends.com/mobile/best-gaming-phones/\">gaming phone</a> though, and it sports RGB lighting on the Razer logo. By contrast, the Note 9 is a culmination of modern design, with an all-glass design and soft curves that glide into each other. These phones have different styles, but the Note 9 is definitely the better looking.</p>",
            "<p>Water resistance has been added to the Razer Phone 2, with an IP67 rating, but it doesn’t quite match the Note 9’s IP68 rating. However, the aluminum front of the Razer Phone 2 probably gives it better drop-resistance than the all-glass Note 9. On the other hand, the Note 9 is one of the few flagship phones to still come with a headphone jack — worth keeping in mind if you can’t lack the jack.</p>",
            "<p>While the Razer Phone 2’s design will have its fans, the Note 9 is far prettier and has better water resistance.</p>",
            "<p><strong>Winner: Galaxy Note 9<br>\n</strong></p>",
            "<p>Here’s where both phones get to be a little bit special. The Note 9’s 6.4-inch Super AMOLED display is utterly gorgeous and showcases some of the deepest blacks and most vibrant colors we’ve seen on a smartphone. It’s so good that it was awarded <a href=\"https://www.digitaltrends.com/mobile/samsung-galaxy-note-9-news/\">DisplayMate’s highest ever score</a>, making this an exceptional piece of technology.</p>",
            "<p>The Razer Phone 2’s 5.7-inch UltraMotion IPS LCD display isn’t able to match the Note 9’s amazing color reproduction, but it’s still special in its own way — it supports a super-smooth 120Hz refresh rate. This means the Razer Phone 2’s display updates twice as often as most other phone displays, making performance smoother than normal — and significantly improving how good games feel on the device.</p>",
            "<p>It’s another tough matchup — but we think the Note 9’s higher quality screen will be coveted, but gamers will want the smoother 120hz display. We’re giving the Note 9 the win for being technically superior.</p>",
            "<p><strong>Winner: Galaxy Note 9<br>\n</strong></p>",
            "<p>The Razer Phone’s camera was one of its major weaknesses and it was primarily the software that let it down. That seems to have been fixed in the Razer Phone 2, which sports a much-improved camera app to complement the dual 12-megapixel lens set-up. But it’s up against a photography monster here. You’ll find a similar pair of 12-megapixel lenses on the Note 9, but the <a href=\"https://www.digitaltrends.com/photography/what-is-variable-aperture-samsung-galaxy-s9/\">variable aperture</a> borrowed from the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Galaxy S9</a> ensures photography is solid in a variety of lighting conditions, and Samsung’s artificial intelligence optimization is top-notch.</p>",
            "<p>The Note 9 also comes with a portrait-taking mode called Live Focus too, and though both phones have an 8-megapixel selfie shooter, Live Focus really gives Samsung the edge in selfies. Video capabilities are similar, with both being able to take video in 4K resolution — but the Note 9 can record at 60 frames-per-second, and in super-slow motion.</p>",
            "<p>The Razer Phone 2’s camera is much improved, but it’s a mismatch — like throwing a new boxer against a world champion. The Note 9 wins.</p>",
            "<p><strong>Winner: Galaxy Note 9<br>\n</strong></p>",
            "<p>The Note 9 comes with Samsung’s custom user interface — the Samsung Experience — laid over the top of <a href=\"https://www.digitaltrends.com/mobile/android-o-news/\">Android 8.0 Oreo</a>. It looks good and it offers some good customization options and additional features but there is a good deal of apps that repeat Android’s own base apps. That’s not an issue with the Razer Phone 2, which runs almost stock Android 8.1 Oreo, but with <a href=\"https://www.digitaltrends.com/mobile/how-to-use-nova-launcher/\">Nova Launcher</a> pre-installed. Nova Launcher offers a huge amount of customization, and you can tweak to your heart’s content. You won’t find many pre-installed apps either, except for Razer’s Chroma and Cortex apps.</p>",
            "<p>While neither has <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">Android 9.0 Pie</a> yet, you can expect it to come to both phones eventually. However, we expect Razer to have the update out well before Samsung, since Razer doesn’t need to adapt its own custom UI in the same way Samsung does.</p>",
            "<p>Both phones have great software, but we’re suckers for purer versions of Android. Add Razer’s better update history to that and the Razer Phone 2 comes out on top.</p>",
            "<p><strong>Winner: Razer Phone 2<br>\n</strong></p>",
            "<p>The Razer Phone’s special features are mostly entertainment-based. The front-facing stereo speakers hidden in the chunky top and bottom bezels are exceptionally loud, and there’s a THX-certified 24-bit Digital-to-Analog Converter (DAC) included, which you can use with wired headphones. Outside of that you’ll find Razer’s special game-boosting apps that serve to help keep your games together and optimize your experience — and the awesome RGB lighting on the back. Make no mistake, this is a gaming and entertainment-focused phone.</p>",
            "<p>The Note 9’s features cater for a wider audience. <a href=\"https://www.digitaltrends.com/home/samsung-bixby-voice-assistant-third-party-apps/\">Bixby</a> is pre-loaded, and though it’s still not great, it’s improving. Samsung’s <a href=\"https://www.digitaltrends.com/mobile/samsung-trademarks-dex-pad/\">DeX mode</a> has improved too, enabling your Note 9 to serve as a makeshift desktop and you can now use it with just a single cable. But the real headline feature here is the <a href=\"https://www.digitaltrends.com/mobile/all-the-s-pen-features-on-the-galaxy-note-9/\">S Pen</a>, which can be used to write on the screen, access quick features, or — most excitingly — be used as a camera trigger or clicker thanks to a low power Bluetooth connection. It’s a big change in the Note’s stylus, and it’s now something you might use.</p>",
            "<p>While the Razer Phone 2’s features are more tempting if you love your games or movies, we feel the Note 9’s are better suited to most people.</p>",
            "<p><strong>Winner: Galaxy Note 9<br>\n</strong></p>",
            "<p>The <a href=\"https://www.digitaltrends.com/go/f010044b2aa8cd01e611bd70ea7a2b62ababac9a/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Samsung\">Galaxy Note 9</a> is currently available, and prices start from $1,000 for 128GB of storage and 6GB of RAM. As a Samsung flagship, it’s usable on every major U.S. network.</p>",
            "<p>The Razer Phone 2 will be available for pre-orders from October 11 and will start from $799. Unfortunately, it will only work on T-Mobile and AT&amp;T.</p>",
            "<p>We all knew it would end up this way but the Note 9 really had to fight to keep its crown this time. The Razer Phone 2 looks to be a real contender, with tons of power, an improved camera, and an amazing 120Hz display. If you love your mobile gaming, your music, or your movies, then the Razer Phone’s super-smooth display, loud speakers, and flashy RGB lights will likely make you very happy. But for everyone else, the Note 9 is the phone to get — even at $200 more.</p>"
        ]
    },
    {
        "title": "\n\t\tKeep your Google Pixel 2 XL phone safe with these screen protectors\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>Google’s Pixel 2 XL packs in a <a href=\"https://www.digitaltrends.com/photography/google-pixel-2-camera-guide/\">class-leading camera</a>, a big battery, and the <a href=\"https://www.digitaltrends.com/mobile/android-8-oreo-tips-and-tricks/\">latest tricks Android has to offer</a>, but the real star of the show is that 6-inch POLED screen. With a resolution of 2,880 x 1,440 pixels, this vibrant, sharp display is a dream come true for watching movies and playing games. But it may not stay that way. An encounter with keys in your pocket or bag could lead to scratches and scrapes. A fumble could produce a shattering sidewalk collision. We’ve looked at the <a href=\"https://www.digitaltrends.com/mobile/best-pixel-2-xl-cases/\">best Pixel 2 XL cases</a> already; now it’s time to think about the best Google Pixel 2 XL screen protectors.</p>",
            "<p>Check out our <a href=\"https://www.digitaltrends.com/mobile/best-made-for-google-accessories/\">best Made for Google accessories</a> roundup for more ideas on the best Pixel 2 XL screen protectors.</p>"
        ]
    },
    {
        "title": "\n\t\tGoogle Phone app will feature direct-to-voicemail spam filtering\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>Google Pixel, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-review/\">Pixel 2</a>, and Google Nexus users are about to receive a welcome software update. The tech giant released a beta version of the Google Phone app, the pre-installed dialer on Pixel and Nexus handsets, that automatically sends unwanted spam and scam callers to voicemail.</p>",
            "<p>The new feature uses your Caller ID along with Google’s robust database to identify suspicious calls. When it finds a match, it automatically sends the call directly to voicemail, allowing you avoid unwanted calls altogether.</p>",
            "<p>The update comes two years after Google added spam call detection to the Phone app. That update warned users with a large red banner when a suspicious call came in and provided options to send the call to voicemail or block the number.</p>",
            "<p>And while the latest Google phone app update will definitely reduce the number of unwanted calls you receive, it looks like Google may become even more aggressive with spammers in the coming months. An upcoming feature looks like it will finally offer great protection against spam calls as well as a way to avoid “<a href=\"https://www.fcc.gov/consumers/guides/spoofing-and-caller-id\">call spoofing</a>” from scammers.</p>",
            "<p><a href=\"https://www.xda-developers.com/google-phone-screen-unwanted-spam-scam-calls/\">XDA Developers</a> is reporting Google may roll out a new feature called “Call Screening” in the coming months for Google Pixel and Google Nexus users. The feature, found while reviewing code in an APK teardown, will use real-time audio transcription to answer and screen unknown calls. You will then be able to send quick messages to the caller via SMS.</p>",
            "<p>The upcoming “Call Screening” feature will reportedly work without a Wi-Fi or data connection, though you’ll need one to send an SMS message. The feature will also store all call audio and transcripts locally on the phone, meaning you it will not be accessible to Google or others who may attempt to access your data online.</p>",
            "<p>Right now the Google Phone app is only available to users in the Android Beta Program. We anticipate seeing an official rollout in the coming weeks. If you use a Google Nexus or Pixel handset and want to get your hands on the latest version of the Google Phone app now, here’s the quickest way to sign up for the <a href=\"https://www.digitaltrends.com/mobile/how-to-install-android-p-beta/\">beta</a> program.</p>"
        ]
    },
    {
        "title": "\n\t\tKey settings you need to change on your brand-new Razer Phone 2\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>Got the gorgeous new Razer Phone 2 in your hands? We’ve compiled a list of settings you’ll want to change or update to get the absolute best experience from your new smartphone.</p>",
            "<p>Before we get started, you may want to check out our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/razer-phone-2-review/\">Razer Phone 2 review</a> for our impressions or see how it compares to the gaming-focused <a href=\"https://www.digitaltrends.com/mobile/razer-phone-2-vs-galaxy-note-9/\">Samsung Galaxy Note 9</a>.</p>",
            "<p>When you look at the Razer Phone 2, the first thing you’re likely to notice is the beautiful backlight logo. The feature is called Chroma, and it allows you to customize the logo color, like you would on a Razer keyboard. While Chroma is definitely a conversation starter, it can quickly drain your battery.</p>",
            "<p>We suggest changing the Chroma settings to turn the logo on only when you’re using the phone or have a new notification.  To change your Chroma settings go to <em>Settings &gt; Chroma. </em>Toggle the <em>Notifications </em>slider and tap the <em>Medium </em>battery consumption icon.</p>",
            "<p>One of the most exciting features you’ll find on the Razer Phone 2 is its 120Hz display. When the feature is turned on you’ll immediately notice an improvement in the display when gaming, as well as when you’re scrolling through your social media feeds. By default, Razer has the display refresh rate set to 60Hz to preserve battery life.</p>",
            "<p>We feel like the slightly reduced battery life is a small trade-off for the buttery smooth performance you’ll see when the 120Hz refresh rate is enabled. To switch to the 120Hz refresh rate, just go to <em>Settings &gt; display </em>and tap on <em>Refresh rate. </em>Select the radio box next to <em>120Hz. </em></p>",
            "<p>The Razer Phone 2 has its fingerprint sensor on the side of the phone, so it can be a challenge to wake your screen when your phone is sitting on a table. Since you probably don’t want to pick up your phone each time you need to wake the screen, you should update a setting that allows you to enable the screen by tapping on it.</p>",
            "<p>To turn on the tap to wake gesture just press <em>Settings &gt; Display. </em>Tap the <em>Advanced </em>drop-down menu and toggle on the <em>Tap to Wake </em>slider.</p>",
            "<p>The Razer Phone 2 has a massive 4,000mAh battery that should easily get you through a day, and then some. But it’s still nice to be able to easily glance at your remaining battery life.</p>",
            "<p>By default, battery percentage information is not listed in the status bar, but it takes just seconds to tweak the settings to show this information. To add battery percentage information to the status bar go to <em>Settings &gt; Battery </em>and toggle on the slider next to <em>Battery percentage. </em></p>",
            "<p>Since the Razer Phone 2 is a gaming phone, you have to expect it’s going to have awesome software to improve your gaming experience. Game Booster allows you to maximize your Razer Phone 2’s performance while minimizing distractions.</p>",
            "<p>Setting up Game Booster is quick and painless. Simply go to <em>Settings &gt; Game Booster. </em>You’ll see three different modes available: We recommend you select the <em>Custom </em>mode. Tap the <em>+</em> icon under the Games section and tap on the apps or games for which you’d like to maximize the Razer Phone 2’s performance. You can also toggle on the <em>Do Not Disturb </em>slider in Game Booster to turn off notifications when using one of the selected apps.</p>",
            "<p>While many people use Do Not Disturb mode to temporarily block notifications and other interruptions during meetings and important events, the Razer Phone 2 also allows you to create a schedule to enable the feature automatically. Scheduling Do Not Disturb gives you an opportunity to have time away from your phone in the evenings and at other times when you want to unplug.</p>",
            "<p>Setting up Do Not Disturb mode on the Razer Phone 2 is fairly easy since there are predefined rules you can enable. Simply go to <em>Settings &gt; Sound &gt; Do Not Disturb preferences. </em>You can customize the automatic rules simply by tapping on them and selecting days and times you’d like to associate with the rule. Once you’ve made your changes, make sure you toggle the slider next to <em>Off </em>at the top of the screen to enable the rule. If you wish to make your own custom rule, just select <em>Add more </em>and select <em>Event rule </em>or <em>Time rule. </em></p>",
            "<p>The fingerprint sensor on the Razer Phone 2 can be difficult to reach unless you’re holding the phone. This can make it difficult to quickly put the lock screen to sleep when a notification appears.</p>",
            "<p>Luckily, there’s a gesture that can be enabled in the settings that allows you to put the lock screen to sleep by double-tapping it. Turn the feature on by going to <em>Settings &gt; Display </em>and tapping on the <em>Advanced </em>drop-down menu. Toggle on the <em>Double-tap to sleep</em> slider.</p>",
            "<p>Instead of creating a heavily customized skin for its smartphones, Razer did something a little different. The company added Nova Launcher to its phones, which is a <a href=\"https://www.digitaltrends.com/mobile/best-launcher-for-android/\">very popular Android launcher</a> that offers loads of customization options. While you can customize just about any feature imaginable with Nova Launcher, we think it’s a good idea to start with changing the app drawer on the phone.</p>",
            "<p>To customize the app drawer tap on the <em>Nova Settings </em>icon, select <em>Apps &amp; widget drawers, </em>and press <em>App drawer style</em>. You’ll see three different options. Select <em>Horizontal</em> if you like swiping left or right to see the various app windows. Choose <em>Vertical</em> if you prefer scrolling through all your apps on one window. There’s also a <em>List</em> option if you prefer to see a list with minimized app icons and names.</p>",
            "<p>Google Now uses your search history, location, and personal preferences to provide information that may be of interest. You can easily access Google Now simply by swiping right while on the home screen.</p>",
            "<p>Google Now can quickly be removed, providing a more minimalist home screen. If you want to remove the Google Now page, tap the <i>Nova Settings </i>icon and press <em>Integrations</em>. Toggle off the slider next to <em>Google Now Page. </em></p>",
            "<p>The 5.7-inch display on the Razer Phone 2 provides plenty of real estate for gaming or streaming your favorite program. If you’re using your phone at night or in bed, however, you may find yourself tossing and turning throughout the night. If you want to get a better night’s sleep, you may want to minimize the amount of blue light your smartphone screen emits. The Razer Phone 2 has a feature called Night Light that can help.</p>",
            "<p>Night Light is a <a href=\"https://www.digitaltrends.com/mobile/how-to-use-blue-light-filter-phone/\">blue light filter</a> that can be scheduled at specific times. To set up night light, go to <em>Settings &gt; Display &gt; Night Light.</em> Select <em>Schedule </em>and pick the appropriate option. <em>Turns on at custom time </em>allows you to create a custom Night Light schedule, while <em>Turns on from sunset to sunrise</em> uses time zone information on your phone to turn on the feature.</p>",
            "<p>Want to get awesome 4K video on your new Razer Phone 2? Well unless you change a setting in your camera, you may have an unpleasant surprise the first time you watch a video recorded on your phone. By default the Razer Phone 2 records video in 1080p, but you can make a quick change to switch to 4K.</p>",
            "<p>To change your rear-facing camera to 4K, tap on the <em>Camera </em>icon. Select the gear icon and tap on <i>Back camera video resolution. </i>Select the 4K radio box.</p>"
        ]
    },
    {
        "title": "\n\t\tMaster your new Razer Phone 2 with these handy tips and tricks\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>From its 120Hz display, to its jaw-dropping Dolby Atmos speakers, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/razer-phone-2-review/\">Razer Phone 2</a> is made for gaming. But at $800, the phone is probably going to be used for a whole lot more than playing <em><a href=\"https://www.digitaltrends.com/gaming/pokemon-go-game-not-for-everyone-yet/\">Pokemon Go</a></em>. If you’re a lucky new owner, we’ve compiled a few of our favorite Razer Phone 2 tips and tricks to get you started with your new phone.</p>",
            "<p>Whether you want a little time away from your email or you simply want to have a good night’s sleep without tons of notifications, Do Not Disturb mode can can help. When you set up Do Not Disturb, you can easily create multiple schedules that limit the number and types of notifications and calls you’ll receive.</p>",
            "<p>Setting up Do Not Disturb mode is easy. Simply go to <i>Settings &gt; Sound &gt; Do Not Disturb Preferences.  </i>From here you can customize the pre-defined rules by tapping on them. If you’d like to create a custom rule, select <em>Add More</em> and choose either <em>Event Rule </em>or <em>Time Rule.</em> When you’ve finished updating any rule, make sure you enable it by toggling on the slider at the top of the screen.</p>",
            "<p>Looking to jazz up your home screen? You’re in luck because the Razer Phone 2 has an awesome Theme Store that allows you to totally customize your phone. If you want to give it a shot, just open the Theme Store app and scroll through the Featured and Game Theme sections. You can also search for specific themes by tapping the <em>magnifying glass </em>icon at the bottom of the screen. When you’ve found a theme you like, tap on it and select <em>Download.</em> Once it is downloaded, press the <em>Apply </em>button to change to your new theme.</p>",
            "<p>Just about every flagship supports 4K video recording and the Razer Phone 2 is no exception. However, if you want to record video in 4K you’ll need to make an adjustment to the settings in your Camera app.</p>",
            "<p>To switch to 4K resolution tap the <i>Camera </i>icon followed by the <em>gear </em>icon below the viewfinder. Select <i>Back Camera Resolution</i> and tap the radio button next to UHD 4K.</p>",
            "<p>One of the things that makes the Razer Phone 2 stand out is its awesome 120Hz display. In contrast to 60Hz displays found on other smartphones, the Razer Phone 2’s display offers latency-free gaming and buttery smooth performance. But what good is the awesome display if you can’t find games that are optimized for it?</p>",
            "<p>Luckily, Razer is a step ahead of the game and created Cortex. This app allows you to quickly access your game library, find new games, and even optimize the phone for game play. To find new games, simply open the Cortex app and tap the <em>featured </em>icon. From this screen you can easily download supported games from the Google Play store.</p>",
            "<p>If you already have a library of games, you just need to open the Cortex app to find them neatly stored under the <em>Library </em>tab. Finally, you’ll notice a <em>Game Booster </em>tab on the lower right side of the screen. From here you can choose which power mode you’d like to use on the phone in general, or simply improve performance on selected games and apps by tapping the <i>Manage Games </i>icon.</p>",
            "<p>Last year’s Razer Phone had a relatively ho-hum design. This year, however, Razer made some changes that make its newest flagship a bit more eye-catching. One of those changes is the addition of the backlit Razer logo on the phone. The new logo is more than just for show though, it can also alert you when you have new notifications.</p>",
            "<p>You can easily customize both the color and function of the Razer logo on your new phone. If you want to give it a shot go to <em>Settings &gt; Chroma. </em>Toggle on the <em>My Chroma Effect</em> slider and tap <em>My Chroma Effect. </em>From this screen you can adjust the color by tapping on the color wheel or entering a Hex code, and you can adjust the brightness by tapping on the <em>brightness </em>icon at the bottom of the display. You can also tap the <em>effect </em>icon on the bottom right side of the screen to customize the logo lighting effect. Tap the back arrow to return to the primary screen: From here you can select when you’d like the logo to be illuminated by tapping your preferred icon under the <em>Battery Consumption </em>tab.</p>",
            "<p>Like its predecessor, the new Razer Phone 2 has speakers that sit prominently at the top and bottom of the display. While this means the phone has awesome audio quality, it also means there’s no room for a fingerprint sensor. For better or worse, Razer chose to put the fingerprint sensor on the side of its phone, making it difficult to access when it’s sitting on a table.</p>",
            "<p>Luckily there’s a somewhat hidden gesture that can wake your screen whenever you lift the phone. To turn on the feature go to <em>Settings &gt; Display </em>and tap on <em>Advanced. </em>Select <em>Ambient Display </em>and toggle the slider next to <em>Lift To Check Phone. </em></p>",
            "<p>Perhaps the standout feature on the new Razer Phone 2 is its 120Hz display. We’ve already talked about what it can do for game performance, but did you know it can drain your battery rather quickly? Fortunately you can easily choose between three different refresh rates on your new smartphone.</p>",
            "<p>To change your display’s refresh rate, go to <em>Settings &gt; Display </em>and tap on <em>Refresh Rate.</em> You’ll see three options: 60Hz, 90Hz, and 120Hz. Tap the appropriate radio box next to your preferred refresh rate. If you’re unsure which refresh rate to select, you’ll probably want to choose 120Hz when gaming, and 90Hz for daily use. If you find your battery draining quickly at 90Hz, you may want to give 60Hz a shot.</p>",
            "<p>Now you’ve learned a few of our favorite tips and tricks, you may want to <a href=\"https://www.digitaltrends.com/mobile/razer-phone-2-settings/\">change a few settings</a> on your new Razer Phone 2 in order to have the best user experience.</p>"
        ]
    },
    {
        "title": "\n\t\tRazer Phone 2 vs. Razer Phone: Is it time to level up?\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>The Razer Phone was something of a surprise last year, but it looks as though <a href=\"https://www.digitaltrends.com/mobile/best-gaming-phones/\">gaming phones</a> are a new category that’s here to stay. This year, Razer is looking to level up with an improved smartphone that offers the best mobile gaming experience around and improves on some of its predecessor’s shortcomings.</p>",
            "<p>On top of the inevitable adoption of a newer processor, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/razer-phone-2-review/\">Razer Phone 2</a> has a better camera, water resistance, and wireless charging support. We decided to compare it to the original Razer Phone to see precisely what has changed. Game on.</p>",
            "<p>The Razer Phone 2 is packing a Qualcomm Snapdragon 845 processor backed by 8GB of RAM. This year’s “flagchip” is in all the top Android phones and it’s significantly faster and more power efficient than last year’s Snapdragon 835, which you’ll find in the original Razer Phone. Both have 64GB of storage with room for <a href=\"https://www.digitaltrends.com/mobile/best-microsd-cards/\">expansion via a MicroSD card</a>.</p>",
            "<p>The battery capacity hasn’t shifted, still weighing in at 4,000 mAh, and you’ll find support for the incredibly fast Qualcomm Quick Charge 4.0+ standard in both Razer phones, but only the Razer Phone 2 offers Qi wireless charging.</p>",
            "<p><strong>Winner: Razer Phone 2</strong></p>",
            "<p>Quite honestly we wouldn’t award Razer’s design any plaudits. The chunky, squared-off look of the original, itself inherited from the ill-fated <a href=\"https://www.digitaltrends.com/cell-phone-reviews/Nextbit-Robin-Review/\">Nextbit Robin</a> returns in the Razer Phone 2, but this time around the rear of the phone is black glass and the triple-headed snake logo glows with customizable lighting effects that can serve as app notifications. It’s a bold, unique look that definitely grabs your attention. The camera module has also been centered, giving the Razer Phone 2 a much more stylish look from the back than the original. You’ll still find the fingerprint sensor in the power button on the side of the frame. The front of these phones looks very similar with the 5.7-inch screen flanked by stereo speakers.</p>",
            "<p>The first Razer Phone felt like a tank that could survive a drop or two. The glass-clad Razer Phone 2 doesn’t feel as durable, but it does add water resistance into the mix with an IP67 rating that means it can be submerged in shallow water for up to half an hour without sustaining damage.</p>",
            "<p><strong>Winner: Razer Phone 2</strong></p>",
            "<p>The displays in these phones are identical on paper. They are both 5.7-inch IPS LCD screens with resolutions of 2,560 x 1,440 pixels. They also both offer 120 Hz screen refresh and 120 Hz touch sampling, which ensures that you never miss a frame of the gaming action. It still doesn’t match the quality of an OLED screen, but Razer has managed to make the screen 50 percent brighter this year and it really makes a difference.</p>",
            "<p><strong>Winner: Razer Phone 2</strong></p>",
            "<p>We highlighted the camera as one of the weak spots of the Razer Phone. Despite pairing two 12-megapixel lenses it disappointed with most shots and we felt the experience was severely hampered by slow software that was lacking in features. Razer went back to the drawing board with the Razer Phone 2 camera to pair an all-new 12-megapixel wide-angle lens with optical image stabilization (OIS) and a 12-megapixel telephoto lens with 2x zoom. Based on first impressions, it seems to be a big step up on last year’s camera.</p>",
            "<p>Both phones can record video at up to 4K at 30 frames-per-second and also have an 8-megapixel front-facing camera.</p>",
            "<p><strong>Winner: Razer Phone 2</strong></p>",
            "<p>The original Razer Phone launched with Android 7.1.1 Nougat, but has since been updated to Android 8.1 Oreo. The Razer Phone 2 is being released with Android 8.1 Oreo installed, which is a bit disappointing since <a href=\"https://www.digitaltrends.com/mobile/android-9-pie-review/\">Android 9.0 Pie</a> is now available. There is a customizable launcher and a special Game Booster app, but the experience is fairly close to stock Android. We expect the Razer Phone 2 to get updates for a bit longer than the Razer Phone, so it scores the win here.</p>",
            "<p><strong>Winner: Razer Phone 2</strong></p>",
            "<p>Both Razer phones have the fast refreshing, super responsive screen, though the brightness is improved in the Razer Phone 2. They also both offer plenty of customization options in the Game Booster app. However, only the newer phone boasts a Vapor Chamber cooling system which, paired with the more powerful processor, allows you to run demanding games for longer before the phone overheats. The Razer Phone 2 also has that versatile, eye-catching light-up logo on the back which can be fully customized with the pre-installed Chroma app.</p>",
            "<p><strong>Winner: Razer Phone 2</strong></p>",
            "<p>The original Razer Phone costs $700, but the Razer Phone 2 will cost you $800. You can buy either one unlocked directly from Razer, but the original Razer Phone won’t work with Verizon or Sprint. There’s also no CDMA support for the Razer Phone 2, but it does have support for Verizon LTE.</p>",
            "<p>It’s refreshing when a manufacturer listens to feedback and works to improve as Razer has done here. A lot of the things we didn’t like about the original have been improved or fixed in the Razer Phone 2. The camera and design are much better, it’s faster, it’s water resistant now, and it supports wireless charging. Even at $100 more, the Razer Phone 2 is a much more attractive prospect and the obvious choice if you’re considering these two phones. If you already have the Razer Phone, we’re not sure you’ll want to upgrade so soon.</p>"
        ]
    },
    {
        "title": "\n\t\tThe Razer Phone 2: Everything you need to know\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Gaming phones have gone from a strange niche to a commonplace release in the last year. The first <a href=\"https://www.digitaltrends.com/cell-phone-reviews/razer-phone-review/\">Razer Phone</a> arrived with good specs and an amazing display, and it was quickly joined by the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/honor-play-review/\">Honor Play</a> and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/red-magic-phone-review/\">Red Magic Phone</a>. Even Samsung started marketing the <a href=\"https://www.digitaltrends.com/mobile/samsung-galaxy-note-9-news/\">Galaxy Note 9</a> as a gaming phone. It hasn’t stopped there though, and we’ll soon see the release of the <a href=\"https://www.digitaltrends.com/mobile/asus-rog-phone-news/\">Asus ROG Phone</a> and Xiaomi’s <a href=\"https://www.digitaltrends.com/mobile/blackshark-news-rumors/\">Black Shark</a> phone. With such a suddenly swollen market, is there now room for yet another gaming-focused smartphone?</p>",
            "<p>Razer seems to think so, and it’s throwing down a mighty gauntlet with the release of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/razer-phone-2-review/\">Razer Phone 2</a>. With new top specs, an improved camera, and new RGB lighting thrown in by default, here’s absolutely everything you need to know about the Razer Phone 2.</p>",
            "<p>After the pre-order period, the Razer Phone 2 is now available for $799 — though you can get it for even cheaper given a few deals that are currently going on. If you buy the phone through <a href=\"https://www.amazon.com/Razer-Phone-New-Smartphone-Snapdragon/dp/B07H9V6PHZ?tag=dt-incontent-btn-20\" www.>Amazon</a>, <a href=\"https://click.linksynergy.com/fs-bin/click?id=9e1vMmumXG0&amp;subid=0&amp;offerid=570502.1&amp;type=10&amp;tmpid=13127&amp;RD_PARM1=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Frazer-phone-2-with-64gb-memory-cell-phone-unlocked-black%2F6296105.p%3FskuId%3D6296105\" target=\"_blank\" rel=\"noopener\">Best Buy</a>, or the <a href=\"https://click.linksynergy.com/fs-bin/click?id=9e1vMmumXG0&amp;subid=0&amp;offerid=615049.1&amp;type=10&amp;tmpid=8343&amp;RD_PARM1=https%253A%252F%252Fwww.microsoft.com%252Fen-us%252Fp%252Frazer-phone-2%252F900db1vrp566%253Factivetab%253Dpivot%253Aoverviewtab\" target=\"_blank\" rel=\"noopener\">Microsoft Store</a>, you’ll get the phone for $100 off, which comes out to a total of $700. On top of that, if you bring the phone from another major carrier to Verizon and <a href=\"http://vzw.com/\" target=\"_blank\" rel=\"noopener\">activate it on Verizon</a>, you’ll get a $250 Prepaid MasterCard. These deals are valid until February 7, 2019.</p>",
            "<p>A satin-finish model is also available for $899, but it comes with double the internal storage. While initially it was thought that the phone wouldn’t work on Verizon, Verizon announced that it has certified the phone on its network — so you can get the Razer Phone 2 from Best Buy and bring it to Verizon for activation. The phone works perfectly fine on T-Mobile and AT&amp;T, too — though you can’t use it on Sprint.</p>",
            "<p>2018 seems to be showcasing a trend for slightly tweaked designs. Like the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Galaxy S9</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-review/\">iPhone XS</a>, the Razer Phone 2’s design hasn’t changed an awful lot when compared to the original Razer Phone. The Razer Phone 2 is more or less the same size as its predecessor and shares the same chunky top and bottom bezel that houses the phone’s impressive Dolby-tuned front-facing stereo speakers. Razer claims its made these speakers even louder and clearer than the previous phone, which would be impressive — the Razer Phone housed some of the loudest phone speakers we’ve ever come across.</p>",
            "<p>But flip the phone over and there are more differences to be found. The back panel is now made from Gorilla Glass 5 (enabling wireless charging) and the dual camera lenses have been moved to a more central position. There’s a big immediate change on the back though, and the Razer branding now comes alive with RGB lights. Powered by Razer’s Razer Chroma tech, the logo glows with 16.8 million colors, reacts to notifications, and can be customized with lighting effects like Static, Spectrum Cycling, and Breathing. It’s similar to the RGB strip on the Red Magic Phone, and we can’t wait to take it for a spin.</p>",
            "<p>You’ll find the same 5.7-inch UltraMotion LCD display with a 120Hz refresh rate on the front of the Razer Phone 2. This was definitely one of the most impressive features of the original Razer Phone, and the 120Hz framerate provided incredibly smooth gaming and day-to-day use. It’s something you have to see to truly believe. Razer claims it has tinkered with the screen on the Razer Phone 2 a little though, as the newer phone’s display is brighter than its predecessor.</p>",
            "<p>Razer has also added water-resistance to the Razer Phone 2, adding an IP67 rating that should mean it will survive a drop into a pool or the bath.</p>",
            "<p>The Razer Phone 2 is marketed as a flagship and gaming-focused phone, so it’s fitting that such a phone comes with the most powerful hardware to make sure of top performance.</p>",
            "<p>The <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Qualcomm Snapdragon 845</a> processor powers the Razer Phone 2, as it has for many of this year’s biggest flagships. It’s an exceptionally powerful chip, and we expect strong performance both from normal usage and in demanding mobile games. Razer claims a performance boost of 30 percent compared to the Razer Phone, and that seems likely with this powerful new processor. Similar to the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Galaxy Note 9</a>, there’s a special cooling system to keep the chip cool during strenuous use — the Razer vapor chamber that provides a wide surface area for heat to dissipate, and helps to draw heat away from components.</p>",
            "<p>That processing power is backed up by a huge 8GB of RAM, which should keep the phone ticking through a load of multitasking. There’s a slightly smaller amount of storage with just 64GB available onboard, but you’ll be able to boost that by up to 1TB, thanks to the MicroSD card slot. A satin-finish Razer Phone 2 will also be available for $100 more, and it comes with 128GB of storage.</p>",
            "<p>All that power requires some serious juice, and that’s why there’s a monster battery on board. The Razer Phone 2 comes with a huge 4,000mAh battery that should keep the phone ticking throughout the day. Wireless charging is now available, thanks to the glass back, and there’s superfast USB-C charging with <a href=\"https://www.qualcomm.com/news/onq/2018/02/23/how-can-quick-charge-4-turbocharge-your-mobile-device\">QuickCharge 4.0+</a>, which Razer claims will charge half the battery in 30 minutes.</p>",
            "<p>You’ll find <a href=\"https://www.digitaltrends.com/mobile/android-o-news/\">Android 8.1 Oreo</a> on the Razer Phone 2, and it comes with Nova Launcher pre-installed, ensuring a high-level of customization. There’s no word as to when an <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">Android 9.0 Pie</a> update will be incoming, but Razer was pretty fast in updating the original Razer Phone to <a href=\"https://www.digitaltrends.com/mobile/android-oreo-when-do-you-get-it/\">Android 8.0 Oreo</a>, so it’s fair to expect a similar sharp turnaround for the Razer Phone 2.</p>",
            "<p>It’s likely to be a mostly stock Android experience, but Razer has added some software to make your gaming life a little more pleasant. Razer’s new <a href=\"http://www.anrdoezrs.net/links/2942700/type/dlg/https://www.razer.com/cortex\">Razer Cortex</a> app will be preinstalled, and it will organize your mobile gaming collection, optimize performance with Game Booster, and suggest 120Hz-compatible games as well. There’s also a Razer Theme store, where gaming fans will be pleased to find themes to match their <em>PUBG Mobile</em>, <em>Tekken</em>, or <em>Vainglory</em> gameplay.</p>",
            "<p>The Razer Phone 2 has been optimized to work well with particular apps too. Netflix has officially certified the phone for HDR video content and Dolby Surround 5.1 audio content, and Razer promises the phone will also provide excellent performance in games like <em>PUBG Mobile</em>, <em>Rival Crimson x Chaos</em>, <em>Marvel Future Fight</em>, <em>Guns of Boom</em>, <em>RuneScape</em> and more.</p>",
            "<p>Just in case you thought a new gaming phone wasn’t enough, Razer is also releasing some new accessories to go along with your gaming.</p>",
            "<p>The Razer Raiju is a controller for your phone that comes with a built-in mobile mounting system and a Bluetooth connection to ensure that you’re getting the best out of your gaming. It has four remappable buttons, hair-trigger mode, and Razer Mecha-Tactile action buttons. You can customize its use with an app, and it works with a wide variety of phones running Android 6.0 Marshmallow and above, and works in a bunch of games, including <em>Vainglory</em>, <em>Lineage 2</em>, and <em>Dead Trigger 2</em>.</p>",
            "<p>The Razer Raiju will be available later this year, and will cost $150.</p>",
            "<p>There’s no headphone jack on the Razer Phone 2, but you can still get the best possible audio experience with Razer’s Hammerhead USB-C headphones.</p>",
            "<p>It uses Dual Driver technology to deliver the best possible balance of bass and trebles, while a built-in digital to audio converter (DAC) also helps to boost the quality of your sound. The headphones also draw power from your phone for active noise cancellation, keeping you fully immersed in your gaming or music.</p>",
            "<p>They also come with Comply foam tips for a comfortable and secure fit, while tangle-free cables and a solid aluminum frame mean they’re durable as well. The Hammerhead headphones will launch on <a href=\"http://www.anrdoezrs.net/links/2942700/type/dlg/https://www.razer.com/gb-en\">Razer’s online store</a> from October 22 and will cost $100.</p>",
            "<p>You do get a 24-bit 3.5mm headphone jack to USB-C DAC in the box, in case you want to keep using your wired headphones.</p>",
            "<p>You’ll find a pair of 12-megapixel lenses on the back of the Razer Phone 2 — a primary lens with optical image stabilization, and a secondary lens with a 2x optical zoom. On paper, it seems to be the same disappointing camera suite we saw on the original Razer Phone — though Razer claims to have worked on the camera’s interface, and image quality should be much improved thanks to the use of Sony sensors. The barebones camera app was another of our issues with the original phone, and a more fully featured app could help push the Razer Phone 2 beyond its predecessor.</p>",
            "<p>On the front, you’ll find an 8-megapixel selfie lens, which supports taking 1080p video. The rear-facing cameras are more impressive, being able to record in 4K.</p>",
            "<p><em>Updated on January 17, 2018: The Razer Phone 2 is available for $100 off.</em></p>"
        ]
    },
    {
        "title": "\n\t\tThe best electric scooters for 2019\t",
        "author": [
            "\n\t\t\t\t\t\tPatrick Daniels\t\t\t\t\t"
        ],
        "text": [
            "<p class=\"p1\">\n\t\t\t<aside class=\"m-content-item-list m-content-module right h-nonessential\">\n\t\t\t\t\t\t\t\t\t<h4 class=\"title\">\n\t\t\t\t\t\tRelated reads\t\t\t\t\t</h4>\n\t\t\t\t\n\t\t\t\t<div class=\"items\">\n\t\t\t\t\t\t\t\t\t\t\t<div class=\"item\">\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://www.digitaltrends.com/cool-tech/best-electric-skateboards/\">Best electric skateboards</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t<div class=\"item\">\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://www.digitaltrends.com/cool-tech/best-drones/\">Best drones</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t<div class=\"item\">\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://www.digitaltrends.com/cool-tech/best-3d-printers/\">Best 3D printers</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t</aside>\n\n\t\t\t</p>",
            "<p>Electric scooters are an undeniably awesome way to get around. Unlike how it is with <a href=\"https://www.digitaltrends.com/cool-tech/best-electric-skateboards/\">electric skateboards</a>, it doesn’t really take much practice to figure out how to ride a scooter safely. You also don’t need a license like you do with a motorcycle or a car. And best of all? You also don’t have to pay for gas or insurance as an electric scooter owner. As such, it’s not surprising that companies like Lime and Bird are using scooters to take over the world. But if you’d rather not rent scooters from a rideshare program, check out these awesome ones that you can buy outright. Enjoy!</p>",
            "<p>The EcoSmart Metro Electric Scooter is a refined, practical version of the first-generation Razor. Released last year, recent price cuts have brought it down to under $400, and it’s the cheapest model on our list. A 500-watt motor provides plenty of pop and a top speed of 18 miles per hour, while the sleek bamboo deck, adjustable seat, and removable luggage carrier add a welcome touch of style and pragmatism.</p>",
            "<p>The rather limited max distance of 10 miles per charge and a daunting recharge time of up 12 hours are both glaring cons, but it’s hard to expect more from a scooter at this price point. You might not be able to fingerwhip the EcoSmart Metro Electric Scooter as easily as its first-gen counterpart, but getting around town will be much easier.</p>",
            "<p style=\"text-align: center;\">\n</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/707323c1531dd8bda9d190d0ccb6256f8aec442c/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Walmart\">Walmart </a><a href=\"https://www.digitaltrends.com/go/74402cad00f1892b248fbe9f136e8229b88bbce4/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Nowadays, many manufacturers tout the portability of their foldable scooters, yet, if said scooter weighs more than 70 pounds, it really isn’t all that “portable.” Thankfully, the Glion Dolly folds up nicely and weighs a cool 26 pounds, rendering it a true portable. If carrying the Glion around isn’t your thing, the Dolly Model also comes equipped with a handle extension that’s built directly into the frame. Simply fold the scooter, extend the handle, and roll the scooter behind you like a piece of traditional luggage. The Glion’s 250-watt motor might not provide a lot of power, but the scooter’s durable aluminum frame, 15-mile range, and low recharge time (3.5 hours) are all pros for this practical option.</p>",
            "<p style=\"text-align: center;\">\n</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/806b2708029b996d52aa887752e29a497a322abb/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p><span style=\"line-height: 1.5;\">At nearly $5,000, the zero-emissions Scrooser isn’t cheap. However, the design of the Scrooser is one of the sleekest we’ve seen, and one that should make for an equally smooth ride. The German-built scooter doesn’t break any land speed records — top speeds max out at 3.7, 12.4, or 15.5 mph, depending on your configuration — but a maximum range of 34 miles puts it at the top of our list. Charge time is pretty average for the 500-watt motor, coming in at around 2.5 to 4 hours, though you can can get it up to 80-percent strength in a mere two hours. Another interesting feature is the impulse motor that lies at the heart of the drive train, which is how you start the scooter. The more force you use to push off, the faster the Scrooser will go. The models configured for higher speeds even have a built-in throttle, which controls the electric motor with or without your help. </span><span style=\"line-height: 1.5;\"><strong><a href=\"https://www.digitaltrends.com/outdoors/scrooser-electric-scooter-minimalist-design-urban-transport/\">Read more here</a>.</strong></span></p>",
            "<p style=\"text-align: center;\">\n</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/ef86e9259511f66798786cf176290f60f1e2021c/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Scrooser\">Scrooser </a></p>",
            "<p>With a one of the longest ranges on our list, the GigaByke Groove doesn’t intend to limit you to short trips like some other scooters on the market. The nimble machine can travel up to 35 miles on a single charge, yet, that doesn’t necessarily mean that you’ll be burning rubber in the process — the Groove tops out at 20 mph given its ample 750-watt motor (probably to give you such great range, we’d think). An LED headlight, turn signals, digital speedometer are all added perks for inner city commuters. I<span class=\"a-list-item\">f distance rather than speed is your thing, the Groove is one of the best scooters out there for achieving it, and you have four different color options to get there in style.</span></p>",
            "<p style=\"text-align: center;\">\n</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/549416eab3e582e5032b3b781ac178d40a7cea9e/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Jetson’s first-gen eBike might look a lot like a standard-issue Vespa scooter, but the underlying mechanics and 500-watt electric motor are anything but traditional. With a charge time of less than an hour, the Jetson eBike won’t bog you down with charge-related delays between trips. The electric scooter also allows you to partially recharge the battery by simply pedaling, but suffers from a rather mediocre top speed of 20 mph. It is, however, capable of hauling up to 375 pounds and going 40 miles on a single charge, which makes for an enjoyable — albeit, rather slow — ride for two.</p>",
            "<p style=\"text-align: center;\">\n</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/498775866b3ddab7a2ee524d436f02a2cef127af/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>GenZe unveiled its second-generation scooter earlier this year. The latest model, <a class=\"text-link\" href=\"http://www.genze.com/electric-scooter/\" target=\"_blank\" rel=\"noopener noreferrer\">GenZe 2.0, starts at $3,000</a> and comes loaded with a plethora of handy features. One of the scooter’s real standouts is its 7-inch touchscreen display and digital speedometer, which allows you to switch between various performance options (Safe, Econ, Sport) while the vehicle isn’t in motion. The GenZe 2.0 also utilizes the touchscreen when starting, requiring drivers to input a four-digit PIN.</p>",
            "<p>An on-board <a class=\"text-link\" href=\"https://en.wikipedia.org/wiki/CAN_bus\" target=\"_blank\" rel=\"noopener noreferrer\">CAN bus</a> continuously sends data to the company’s servers and the official companion app iOS and Android. Nearly 95 variables are updated every five seconds, spanning everything from engine temperature to the status of the built-in kickstand. An embedded GPS also allows you to locate your GenZe at anytime, and you can also receive an alert via the app if the scooter ever happens to exit a predetermined geographical range. It utilizes AT&amp;T’s cellular network when it cannot access Wi-Fi hot spots, too, at no additional cost.</p>",
            "<p>There are plenty of practical features as well, including a pair of charging docks housed beneath the seat and an open cargo space in the rear for 75-pound loads. The GenZe 2.0’s aluminum frame weighs in at a mere 232 pounds, too, though the low weight does not translate to increased speed. The paltry acceleration time — it can go from zero to 30 mph in 8 seconds — isn’t exactly telling of a white-knuckle experience, either. <strong><a href=\"https://www.digitaltrends.com/cars/mahindra-genze-2-0-scooter/\">Read more here.</a></strong></p>",
            "<p style=\"text-align: center;\">\n</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/cf8d03421a860684e167f2c179d640dd62feafea/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"GenZe\">GenZe</a></p>",
            "<p>With a price tag starting at $5,950, Works Electric’s BR2 is by far one of the most expensive electric scooters on the market. On the same token, the BR2 is also virtually unmatched in performance and technology. Brad Baker, owner of Works Electric and creator of the BR2, <a href=\"https://www.digitaltrends.com/cool-tech/works-electric-rover-scooter/\">addressed</a> the high price quite straightforwardly: “You want something cheaper, go buy something else.” With a powerful, 4000-watt ZM2 Brushless Drive System, a top speed of 35 mph, and <span style=\"line-height: 1.5;\">the ability to go from 0 to 30 mph in 4.1 seconds, this sucker is admittedly pretty hard to beat</span><span style=\"line-height: 1.5;\">. The scooter’s 30-mile range just seals the deal. <strong><a href=\"https://www.digitaltrends.com/cool-tech/works-electric-rover-scooter/\">Read more here.</a></strong></span></p>",
            "<p style=\"text-align: center;\">\n</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/678e0a26632b5b82ca70aaabada9836dd7ad0a9c/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Works Electric\">Works Electric</a></p>",
            "<p>Lightweight and affordable, Ecoreco’s scooters appeal to just about everyone. The company’s newest addition — the Ecoreco S5 — is an urban commuter’s dream. Weighing in at 30 pounds and sporting a slim, collapsible chassis, finding a spot for it on the bus or under your desk won’t be a problem. With a customizable max speed of 7, 12, or 20 miles per hour,  and a running distance of 10 to 20 miles per charge; this scooter will get you where you need to go quickly and reliably. With its included safe-start throttle, three stage braking, LED lights, and mounts for your gadgets; Ecoreco’s S5 is a great choice for anyone looking to hack their commute without breaking the bank.</p>",
            "<p style=\"text-align: center;\"><strong>Buy one now from:</strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://ecorecoscooter.com/product/s5/\" target=\"_blank\" rel=\"noopener\">Ecoreco</a></p>"
        ]
    },
    {
        "title": "\n\t\tLight Phone 2 adds texting to the phone that’s not meant to be used\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>The phone that isn’t meant to be used is back, with a crowdfunding campaign for the Light Phone 2, which adds texting and some other proposed features to the ultra-minimalistic phone range.</p>",
            "<p>If you have a problem disconnecting from your smartphone, then it’s possible you followed the <a href=\"https://www.digitaltrends.com/mobile/light-phone-the-handset-designed-to-be-used-as-little-as-possible/\">Light Phone’s crowdfunding campaign</a> last year. <a href=\"https://www.thelightphone.com/home\">The Light Phone</a>, a simple credit card-sized block, was intended to allow users to disconnect from the rapidly interconnected networks woven into life, and focus on the world around them instead. To facilitate that, the Light Phone was meant to replace your phone during holidays, hiking trips, or whenever you needed to disconnect, and live with no internet connection, texting, or anything outside of a simple phone and options for quick dialling.</p>",
            "<p>Now Light, the company behind the Light Phone, wants to introduce a second, slightly more advanced model. The Light Phone 2 will expand slightly on the original phone, adding an e-ink touchscreen, texting, an alarm, and an auto-reply function.</p>",
            "<p>Doesn’t adding extra features take away from the minimalistic idea of the original Light Phone? Apparently not. According to the creators, the Light Phone 2 aims to increase what users can do with the phone, while still keeping them safely sheltered away from major social media, the news, and other such distractions that can draw people in. In Light’s eyes, being able to text your friends or wake up on time doesn’t take away from the original phone’s remit.</p>",
            "<p>In addition to the extra features definitely being added to the Light Phone 2, Light has floated a few prospective ideas for inclusion that will apparently be discussed. These ideas include map navigation, voice commands, ride-sharing, and other options. The phone will run a modified version of Android, and will be built from aluminum. In terms of hardware, it will be powered by 1GB of RAM, 8GB of internal storage, and a Qualcomm MSM8909W processor. The 500mAh battery might seem small, but with these meager specs and an e-ink display it should hopefully be capable of decent battery life.</p>",
            "<p>The original Light Phone was something of a success for Light, with the phone being shipped out to 10,000 users. However, the original phone’s price of entry was high for a phone that barely did anything, at $150. The Light Phone 2 starts at $250 — more expensive than the budget <a href=\"https://www.digitaltrends.com/cell-phone-reviews/honor-7x-review/\">Honor 7X</a> — so it’s expensive even considering the added features. Still, if you’re interested, you can back the phone on the <a href=\"https://www.indiegogo.com/projects/light-phone-2-smartphone-design#/\">IndieGoGo page</a>, though as always, be aware of the <a href=\"https://www.digitaltrends.com/cool-tech/crowdfunding-tips-avoid-scams-kickstarter-indiegogo/\">potential pitfalls of crowdfunding</a>.</p>"
        ]
    },
    {
        "title": "\n\t\tRazer Phone 2 vs. Red Magic Phone vs. Honor Play: Which gaming phone is best?\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p><a href=\"https://www.digitaltrends.com/mobile/best-gaming-phones/\">Gaming phones</a> have gone from being virtually nonexistent to increasingly common in less than a year. With high-powered processors, big screens, and even bigger batteries, there are now more choices than ever if you’re looking for a phone to support your mobile gaming habit.</p>",
            "<p>The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/razer-phone-2-review/\">Razer Phone 2</a> is the latest gaming phone to emerge, but is Razer’s updated monolith good enough to stand atop the pile? We pitted it against the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/red-magic-phone-review/\">Red Magic Phone</a> and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/honor-play-review/\">Honor Play</a> to find out.</p>",
            "<p>Power is important in a gaming phone. After all, what’s the point of a gaming phone if it can’t handle <a href=\"https://www.digitaltrends.com/mobile/best-android-games/\">the latest games</a>? According to benchmarks, the Razer Phone 2’s <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a> is the most powerful processor, followed by the Red Magic Phone’s <a href=\"https://www.qualcomm.com/products/snapdragon/processors/835\">Snapdragon 835</a>, and then the Honor Play’s <a href=\"http://www.hisilicon.com/en/Media-Center/News/Key-Information-About-the-Huawei-Kirin970\">Kirin 970</a>. However, the gap isn’t very telling right now, because each of these phones has more than enough power to keep up with the most demanding modern games.</p>",
            "<p>A large battery is also helpful when playing a lot of games, and each of these phones comes with a large battery that’ll easily last a full day. The Razer Phone 2 comes with the fastest charging, going from 18 percent to 90 percent in just over an hour — and it also comes with Qi wireless charging, which the other two phones lack.</p>",
            "<p>While each of these phones will give you amazing performance on all the latest games, the Razer Phone 2 is the most powerful, with the biggest battery, and the best charging abilities.</p>",
            "<p><strong>Winner: Razer Phone 2<br>\n</strong></p>",
            "<p>Gaming phones are an interesting, at least partly because they don’t conform to the usual beauty standards. The Honor Play is the most normal-looking of the three, with slim bezels, a notch, and vertically stacked lenses — it’s very similar to the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a>. The Red Magic Phone has a similar <a href=\"https://www.digitaltrends.com/mobile/bezel-less-phone-comparison/\">bezel-less design</a>, but it breaks the mold with a prism-shaped back and RGB light strip. The Razer Phone 2 is the most different-looking of the lot, with huge bezels at the top and bottom of the phone that hold its front-facing speakers, an angular design, and the RGB logo on the back.</p>",
            "<p>The Razer Phone 2 has more fragile glass on the back, but it also comes with IP67-rated water resistance. The Red Magic Phone and Honor Play both come with more durable metal bodies, but lack any water-resistance. However, they both have headphone jacks, which the Razer Phone 2 lacks.</p>",
            "<p>It’s tougher than usual to judge this category, but we figure you might be looking for something more unique-looking if you’re interested in these phones. The Razer Phone 2’s bezels may be large, but the speakers are worth the sacrifice, and it has an angular beauty all its own.</p>",
            "<p><strong>Winner: Razer Phone 2<br>\n</strong></p>",
            "<p>You’ll find large LCD displays on each of these phones. The Honor Play’s 6.3-inch display is the largest, followed by the Red Magic’s 6-inch display, and then the Razer Phone 2’s 5.72-inch display. The Razer Phone 2 is the only display to run a 1440p resolution, while the other two top out at 1080p — making Razer’s display significantly sharper.</p>",
            "<p>But that’s not the only trick up the Razer Phone 2’s sleeve. It has a 120Hz Ultramotion display, meaning it refreshes twice as fast as most other phones. While that may not sound impressive, the smoothness it produces has to be seen to be believed. As a result, the Razer Phone 2 feels super-smooth, even during day-to-day tasks — and it’s a huge boost to mobile gaming. While the other two phones have great displays, the Razer Phone 2’s display is truly special.</p>",
            "<p><strong>Winner: Razer Phone 2<br>\n</strong></p>",
            "<p>The camera was one of the original <a href=\"https://www.digitaltrends.com/cell-phone-reviews/razer-phone-review/\">Razor Phone</a>‘s major negatives, so we were excited when Razer told us it had completely revamped the Razer Phone 2’s camera. Unfortunately, while it’s definitely improved, the Razer Phone 2’s dual 12-megapixel lenses are still a disappointment. The Red Magic Phone suffers a similar fate, with the 24-megapixel single lens not delivering great results in lower lighting.</p>",
            "<p>So, it’s no surprise that the Honor Play runs away with this category. While it’s clear that the 24-megapixel and 2-megapixel lens weren’t ever meant to challenge heavyweights like the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Galaxy Note 9</a> or <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-review/\">iPhone XS</a>, the Play offers a fully featured camera that produces shots you won’t be ashamed to share. It’s even got Huawei’s scene-recognition A.I. to back up the camera’s great performance.</p>",
            "<p>The Razer Phone 2 has definitely improved, but the improvements just aren’t enough to take it up to the Honor Play’s level.</p>",
            "<p><strong>Winner: Honor Play<br>\n</strong></p>",
            "<p>You’ll find <a href=\"https://www.digitaltrends.com/mobile/android-o-news/\">Android Oreo</a> on each of these phones, but each with a slightly different spin. The Red Magic Phone runs close to <a href=\"https://www.digitaltrends.com/mobile/what-is-stock-android/\">stock Android</a>, with a few additions that control the RGB light strip, and some game-boosting features — but otherwise it’s pure Android. The Razer Phone 2 is similar, and uses <a href=\"https://www.digitaltrends.com/mobile/how-to-use-nova-launcher/\">Nova Launcher</a> to provide an amazingly customizable experience. The Honor Play is the most different from stock Android, and uses Huawei’s <a href=\"https://consumer.huawei.com/en/emui/emui-8/\">EMUI 8</a> skin. It’s not a bad UI, but it’s certainly different from what most Android phone owners are used to.</p>",
            "<p>In terms of updates ,you’ll find a mixed bag. You may assume Honor would be the slowest at getting updates out, but with the debut of <a href=\"https://consumer.huawei.com/en/emui/\">EMUI 9</a> on <a href=\"https://www.digitaltrends.com/mobile/huawei-mate20-news/\">Huawei’s Mate 20 series</a>, you can probably expect <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">Android 9.0 Pie</a> on the Honor Play fairly soon. The first Razer Phone saw a fairly <a href=\"https://www.digitaltrends.com/mobile/android-oreo-when-do-you-get-it/\">quick update to Android 8.0 Oreo</a> as well, so we expect to see the Razer Phone 2 get updated to the latest Android in the not-too-distant future. Unfortunately, while the Red Magic has been promised an update to Pie, no date has been given.</p>",
            "<p>It’s between the Razer Phone 2 and Honor Play for sheer speed of updates.</p>",
            "<p><strong>Winners: Razer Phone 2 and Honor Play<br>\n</strong></p>",
            "<p>You won’t find many special features on the Razer Phone 2. There’s the 120Hz display and an app to help you find supported games, but apart from that, you’ll have to be happy with just getting some options to control when and how the RGB logo flashes. It’s a similar situation with the Red Magic Phone, which comes with the Gameboost Mode and controls for the RGB light strip, but precious little else.</p>",
            "<p>The Honor Play is the standout choice here. It has <a href=\"https://www.digitaltrends.com/mobile/huawei-honor-gpu-turbo-news/\">GPU Turbo</a> to keep up with the competition, but also comes with A.I. that boosts the camera and sorts your gallery, the Smart Shock feature that matches device vibration to your game, and facial unlocking. The Honor Play just has more to offer than the other two phones.</p>",
            "<p><strong>Winner: Honor Play<br>\n</strong></p>",
            "<p>The Razer Phone 2 starts from $800 for 64GB of storage and 8GB of RAM. The Red Magic Phone only costs $520, but still is not available in the U.S., despite launching in Europe and the U.K. The Honor Play is the cheapest, costing just 330 euros (roughly $380), but it also hasn’t been launched in the U.S. yet. None of these phones will work fully with Verizon or Sprint, so you’ll need to be on T-Mobile or AT&amp;T, though the Razer Phone 2 does have the right LTE bands for Verizon.</p>",
            "<p>It’s not perfect by any means — once again the camera is the weak point — but the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/razer-phone-2-review/\">Razer Phone 2</a> is the best dedicated gaming phone. With a super-smooth 120Hz display and the powerful Snapdragon 845, it’ll run whatever you want and look and sound amazing.</p>",
            "<p>If you’re looking to game without spending $800, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/honor-play-review/\">Honor Play</a> is an excellent choice that offers great value for your money. It’s powerful, has a decent display, and even has a great camera thrown into the bargain — but you will need to import it. It’s harder to recommend the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/red-magic-phone-review/\">Red Magic Phone</a>, which sits between the two other phones in price (and perilously close to the excellent <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6-review/\">OnePlus 6</a>) — but it’s still a great performer with a truly unique style. Overall, though, the Razer Phone 2 has regained the throne — for now.</p>"
        ]
    }
]