[
{"title": "\n\t\tGoodbye, Essential? Android creator’s startup cuts nearly a third of its staff\t", "author": ["\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"], "text": ["<p>Essential, the company founded by Android creator Andy Rubin and known for last year’s Essential Phone, is going through tough times. Just a few days ago news broke that the company was <a href=\"https://www.digitaltrends.com/mobile/essential-phone-2-news/\">working on an artificial intelligence-powered smartphone</a> that mimics its user, but now, Essential announced it cut around 30 percent of its staff.</p>", "<p>The news isn’t all that surprising. A year and a half after the release of the original Essential Phone, we have yet to see any more major releases from the company. In fact, the company canceled a second Essential Phone and paused development on a new smart speaker, hinting the company had not panned out the way Rubin might have liked.</p>", "<p>News also broke earlier in the year suggesting that Essential was looking to sell the company. That hasn’t happened just yet, but it’s clearly still a possibility. According to a <a href=\"https://www.bloomberg.com/news/articles/2018-10-17/andy-rubin-s-startup-essential-products-cuts-about-30-of-staff\" target=\"_blank\" rel=\"noopener\">report from Bloomberg</a>, the cuts were primarily made in the hardware and sales divisions of Essential.</p>", "<p>“This has been a difficult decision to make. We are very sorry for the impact on our colleagues who are leaving the company and are doing everything we can to help them with their future careers,” an Essential spokesperson said in an email to Bloomberg. “We are confident that our sharpened product focus will help us deliver a truly game-changing consumer product.”</p>", "<p>Given the recent news that Essential was working on a new device, the future of the company is very unclear. It seems as though the company could be planning to show off an early prototype of the new device to industry partners at the Consumer Electronics Show in January in Las Vegas, with a release to consumers at some point later in 2019. The device will reportedly feature a small screen and aim to learn its user’s habits so that it can mimic them by doing things like texting back friends for the user. According to reports, the device will mostly be used through voice controls. If that device doesn’t sell — there’s no guarantee that it will — it may well be one of the last devices we ever see from Essential.</p>"]},
{"title": "\n\t\tPatent hints that Essential’s vision for the future could extend to AR glasses\t", "author": ["\n\t\t\t\t\t\tAdam Ismail\t\t\t\t\t"], "text": ["<p><figure><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"https://icdn2.digitaltrends.com/image/essential_phone_camera_3-720x720.png?ver=1.jpg\" onerror=\"dti_load_error(this)\" class=\"attachment-large size-large wp-image-1190119 dt-lazy-load dt-lazy-pending\" alt=\"essential ar glasses patent phone camera 3\"></figure>Essential has big plans for the future, and they don’t end with its recently revealed <a href=\"https://www.digitaltrends.com/mobile/essential-phone-news/\">PH-1 smartphone</a>, 360-degree camera, and Home smart speaker. Patents unearthed by <a href=\"http://www.patentlyapple.com/patently-apple/2017/05/the-day-after-the-essential-phone-unveiling-we-take-a-peek-at-their-patents-and-a-possible-future-project.html\" target=\"_blank\" rel=\"noopener noreferrer\">Patently Apple</a> show the startup’s phone plans in full, right down to the device’s magnetic pins that support modular components. They also reveal that Andy Rubin, hailed as the “Father of Android” and now CEO of Essential, could be itching to pick up where Google Glass left off.</p>", "<p>The glasses shown in Essential’s patent look much more like conventional frames than the design Google ultimately ran with. The display is embedded into the lenses, alongside multiple cameras. One faces the user to track their eyes, and the other looks outward to identify objects in the environment. When the latter camera recognizes something it its view, the glasses can present augmented reality overlays relevant to the subject.</p>", "<p>With augmented reality becoming the next great frontier for software developers and hardware producers alike, it’s not totally surprising to learn that Essential has an interest in the space. The company isn’t rushing to the market in its infancy, however. Patents are no guarantee of future retail products, and Rubin and company have even publicly admitted that their phone — which can currently be ordered ahead of  its release later in June — is not meant to equal Apple’s iPhone or Samsung’s Galaxy in terms of sales volume.</p>", "<p>“We’ve gone after technologies and methods of manufacturing that aren’t designed to support 50 million devices,” Jason Keats, the company’s head of product architecture, told Wired in an interview. “We’re not for everybody. You know it’s going to be a little exclusive.”</p>", "<p>So Essential is looking to expand slowly, and you likely won’t see its augmented reality plans bear fruit for some time. However, it’s also poised to expand in multiple directions. Those two little pins on the back of the PH-1 are there to further the phone’s capabilities in ways the company probably hasn’t even fully considered yet. Add that to the development of a Home hub meant to connect a network of disparate devices and Rubin’s creation of Playground, a startup accelerator firm, and it’s clear Essential’s vision doesn’t stop at what we learned this week.</p>", "<p>Whether it will include these glasses is anyone’s guess.</p>"]},
{"title": "\n\t\tBest Essential Phone cases to protect your edge-to-edge display\t", "author": ["\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"], "text": ["<p><figure id=\"attachment_1269721\" class=\"wp-caption alignnone\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"https://icdn4.digitaltrends.com/image/essential_phone-720x720.jpg\" onerror=\"dti_load_error(this)\" class=\"attachment-large size-large wp-image-1269721 dt-lazy-load dt-lazy-pending\" alt=\"Best Essential Phone cases\"><figcaption class=\"wp-caption-text\"><span></span> <span class=\"credit\">Julian Chokkattu / Digital Trends</span></figcaption></figure>One of the pioneers of the <a href=\"https://www.digitaltrends.com/mobile/bezel-less-phone-comparison/\">bezel-less trend</a>, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/essential-phone-review/\">Essential Phone</a> impressed us when it landed in the summer. The edge-to-edge display is stunning, it performs well, and we like pure Android, but there were some teething troubles. Now that the <a href=\"https://www.digitaltrends.com/mobile/essential-phone-news/\">price has dropped</a>, and the camera has been updated, it’s a more tempting prospect than ever.</p>", "<p>If you do buy one, then you’ll want to consider snagging one of the best Essential Phone cases to protect it. Sadly, that may be easier said than done, because case manufacturers haven’t exactly rushed to market with a bevy of great cases to choose from. We’ve been keeping a close eye on the case scene and there are now three options worth checking out.</p>", "<p>Easily our top pick, the NGP Pure case from <a href=\"https://www.incipio.com/\" target=\"_blank\" rel=\"noopener\">Incipio</a> is a soft, flexible shell that stands up well to everyday knocks and tumbles. It’s made from a special polymer blend that offers real durability without adding too much bulk. You can expect reliable drop protection up to 3 feet, ideal for your typical hand height drop. It’s a perfect fit with generous cut-outs for easy camera and fingerprint sensor access on the back and port access on the bottom. Well-defined button covers and a protective lip around the screen complete this reliable case. You can get a clear variety or one with a darker smoke finish.</p>", "<p style=\"text-align: center;\"><strong></strong></p>", "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/96d77a648e2b05e764d13f283d572d15641617a1/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a> <a href=\"https://www.digitaltrends.com/go/b728c77645b3a9cf7030e050336ebf6f4f551c18/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Incipio\">Incipio</a></p>", "<p>Purveyors of unfussy <a href=\"https://en.wikipedia.org/wiki/Thermoplastic_polyurethane\" target=\"_blank\" rel=\"noopener\">TPU</a> cases for basic protection, Tudia manufactures an enormous number of cases every year. This one is a flexible shell with a special design to enhance your grip. There are a couple of mock carbon fiber panels on the back to spice up the look. You’ll find openings for all the essentials on your Essential Phone and decent tactile button covers. It’s slim, so drop protection is limited, but there is a raised lip to protect your gorgeous display. It comes in black, gray, or navy blue.</p>", "<p style=\"text-align: center;\"><strong></strong></p>", "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/74221788fb4c42c0a5287de333c2d26d5bc5f962/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>", "<p>This Essential Phone case brings something a little different to the table. It’s still fashioned from TPU, but it has a crystal-clear back panel and a metallic finish to the bumper. You’ll also find metallic highlights around the accurate cut-outs for the camera and fingerprint sensor on the back. The fit is good, and it shows off the <a href=\"https://www.essential.com/\" target=\"_blank\" rel=\"noopener\">Essential Phone</a> well, but we think drop protection is going to be pretty minimal. However, it does also have a protective raised lip around the screen to prevent it touching down on surfaces.</p>", "<p style=\"text-align: center;\"><strong></strong></p>", "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/ec4dcf7af4c1d1b665625b62170fdef38ee2949f/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Viva Madrid America\">Viva Madrid America</a></p>", "<p>We’re not big fans of universal cases, but if you’re willing to settle for a wallet or pouch, then you can check out <a href=\"https://www.digitaltrends.com/go/2c21a9b93ad7e3a9a897d7258bb98814d20592a4/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Mobile Fun\">Mobile Fun</a> for some options. You may also notice there’s an <a href=\"https://www.digitaltrends.com/go/2a72ae05685aaf88a3986c60b9c80043fd805537/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Mobile Fun\">Olixar Ultra-Thin case</a> in the works. Currently available for pre-order, it’s a slim, clear option for basic protection that costs just $7. We’ll keep you posted if we discover any more Essential Phone cases.</p>"]},
{"title": "\n\t\t10 Home Office Essentials\t", "author": ["\n\t\t\t\t\t\tAndrew Beehler\t\t\t\t\t"], "text": ["<p>More and more people are working from home: some telecommute for their paid job, some own their own home-based businesses and some use their home offices as super-charged productivity hubs for all  their jobs, clients, paid hobbies and more. The one thing all home offices have in common is that they should all be geared up and streamlined for distraction-free, enjoyable productivity. We’ve  got a quick list of some essential tech items that can help you work smarter, not just harder. Some of these items may even save you a bunch of money.</p>", "<p><strong>1. All-in-One or Multifunction Machine</strong><br>\n In the not-so-distant past, home offices typically had a veritable flotilla of devices to help keep things running – a printer, a scanner, a copier and a fax machine. Thank the geek gods for  constantly improving technology, because all those old devices fit into one slim, high tech machine. All-in-One units have high quality color printers, high-resolution scanners, copy functions and  can even fax when plugged into a phone line. If you don’t have a dedicated land-line for faxing, just scan a document and fax it for free using <a href=\"http://www.faxzero.com\">faxzero.com</a>. An  All-in-One is essential because it does so much and takes up so little space. You’ll also save a lot on your electricity bills by dropping from four power-hungry devices to one.</p>", "<p><strong>Some popular All-in-One units:</strong></p>", "<p>A) <a href=\"http://www.newegg.com/Product/Product.aspx?Item=N82E16828104515\">HP Photosmart C6180 <br>\n</a>B) <a href=\"http://www.amazon.com/Brother-DCP-7020-Digital-Copier-Printer/dp/B0007PF7GU?tag=digitren08-some-20\">Brother DCP-7020</a> <br>\n C) <a href=\"http://www.newegg.com/Product/Product.aspx?Item=N82E16828104049\">HP LaserJet 3055</a></p>", "<p><strong>2. Laptop Computer</strong><br>\n Laptop computers are often preferred for home-office use because they allow work to be done from more than one static location in the home. They can be moved from desk to desk, out of the office  and onto the porch, and even on the road if ever necessary. Should you get a little stir-crazy from working from the same location all the time, a quick trip to a coffee house with wireless  internet can work wonders for clearing cobwebs, sparking new ideas and reminding you that you’re still part of a social society. You just can’t get that freedom with a desktop computer. Laptops use  much less power than desktops, so you could see an almost instant drop in power consumption.</p>", "<p><strong>Some popular laptops:</strong></p>", "<p>A) <a href=\"http://www.apple.com/macbook\">MacBook</a> <br>\n B) <a href=\"http://reviews.digitaltrends.com/review4745.html\">Lenovo ThinkPad T61p <br>\n</a>C) <a href=\"http://reviews.digitaltrends.com/review4671.html\">HP Pavilion HDX </a></p>", "<p><strong>3. External Hard Drive</strong><br>\n If you value any of the data on your computer, you need to keep it backed up in some way or another. If you have lots of data to protect (images, spreadsheets, business plans, computer code,  emails, etc.), you’ll want a very reliable external hard drive. Storing duplicates of your files on an external drive saves you untold grief should your main computer ever fail or go missing.  Always buy a hard drive that can hold more data than you think you’ll need. You can often get drives with 200% more storage room for only 10% to 20% higher prices than base models. Excellent value,  brilliant security solution.</p>", "<p><strong>Some popular external hard drives:</strong></p>", "<p>A) <a href=\"http://reviews.digitaltrends.com/review4795.html\">Maxtor OneTouch 4 Mini</a> – small, fast and easy <br>\n B) <a href=\"http://reviews.digitaltrends.com/review4818.html\">LaCie 2big Triple RAID</a> – for super safe, hardcore backups <br>\n C) <a href=\"http://www.lacie.com/us/products/product.htm?pid=10894\">LaCie d2 quadra</a></p>", "<p><strong>4. Spacious LCD Screen</strong><br>\n If you’re one of the few people still using a bulky CRT monitor in your home office, please, please, please do yourself and the environment a favor by upgrading to a new LCD monitor. New LCD  screens offer stunning visual quality, low power consumption and, best of all, widescreen LCDs can enhance productivity. Even if you’re using a laptop, you can benefit immensely from the  productivity boost an external LCD monitor can provide. It essentially doubles your work space, allowing you to multitask like mad, all without having to switch back and forth between super tiny  windows. Prices are right for any budget, too.</p>", "<p><strong>Some popular LCD screens:</strong> <br>\n A) <a href=\"http://reviews.digitaltrends.com/review4452.html\">HP w2007 20″ widescreen LCD</a> <br>\n B) <a href=\"http://www.newegg.com/Product/Product.aspx?Item=N82E16824001096\">Samsung 226BW 22″ widescreen LCD <br>\n</a>C) <a href=\"http://reviews.digitaltrends.com/review4799.html\">HP  w2408 24″ widescreen LCD</a></p>", "<p><strong>5. Speaker System<br>\n</strong> Unless you’re hearing impaired or suffer from terribly low attention span, one of the most enjoyable productivity boosters can be background music. Whether  it’s a little Tony Bennett playing softly over the air waves, or trip-hop cranked up loud enough to drown out air raid sirens, music is both aesthetic and therapeutic. Luckily, high quality speaker  systems are very affordable and can play directly from your computer or MP3 player. Desktop systems, shelf systems and even floor-based systems can be found online and in retail stores everywhere.  Speaker sets may not save you any money, but the music they play can inspire you to do more.</p>", "<p><strong>Some popular speaker systems:</strong> <br>\n A) <a href=\"http://reviews.digitaltrends.com/review4840.html\">mStation 2.1 Stereo Tower</a> <br>\n B) <a href=\"http://reviews.digitaltrends.com/review3906.html\">Audioengine A5</a> <br>\n C) <a href=\"http://reviews.digitaltrends.com/review4447.html\">XtremeMac Tango</a></p>", "<p><strong>6. Comfortable Keyboard</strong><br>\n Whether you’re using a desktop or laptop computer, the wrong keyboard can wreak havoc on your work flow and can prematurely tire your hands and fingers. Bad keyboards contribute to typos,  hand/wrist strain and, quite often, excessively loud key noise that can drive some people batty. Find a new keyboard that has smooth keying action that feels good under the tips of your fingers.  Ergonomic keyboards can help reduce and/or prevent strain. Most high-quality keyboards have wireless versions, helping you keep your desk clutter free.</p>", "<p><strong>Some popular keyboards:</strong> <br>\n A) <a href=\"http://www.amazon.com/dp/B000A6QSLE?tag=digitren-20&amp;camp=0&amp;creative=0&amp;linkCode=as1&amp;creativeASIN=B000A6QSLE&amp;adid=0PV7BVKC4RWYQ0Y0CHMK&amp;=\">Microsoft Natural  Ergonomic Keyboard 4000</a> <br>\n B) <a href=\"http://www.amazon.com/dp/B000AY5ZIS?tag=digitren-20&amp;camp=0&amp;creative=0&amp;linkCode=as1&amp;creativeASIN=B000AY5ZIS&amp;adid=1GNX16P16WM1YCTSVMEG&amp;=\">Logitech Cordless Desktop  MX 5000 Laser</a> (Keyboard/Mouse Combo)<br>\n C) <a href=\"http://www.amazon.com/dp/B000E204LY?tag=digitren-20&amp;camp=0&amp;creative=0&amp;linkCode=as1&amp;creativeASIN=B000E204LY&amp;adid=059QFSTA9P4RXTAABXYA&amp;=\">Cordless Desktop S 530  Laser for Mac</a> (Keyboard/Mouse Combo)</p>", "<p><strong>7. Better Mouse</strong><br>\n Old style mice with the rubber ball underneath are notoriously bad when it comes to accurate mouse movements. No matter how clean you or your work space may be, gunk inevitably builds up, causing  herky jerky, uncontrollable mouse action. They’re also prime gathering places for nasty germs. An optical or laser mouse will work beautifully on most surfaces, and you can even ditch the nasty  mouse pad. Some mice are made with comfortable ergonomic designs, making them very pleasant to use for long periods of time. Wireless mice (whether Bluetooth or RF) are great for keeping desks  clean and tidy.</p>", "<p>Some popular mice: <br>\n A) <a href=\"http://www.amazon.com/dp/B000CRGCSK?tag=digitren-20&amp;camp=0&amp;creative=0&amp;linkCode=as1&amp;creativeASIN=B000CRGCSK&amp;adid=0TGX1D3B76CFK694TVYD&amp;=\">Microsoft Wireless Optical  Mouse 4.0 Mass Steel Blue<br>\n</a>B) <a href=\"http://www.amazon.com/dp/B000H5DF32?tag=digitren-20&amp;camp=0&amp;creative=0&amp;linkCode=as1&amp;creativeASIN=B000H5DF32&amp;adid=0YCMYXZCZKNSBYNZF6M2&amp;=\">Logitech MX400 Performance Laser  Mouse</a><br>\n C) <a href=\"http://www.amazon.com/dp/B000EXRSWG?tag=digitren-20&amp;camp=0&amp;creative=0&amp;linkCode=as1&amp;creativeASIN=B000EXRSWG&amp;adid=1C26YVNA21TF9PSA7FQV&amp;=\">Logitech MX610 Left-Hand  Laser Cordless Mouse</a></p>", "<p><strong>8. Cell Phone &amp; VoIP Headsets</strong><br>\n In a work environment, cell phone headsets can be invaluable. Whether corded or wireless, headsets allow extra mobility, eliminate kinked-neck syndrome and add freedom for both hands to work on  other things. Bluetooth headsets allow you to freely walk around the office environment, up to 30 feet from the phone itself. Most Bluetooth headsets (and many corded headsets) also work well with  VoIP applications like Skype, iChat, etc.</p>", "<p>Some popular headsets: <br>\n A) <a href=\"http://reviews.digitaltrends.com/review4678.html\">Plantronics Voyager 520</a> (for cell phones &amp; computers) <br>\n B) <a href=\"http://reviews.digitaltrends.com/review4374.html\">Aliph Jawbone</a> (for cell phones &amp; computers) <br>\n C) <a href=\"http://reviews.digitaltrends.com/review4389.html\">Plantronics .Audio 550 DSP</a> (for cell phones &amp; VoIP applications)</p>", "<p><strong>9. VoIP Phone Service</strong><br>\n Standard land-lines, though old-school, are commonly used for home office phone service. Many home-based entrepreneurs and remote employees use cell phones, especially if they need to be mobile on  a regular basis. Another fantastic option – often free or incredibly inexpensive – is to use an already-existing high speed Internet connection for VoIP – also known as Voice over Internet  Protocol, or internet telephony. Think <a href=\"http://www.skype.com\">Skype</a> and <a href=\"http://www.vonage.com\">Vonage</a>. These services can save tens, hundreds and even thousands of dollars  on long distance and long-duration calls. Skype offers a $30/year USD plan called “Skype Unlimited” which allows you to place any number of calls from your computer to any US telephone  number for only $30 USD per year. You can talk 24/7/365 and not pay a penny more than $30. Inbound calls to your special Skype phone number, however, cost about $60 USD per year – still, very  inexpensive. Vonage has personal and business plans that allow you to use any standard phone connected to a little router than ties into your high-speed Internet service. “Residential Premium  Unlimited” costs $25 USD per month and “Small Business Premium Unlimited” (with a phone number AND fax number) costs $50 USD per month. That’s a major savings over land-line costs.  Both Skype and Vonage offer voicemail services.</p>", "<p><strong>10. Charging Station</strong><br>\n Along with all the gadgets sprawled all over the average home office desk, there are inevitably an equal number of charging blocks and cords connected to said gadgetry. Virtually eliminate the mess  by getting a super charging hub like the “<a href=\"http://callpod.com/products/chargepod\">Callpod Chargepod</a>“. The Chargepod can simultaneously charge up to six gadgets and only uses  one wall outlet. It’s a fantastic space saver in the home office, and works wonders for simplifying business and personal travel and lightening the bags you may carry.</p>"]},
{"title": "\n\t\tEssential Phone vs Apple iPhone 7 Plus: Can the Android newcomer take out Apple?\t", "author": ["\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"], "text": ["<p><figure id=\"attachment_1229785\" class=\"wp-caption alignnone\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"https://icdn4.digitaltrends.com/image/essential-ph-1-phone-720x720.jpg\" onerror=\"dti_load_error(this)\" class=\"attachment-large size-large wp-image-1229785 dt-lazy-load dt-lazy-pending\" alt=\"Essential PH-1 phone reviews\"><figcaption class=\"wp-caption-text\"><span></span> <span class=\"credit\"><a href=\"https://www.facebook.com/thisisessential/\" rel=\"nofollow\">Essential</a></span></figcaption></figure>The long-awaited and super interesting <a href=\"https://www.digitaltrends.com/mobile/essential-phone-news/\">Essential Phone (PH-1)</a> is finally here, and customers who pre-ordered the device should expect to finally get their hands on it in the next few days. The PH-1 has captured the imaginations of many thanks to its full edge-to-edge display and classy design — a design Apple is expected to follow for the <a href=\"https://www.digitaltrends.com/mobile/apple-iphone-x-news/\">upcoming iPhone</a>.</p>", "<p>The <a href=\"https://www.essential.com/\" target=\"_blank\" rel=\"noopener\">Essential PH-1</a> isn’t the only great phone around. While Apple may use similar design elements for its next phone, the company still has a capable phone already on the market: The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-7-plus-review/\">iPhone 7 Plus</a>. But just how do the two phones compare? We put them head to head to find out.</p>", "<p>The Essential Phone makes use of the latest and greatest Qualcomm Snapdragon 835 processor, and it’s coupled with 4GB of RAM. The iPhone 7 Plus, on the other hand, uses Apple’s self-designed A10 Fusion chip, along with 3GB of RAM.</p>", "<p>Apple’s processor is incredibly powerful, and iOS doesn’t require a lot of RAM compared to Android — it’s just a difference between the two operating systems. The iPhone 7 Plus will prove to be an extremely smooth device. In fact, when it comes to benchmarks, the Essential PH-1 <a href=\"https://www.pcmag.com/review/355633/essential-phone-ph-1\" target=\"_blank\" rel=\"noopener\">scored</a> 161,746 on AnTuTu, while the Apple iPhone 7 Plus scored a hefty 181,807 — putting the Essential PH-1 to shame. That’s not to say you shouldn’t get the Essential PH-1. It has the same processor as phones like the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s8-review/\">Samsung Galaxy S8</a> and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u11-review/\">HTC U11</a>. It’s a high-performing phone, and will last you at least a few years of use. Benchmarks aren’t the best indicator of real-world use.</p>", "<p>If you’re looking for a lot of storage, both phones have a lot to offer. Neither have a MicroSD card slot, but the iPhone 7 Plus has options for 32GB, 128GB, and 256GB of storage, while the Essential Phone comes only with 128GB of storage.</p>", "<p>Both of these phones will perform well, but the iPhone 7 Plus is technically the better performer.</p>", "<p><strong>Winner: Apple iPhone 7 Plus</strong></p>", "<p>Both of these phones feature beautiful designs, but in very different ways.</p>", "<p>For starters, the Essential PH-1 boasts a beautiful 5.71-inch edge-to-edge display, which covers almost the entire front of the phone save for a small notch at the top and a chin at the bottom. The back of the phone is shiny and minimal. You’ll find a fingerprint sensor here, below a dual-camera module and a few other sensors.</p>", "<p>The iPhone 7 Plus is also well-designed, though a little less groundbreaking than the Essential Phone. On the front, the 5.5-inch display sits above Apple’s Touch ID fingerprint sensor and home button. The design does look a little dated thanks to the chunky edges surrounding the screen. The rear is minimal like the Essential Phone, with the iconic Apple logo and a dual-camera module above.</p>", "<p>Things are a little different when it comes to the display — the Essential Phone is the clear winner. Despite an LCD screen, you get a 2,560 x 1,312 pixel resolution, which is quite a bit more than the 1,920 x 1,080 pixel resolution on the Apple iPhone 7 Plus. You also get more screen in a smaller, lighter package with the Essential Phone.</p>", "<p>But the iPhone takes the crown for durability, as it has a waterproof rating of IP67, meaning you can take it up to 1 meter underwater for 30 minutes. The Essential Phone isn’t waterproof.</p>", "<p>Still, the Essential Phone features a more modern design, along with a higher resolution display. It takes the win here.</p>", "<p><strong>Winner: Essential PH-1</strong></p>", "<p>The battery on the iPhone 7 Plus sits in at 2,900mAh, while the Essential PH-1 offers a 3,040mAh battery. That doesn’t necessarily mean that the PH-1 will last longer — the device has a much higher-resolution display, which means that it will be much more taxing on the battery. Still, early <a href=\"https://www.digitaltrends.com/mobile/essential-phone-reviews-roundup/\">reviews</a> suggest the PH-1 has pretty decent battery life. We’ll do more testing to confirm.</p>", "<p>While the Essential Phone offers fast-charging, the Apple iPhone 7 Plus does not. Because of that, at least on paper, the Essential PH-1 is the winner here.</p>", "<p><strong>Winner: Essential PH-1</strong></p>", "<p>The two phones have dual-camera setups, but they have slightly different specifications. The iPhone 7 Plus offers a dual 12-megapixel sensor with an f/1.8 aperture and optical image stabilization on the primary lens, and the PH-1 has a dual 13-megapixel sensor with an f/1.9 aperture.</p>", "<p>Apple has long been known for offering an excellent camera on its devices, and the iPhone 7 Plus is no different. In <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-7-plus-review/\">our review</a>, we hailed the dual-camera setup especially the benefit of having a 2x optical zoom. Apple also introduced Portrait Mode a few months later via a software update, and it offers DSLR-like quality portrait images.</p>", "<p>Some early reviews suggest the Essential PH-1’s camera could be just as good. The device’s dual-cameras feature a monochrome and a color sensor. The camera doesn’t feature some of the dual-sensor features found on the iPhone, like Portrait Mode or HDR.</p>", "<p>The iPhone’s camera is tried and true. While some early reviews say that the PH-1’s camera is great, <a href=\"https://www.wired.com/2017/08/review-essential-phone/\" target=\"_blank\" rel=\"noopener\">others</a> don’t quite agree.</p>", "<p><strong>Winner: Apple iPhone 7 Plus</strong></p>", "<p>Before we talk about software, we’ll say one thing — we’re not going to award a winner here. The <a href=\"https://www.digitaltrends.com/mobile/best-smartphone-os/\">Android vs iPhone</a> debate is a long-running one, and everyone has their own preference.</p>", "<p>Still, we can note some major differences between the two operating systems. Android is generally known to offer more customization, while iOS is easier to use. Essential offers a pure Android experience, similar to what you will find on the Google Pixel. It’s free of bloatware, unlike some Android devices.</p>", "<p><strong>Winner: Tie</strong></p>", "<p>The Essential PH-1 is available for purchase, and you can get your hands on it through the Essential website, <a href=\"https://www.sprint.com/shop/device/essential-phone-preorder-128gb-black-moon?skuId=113100399&amp;duration=18L&amp;contractType=lease&amp;lineId=175448970\" target=\"_blank\" rel=\"noopener\">Sprint</a> or <a href=\"https://www.bestbuy.com/site/essential-essential-phone-4g-lte-with-128gb-memory-cell-phone-unlocked-pure-white/5973001.p?skuId=5973001\" target=\"_blank\" rel=\"noopener\">Best Buy</a>. It doesn’t seem as though other carriers are offering the phone, and there’s no word yet on whether they will or not. We recommend buying the phone unlocked straight from Essential. The device cost $700, which is a premium price to pay for a phone.</p>", "<p>The Apple iPhone 7 Plus is slightly more expensive, though it’s available more widely. It costs $770 for the 32GB version, and you can get it from all four major carriers, unlocked from the <a href=\"https://www.apple.com/shop/buy-iphone/iphone-7\" target=\"_blank\" rel=\"noopener\">Apple website</a>, Amazon, Best Buy, and so on.</p>", "<p><strong>Winner: Essential PH-1</strong></p>", "<p>Both the Essential PH-1 and Apple iPhone 7 Plus are excellent phones, but the Essential’s gorgeous edge-to-edge design and slightly lower price gives it the win here. The iPhone is technically more powerful and seems to offer a slightly better camera, but the PH-1 likely has a better battery and can charge back up quickly.</p>"]},
{"title": "\n\t\tEssential Phone vs. OnePlus 5T: Budget Android flagships go head-to-head\t", "author": ["\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"], "text": ["<p><figure id=\"attachment_1274515\" class=\"wp-caption alignnone\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"https://icdn3.digitaltrends.com/image/oneplus-5t-hands-on-review-home-720x720.jpg\" onerror=\"dti_load_error(this)\" class=\"attachment-large size-large wp-image-1274515 dt-lazy-load dt-lazy-pending\" alt=\"oneplus 5t hands on review home\"><figcaption class=\"wp-caption-text\"><span></span> <span class=\"credit\">Andy Boxall/Digital Trends</span></figcaption></figure>The OnePlus 5T is finally here, boasting top-of-the-line specs at a reasonable price. This time around, OnePlus has made a few big tweaks to the phone’s design, bringing a nice, edge-to-edge display to the device.</p>", "<p>Of course, there are other phones in the price range with an even more edge-to-edge display, like the Essential Phone, which made a splash in the Android world earlier this year, and just recently got a pretty big price cut to $500. That puts it in direct competition with the OnePlus 5T. But which phone is better? We put the two head-to-head to find out.</p>", "<p>Both the Essential Phone and the OnePlus 5T feature Qualcomm’s latest and greatest chip, the <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-835-benchmarks/\">Qualcomm Snapdragon 835</a>, but that’s about where the similarities in specs end. The OnePlus 5T features either 6GB or 8GB of RAM, and either 64GB or 128GB of storage, depending on the model you choose. The Essential Phone, on the other hand, only offers 4GB of RAM and 128GB of storage. Neither of the two devices offer a MicroSD card slot, so you’ll want to get as much storage as you need up front.</p>", "<p>There’s a bit of a trade-off here. The base model of the Essential Phone offers a lot more storage than the base model of the <a href=\"https://www.digitaltrends.com/mobile/oneplus-5t-release-date-price-specs-news/\">OnePlus 5T</a>, but the OnePlus offers more RAM in both situations. Now, for day to day use that probably isn’t going to mean much to you — but it does mean that the OnePlus will get a slight performance boost over the Essential Phone for mulititasking.</p>", "<p>Because of the extra RAM and the fact that you can get just as much storage on the OnePlus 5T, it’s the winner here.</p>", "<p><strong>Winner: OnePlus 5T</strong></p>", "<p>OnePlus has made a few design tweaks for the OnePlus 5T, overall giving it a much more modern look. The design now includes a so-called “edge-to-edge” display, which has also resulted in the fingerprint sensor being moved to the back. It’s a pretty good look, despite the fact that there’s still a forehead and chin on the phone that some may not like. That’s unlike the Essential Phone, which features a true edge-to-edge display. It’s so edge-to-edge, that there’s a small cutout at the top for the phone’s front-facing camera. Like the OnePlus 5T, the Essential Phone does have a fingerprint sensor on the back, along with a dual-sensor camera.</p>", "<p>One major point of difference to keep in mind is the fact that the OnePlus 5T has a headphone jack, while the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/essential-phone-review/\">Essential Phone</a> does not.</p>", "<p>When it comes to the display, the two phones are very different. The Essential Phone features a 5.7-inch LCD display, while the OnePlus 5T’s display comes in at 6-inches and is an AMOLED display. The trade-off, however, is resolution — while the OnePlus 5T’s resolution comes in at 2160 x 1080 pixels, the Essential Phone steps things up to 2560 x 1312 pixels — and the slightly smaller size makes it a much sharper, pixel-dense display.</p>", "<p>Neither of the two phones offer water-resistance of any kind, and you’ll want to be careful to not drop them, as the large screens are likely prone to shattering.</p>", "<p>Because of the more edge-to-edge display and higher resolution, the Essential Phone is the winner here.</p>", "<p><strong>Winner: Essential Phone</strong></p>", "<p>With a higher resolution comes a tax on battery life, and the fact that the Essential Phone has a smaller battery to begin with could well amplify that. The device offers a 3,040mAh battery, while the OnePlus 5T’s battery comes in at 3,300mAh. The OnePlus 5T also has OnePlus’ Dash Charge, which has consistently been rated among the best fast-charging technologies available. The <a href=\"https://www.digitaltrends.com/mobile/essential-phone-news/\">Essential Phone</a> doesn’t offer Qualcomm’s QuickCharge tech, but it can <a href=\"https://www.reddit.com/r/essential/comments/71hcn5/psa_our_phones_are_not_qualcomm_quick_charge/\" target=\"_blank\" rel=\"noopener\">get fast charging</a> through USB-C PowerDelivery, providing you have the right chargers.</p>", "<p>Because of the larger battery and better fast charging tech, the OnePlus 5T is the winner here.</p>", "<p><strong>Winner: OnePlus 5T</strong></p>", "<p>The OnePlus 5T offers a dual 16MP and 20MP camera, with an aperture of f/1.7, phase detection autofocus, and a dual-LED flash. Those are pretty decent specs — but as any photographer would know, specs alone don’t make for great performance. The Essential Phone’s camera, on the other hand, comes in with a dual 13MP sensor with an aperture of f/1.9. It also has both phase and laser detection autofocus, and an LED flash.</p>", "<p>So which camera is better? Well, we’ve extensively reviewed both of these phones, and the OnePlus 5T offers both better photos and an easier camera experience. In our review of the OnePlus 5T, we found that while the camera isn’t on par with the likes of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-review/\">Google Pixel 2</a>, it’s still very good. We found that the Essential Phone’s camera did take decent shots, but still not as good as the OnePlus 5T, and the app was a little frustrating to use too.</p>", "<p><strong>Winner: OnePlus 5T</strong></p>", "<p>Both of these phones offer a pretty stock Android experience, which we see as a good thing. That doesn’t mean it’s totally stock. The OnePlus 5T offers OnePlus’ OxygenOS, which is currently based on Android 7.1.1 Nougat — though an upgrade to Android 8.0 Oreo is on the way. Small tweaks include things like more features in the camera app, and Face Unlock — a feature similar to the iPhone’s Face ID.</p>", "<p>The Essential Phone, on the other hand, offers pretty much stock Android, with only a few tweaks to optimize the display for the notch at the top of the phone. That means that the phone gets pretty quick updates, and in fact recently started its beta for <a href=\"https://www.android.com/versions/oreo-8-0/\" target=\"_blank\" rel=\"noopener\">Android 8.0 Oreo</a>. The OnePlus 5T beta for Oreo will be coming a little later this year.</p>", "<p>Because of the faster updates, the Essential Phone is the winner.</p>", "<p><strong>Winner: Essential Phone</strong></p>", "<p>The phones are in the same price bracket — and they both offer excellent value for money. The Essential Phone has been available for some time now, and can be bought for $500 from <a href=\"https://shop.essential.com/products/phone\" target=\"_blank\" rel=\"noopener\">Essential</a> or from <a href=\"https://www.sprint.com/en/shop/cell-phones/essential-phone.html?ensembleId=ESS2ALBBBLK&amp;credit=A2&amp;contractName=0-yr-lb-18months&amp;deviceQuantity=1&amp;plan=pln10660000prd\" target=\"_blank\" rel=\"noopener\">Sprint</a>.</p>", "<p>The OnePlus 5T is also now available — and the base model costs $500, while the 8GB RAM version comes in at $560. It’s available <a href=\"https://oneplus.net/5t\" target=\"_blank\" rel=\"noopener\">from OnePlus</a>.</p>", "<p>The phones come in at the same price for the base model, so this one’s a tie.</p>", "<p><strong>Winner Tie</strong></p>", "<p>The design and edge-to-edge display on the Essential Phone are nice, but they’re not enough to beat the OnePlus 5T’s better performance, camera, and battery. Those are all major features of a phone, and most people will find them important.</p>", "<p>That doesn’t mean the Essential Phone is a bad choice. In fact, it’s still an excellent option. The difference between these phones is seriously minimal, and if you prefer the design of the Essential Phone and want a higher-resolution display, then it may be the better option for you. For an all-around great phone, however, you’ll want to get the OnePlus 5T.</p>"]},
{"title": "\n\t\tEssential Phone vs. Galaxy S8: Can a newcomer beat the reigning champ?\t", "author": ["\n\t\t\t\t\t\tKyle Wiggers\t\t\t\t\t"], "text": ["<p><figure><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"https://icdn4.digitaltrends.com/image/essential-ph-1-phone-2048x1312-720x720.jpg\" onerror=\"dti_load_error(this)\" class=\"attachment-large size-large wp-image-1229918 dt-lazy-load dt-lazy-pending\" alt=\"essential phone vs. Galaxy S8\"></figure>The <a href=\"https://www.digitaltrends.com/mobile/essential-phone-reviews-roundup/\">Essential Phone</a>, the top-of-the-line smartphone spearheaded by Android creator <a href=\"http://playground.global/team/crew/andy-rubin\" target=\"_blank\" rel=\"noopener\">Andy Rubin</a>, is finally here. It’s got an edge-to-edge screen with a unique cutout around the front camera, a durable titanium frame, and a snap-on accessory system that supports a 360-degree camera module.</p>", "<p>But there’s plenty of competition. The Essential Phone is going up against Samsung’s <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s8-review/\">Galaxy S8</a>, one of the best smartphones on the market. So just how does it fare? Read on for a full Essential Phone vs. Galaxy S8 comparison.</p>", "<p>In terms of raw hardware, the Essential Phone and Galaxy S8 are evenly matched.</p>", "<p>Both phones sport Qualcomm’s octa-core <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-835-benchmarks/\">Snapdragon 835</a> processor paired with 4GB of RAM, but storage is a different story. The Galaxy S8 has 64GB of internal memory and a MicroSD Card slot that can accommodate cards up to 2TB in size, while the Essential Phone comes with 128GB of internal storage and no MicroSD Card slot.</p>", "<p>Essential’s decision to ditch the MicroSD Card slot might upset folks who’ve invested in removable storage, but you get double the base storage from the S8. Plus, it’s rare to find a 128GB smartphone at the Essential’s price point in the U.S., so we’re giving it the win here. If a MicroSD card slot is important to you, then the S8 is for you.</p>", "<p><strong>Winner: Essential Phone</strong></p>", "<p>The Essential Phone has a titanium body that’s shielded with ceramic. The screen, a 5.71-inch LCD with a 19:10 aspect ratio, stretches the entire length of the front, and has distinctive cutout near the top that curves around the selfie camera. There aren’t any physical buttons on the front or back, and just a tiny chin on the bottom.</p>", "<p>The glass-and-metal Galaxy S8 is a lot curvier. Samsung’s Infinity Display tapers off around the phone’s edges, maximizing screen real estate. There aren’t any physical buttons on the front either. The two embrace the bezel-less trend in smartphones, and since design is largely subjective, we’re not awarding a win here.</p>", "<p>But the Galaxy S8 is the more durable of the two on paper. It’s IP68 certified for water- and dust-resistance, which means it can survive a five-foot pool of water for up to half an hour. The Essential Phone isn’t, but in fairness, its titanium frame will likely hold up well against sidewalks and hardwood floors.</p>", "<p>The Galaxy S8 takes the cake in terms of display technology. The Essential Phone’s LCD screen has good viewing angles and brightness, but it doesn’t match the vibrancy of the Galaxy S8’s Super AMOLED. It’s also less sharp: The Essential Phone has a 2,560 x 1,312-pixel resolution, compared to the Galaxy S8’s Quad HD+ 2,960 x 1,440.</p>", "<p><strong>Winner: Galaxy S8</strong></p>", "<p>On paper, there’s not a huge difference between the Galaxy S8 and the Essential Phone in the battery department. The Galaxy S8 has a 3,000mAh battery, and the Essential Phone has a slightly bigger 3,040mAh battery. Both have the same power-efficient Snapdragon processor, but the S8’s screen likely draws a little more power.</p>", "<p>The Essential Phone and Galaxy S8 support different flavors of fast charging. The S8 has Samsung’s Adaptive Fast Charge, which takes about an hour to fully juice. But the Galaxy S8 also supports <a href=\"https://www.digitaltrends.com/mobile/best-wireless-phone-chargers/\">wireless charging</a> (in the Qi and PMA format), which the Essential Phone doesn’t, so we’re giving it the win.</p>", "<p><strong>Winner: Galaxy S8</strong></p>", "<p>The Essential Phone has dual rear cameras on the back, one 13-megapixel monochrome sensor and one 13-megapixel full-color sensor. Custom camera software combines the data to boost color accuracy and improve low-light performance, and Essential says that in a future software update, the phone will gain the ability to shoot in HDR (high-dynamic range) and a DSLR-like bokeh mode (think the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-7-review/\">iPhone 7’s</a> <a href=\"https://www.digitaltrends.com/mobile/apple-ios-10-1-portrait-mode/\">Portrait Mode</a>).</p>", "<p>The S8 makes do with a single 12-megapixel rear camera, but offers a software setting, Selective Focus, that approximates the bokeh effect.</p>", "<p>Samsung’s camera is great, but there’s something to be said for the Essential Phone’s forthcoming features. Selective Focus does a decent job artificially blurring backgrounds most of the time, but capturing true depth of field requires the Essential’s camera hardware.</p>", "<p>When it comes to the front camera, the Essential Phone and Galaxy S8 are neck-and-neck — both have an 8-megapixel selfie cam that can shoot video in 2K.</p>", "<p><strong>Winner:</strong> <strong>Essential Phone</strong></p>", "<p>The Essential Phone and Galaxy S8 both run Android, but the former has a version that’s extremely close to Google’s pure Android. There isn’t much customization to speak of, and it’s pre-loaded with mostly Google apps. It’s about as close as you can get a <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-review/\">Pixel</a> without buying a Pixel.</p>", "<p>The Galaxy S8, on the other hand, runs the latest version of Samsung’s TouchWiz skin. It’s chock full of features like <a href=\"https://www.digitaltrends.com/mobile/how-to-use-bixby/\">Bixby</a>, Samsung’s digital assistant, and Activity Zone, which puts handy utilities like a stopwatch, barometer, compass, and flashlight at your fingertips.</p>", "<p>So which offers the better experience? It’s a matter of personal preference, really. Some people might find the S8’s TouchWiz more obnoxious than helpful, while others find the Essential Phone’s software a little too bare bones. Personally, we’re fans of the latter. The Essential Phone might not have all the S8’s bells and whistles, but it’s not overstuffed with features you’ll never use.</p>", "<p><strong>Winner:</strong> <strong>Essential Phone</strong></p>", "<p>One of the Essential Phone’s biggest draws is its fancy accessory system. On the back of the phone are magnetic pins that snap to modular add-ons like cameras, batteries, and more. It’s like your computer’s USB port, but far more powerful.</p>", "<p>So far, there’s only one accessory available for the Essential Phone: A 360-degree camera. It can capture video in resolutions up to 4K at 30FPS, and weighs just 35 grams. Essential says it will release a new accessory “every few months,” but it remains to be seen whether or not third parties will support it.</p>", "<p>The Galaxy S8 doesn’t have that problem — Samsung’s flagship has an abundance of accessories. One is the <a href=\"https://www.digitaltrends.com/mobile/samsung-dex-first-impressions-review/\">Dex Dock</a>, a hockey puck-like device that transforms the Galaxy S8 into a full-blown desktop. Another is <a href=\"http://www.samsung.com/us/mobile/mobile-accessories/phones/wireless-charging-pad-black-sapphire-ep-pg920ibugus/\" target=\"_blank\" rel=\"noopener\">Samsung’s Wireless Charging Pad</a>, which can rapidly charge the Galaxy S8 in minutes flat. Samsung also has the Gear 360 camera, as well as the Gear VR for mobile virtual reality.</p>", "<p><strong>Winner:</strong> <strong>Galaxy S8</strong></p>", "<p>At $700 for the Essential Phone and $750 for the Galaxy S8, the two phones are pretty close in pricing. But availability is a different story.</p>", "<p>The Essential Phone is only available from <a href=\"https://www.essential.com/\" target=\"_blank\" rel=\"noopener\">Essential’s website</a>, <a href=\"https://www.bestbuy.com/site/essential-essential-phone-4g-lte-with-128gb-memory-cell-phone-unlocked-pure-white/5973001.p?skuId=5973001\" target=\"_blank\" rel=\"noopener\">Best Buy</a>, and one carrier, <a href=\"https://www.sprint.com/en/landings/essential-phone.html\" target=\"_blank\" rel=\"noopener\">Sprint</a>, though Essential says that the phone supports every major carrier in the U.S. Contrast that with the Galaxy S8, which is available from Verizon, AT&amp;T, Sprint, T-Mobile.</p>", "<p>If you order from Essential, for a limited time you can get both the phone and 360-degree camera for $750.</p>", "<p>Sprint’s offering a substantial leasing discount on the Essential Phone too — as long as you don’t mind the black model. Customers pay only $14.58 a month for a year and half, which amounts to a $260 savings. You’ll have to pay the remaining balance on the phone’s $700 if you want to keep it at the end of the lease, though.</p>", "<p>The Essential Phone and Galaxy S8 may share similar internals, but they are two very different devices. The former boasts a durable (albeit not waterproof) titanium design with great cameras, a novel accessory system, and close-to-stock Android software. The latter offers one of the best screens and cameras on the market, Samsung’s TouchWiz software, and a bevy of accessories. It’s a tough choice, and that’s why this contest is a tie.</p>"]},
{"title": "\n\t\tAndroid phone startup Essential is sued for allegedly stealing trade secrets\t", "author": ["\n\t\t\t\t\t\tKyle Wiggers\t\t\t\t\t"], "text": ["<p><figure id=\"attachment_1259698\" class=\"wp-caption alignnone\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"https://icdn4.digitaltrends.com/image/essential-phone-top-half-3-720x720.jpg\" onerror=\"dti_load_error(this)\" class=\"attachment-large size-large wp-image-1259698 dt-lazy-load dt-lazy-pending\" alt=\"essential keyssa lawsuit news phone top half\"><figcaption class=\"wp-caption-text\"><span></span> <span class=\"credit\">Julian Chokkattu/Digital Trends</span></figcaption></figure><a href=\"https://www.digitaltrends.com/mobile/essential-phone-news/\">Essential</a>, the Android phone startup backed by Android co-founder Andy Rubin, hasn’t had the success some predicted. But if delayed shipments, privacy gaffes, and disappointing sales weren’t bad enough, Essential’s latest setback threatens to do lasting damage to its smartphone business. On Tuesday, October 17, <a href=\"http://www.keyssa.com/\" target=\"_blank\" rel=\"noopener\">Keyssa</a>, a wireless company backed by iPod creator and <a href=\"http://nest.com\" target=\"_blank\" rel=\"noopener\">Nest</a> founder Tony Fadell, filed a lawsuit against Essential alleging that it stole trade secrets.</p>", "<p>The dispute stems from Essential’s work with Keyssa’s transfer technology, which copies gigabit-size using a low-frequency network. According to documents made public, Essential sought Keyssa’s technical consultation under a non-disclosure agreement, working with a team of the firm’s “top engineers and scientists” and exchanging “many thousands” of emails, technical documents, and confidential presentations.</p>", "<p>In August, Essential <a href=\"https://www.reuters.com/article/us-keyssa-lawsuit/android-co-creators-startup-sued-over-connector-technology-idUSKBN1CL2OO\" target=\"_blank\" rel=\"noopener\">told Reuters</a> that it “considered Keyssa as a component supplier for Essential Phone and chose to proceed with a different supplier that could meet our performance specifications for the product.”</p>", "<p>Essential decided to end the relationship after 10 months, assuring Keyssa that it would use a different wireless technology in the Essential Phone (it eventually sourced it from <a href=\"http://sibeam.com\" target=\"_blank\" rel=\"noopener\">Sibeam</a>). But Keyssa says it reneged on the confidentiality agreement, knowingly implementing antenna designs and techniques in the phone’s modular accessories pin.</p>", "<p>It’s not Essential’s first legal dispute. In June, accessory maker <a href=\"http://spigen.com\" target=\"_blank\" rel=\"noopener\">Spigen</a>, which has a trademark on the Essential name for certain battery packs, chargers, and Bluetooth headphones, sent a cease-and-desist letter to Essential, accusing it of misappropriation. It still hasn’t been resolved — Essential’s trademark application was denied twice because it sought the use “Essential” for a nonspecific range of consumer electronics products, according to <a href=\"http://www.androidpolice.com/2017/06/02/spigen-accuses-andy-rubins-company-essential-products-trademark-infringement-essential-responds-%F0%9F%96%95%E0%B2%A0_%E0%B2%A0%F0%9F%96%95/\" target=\"_blank\" rel=\"noopener\">Android Police</a>.</p>", "<p>But if Keyssa’s lawsuit is found to have merit, the impact could be far worse. The Essential Phone’s range of modular accessories, which attach to the back of the phone using a combination of magnetic pins and a 60GHz wireless USB adapter, is one of the handset’s selling points. At launch, some models were bundled with the clip-on <a href=\"https://www.digitaltrends.com/cell-phone-reviews/essential-phone-review/\">Essential Camera</a>, an impressive 360-degree, 12-megapixel 4K camera that Essential claims is the “world’s smallest.”</p>", "<p>Keyssa, which earlier this year partnered with smartphone manufacturers like Samsung and Foxconn, says it is seeking damages. “Keyssa has not been compensated for Essential’s use of this guidance and know-how,” a spokesperson told <a href=\"https://www.reuters.com/article/us-keyssa-lawsuit/android-co-creators-startup-sued-over-connector-technology-idUSKBN1CL2OO\" target=\"_blank\" rel=\"noopener\">Reuters</a>. “We are pursuing this action because our attempts to resolve this matter through discussions with Essential have not been successful.”</p>", "<p>The court proceedings in San Francisco are scheduled to begin later in 2017.</p>"]},
{"title": "\n\t\tEssential PH-1 Phone: Everything you need to know\t", "author": ["\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"], "text": ["<p>Andy Rubin co-created Android, the smartphone operating system that powers 2 billion devices around the world. After leaving Google, he launched a new project: The <a href=\"https://www.essential.com/\">Essential PH-1</a>. It’s an Android smartphone, unsurprisingly, but one with an edge-to-edge screen, innovative accessories, and high-end materials that set it apart from the crowd. Read our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/essential-phone-review/\">Essential Phone review</a> to hear our thoughts on the smartphone.</p>", "<p>The Essential Phone may not have set the world on fire, but it’s still a great phone, especially at the same price as <a href=\"https://www.digitaltrends.com/mobile/best-cheap-smartphones/\">a budget handset</a>. The Amazon exclusive Halo Gray model of the Essential Phone was available for a limited on <a href=\"https://www.amazon.com/gp/product/B078SQ7GWK/?th=1&amp;tag=dt-incontent-btn-20&amp;tag=dt-incontent-btn-20\">Amazon for just $224</a>, down from its usual price of $345,</p>", "<p>Equipped with the Snapdragon 835, 4GB of RAM, a 128GB hard drive, and made from ceramic, the Essential Phone is an absolute steal at this price. Since it’s confirmed to be receiving <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">Android 9.0 Pie</a>, it’s also one of the cheapest ways to experience the newest version of Android when it updates.</p>", "<p>In its <a href=\"https://www.reddit.com/r/essential/comments/8zpffj/monthly_ama_with_essential_team_july_18_from/\">July 2018 AMA</a> on Reddit, Essential announced the phone will definitely receive the Android 9.0 Pie update, and will likely get the update to Android Q in 2019. When asked if an Android Q update would happen a spokesperson for the company replied “I don’t have any information about when Q would drop, and obviously that would have an effect on this answer. Assuming the schedule for Q is like the schedule for P we plan to do it.”</p>", "<p>Essential is adding an Audio Adapter HD, which will be available in summer 2018 and basically delivers full MQA rendering coupled with what the company calls an “audiophile-grade” amp. It also adds a headphone jack — so if you miss that feature, you’ll be able to get one back with the new adapter.</p>", "<p>Essential has announced that it will bring three new updates to the Essential Phone to improve the audio experience. First of all, the device is now MQA-certified. What that means is that the device will support the MQA audio codec aimed at delivering the highest-quality audio possible.</p>", "<p>In March 2018 Essential released its Android 8.1 update with support for Project Treble. The first sales figures for the Essential Phone were revealed in a tweet by the <a href=\"https://www.idc.com/\">International Data Corporation’s</a> (IDC) research director Francisco Jeronimo, and they were not good. The company project Essential shipped less than 90,000 handsets within its first six months.</p>", "<p>In its December 2017 <a href=\"https://www.reddit.com/r/essential/comments/7jf8rx/biweekly_ama_with_essential_team_dec_13_from/\">Reddit AMA</a>, Essential announced Project Treble would arrive with the Android 8.1 update. The company also announced it would add a double-tap-to-wake gesture to the phone but did not provide an ETA.</p>", "<p>In a <a href=\"https://www.reddit.com/r/IAmA/comments/7048au/im_andy_rubin_cofounder_of_the_mobile_operating/?utm_content=title&amp;utm_medium=front&amp;utm_source=reddit&amp;utm_name=IAmA\" target=\"_blank\" rel=\"noopener\">Reddit Q&amp;A session</a> on September 14 2017, the Essential engineering team confirmed that two new Essential Phone accessories were in active development: A charging dock and a “high end [sic] audio accessory” that supports a 3.5mm jack.</p>", "<p>“We are under development on a number of Click Connector accessories. The first available should be the charging dock,” an Essential team member wrote. “We are also actively developing a high-end audio accessory to support a 3.5mm jack.”</p>", "<p>A November 2017 <a href=\"https://play.google.com/store/apps/details?id=com.essential.klik&amp;hl=en\">update</a> for the Essential Phone brought portrait mode to the rear-facing camera, a feature available on the iPhone X, Pixel 2, and several other Android flagships. The update also offers stability updates and improves image quality by reducing JPEG compression. The latest update for the app (via <a href=\"http://www.trustedreviews.com/news/essential-phone-camera-update-play-store-download-3391223\">Trusted Reviews</a>) introduced much-needed auto-HDR, better dynamic HDR, and improved general performance and scene rendering.</p>", "<p>Essential <a href=\"https://www.essential.com/blog/a-quick-camera-update\" target=\"_blank\" rel=\"noopener\">released an update</a> to its camera app in September 2017, with several improvements. You’ll have to first install the latest system build (NMI81C) and then update the camera app through Google Play. The changes include boosted capture speed in regular and low light to below 1 second, countdown timer when in 360 camera mode, improved brightness and performance in low light, spatial sound when shooting in 360, the ability to use volume up and down keys as shutter buttons in 360 camera mode, and bug fixes.</p>", "<p>Shortly after the Essential Phone was launched, a Halo Gray version of the phone was announced as part of the Amazon Prime Exclusive Phones program. The Halo Gray handset ships with Amazon’s digital assistant, Alexa, installed right out of the box. According to Essential, you can uninstall Alexa if you so choose. The Halo Gray edition is available <a href=\"https://www.amazon.com/Essential-Factory-Unlocked-Phone-Warranty/dp/B078SQ7GWK/ref=sr_1_1?ie=UTF8&amp;qid=1518800475&amp;sr=8-1&amp;keywords=Essential%20Phone%20Halo%20Gray&amp;tag=dt-incontent-btn-20&amp;tag=dt-incontent-btn-20\" target=\"_blank\" rel=\"noopener\">through Amazon</a> for $500.</p>", "<p>The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/xiaomi-mi-mix-review/\">Xiaomi Mi Mix</a> arguably got the edge-to-edge screen trend rolling, but the Essential PH-1 may have one of the most impressive implementations yet. The 5.71-inch, QHD (2,560 x 1,312 pixels) screen — which Essential calls the Full Display — extends from the bottom of the phone’s thin bezel to the top. And unusually, the screen curves around the phone’s selfie camera, obscuring part of the Android status bar.</p>", "<p>The PH-1 is compact and light, clocking in at a weight of less than 185 grams and a thickness of 7.8mm. It’s durable, too, thanks to a combination of titanium, ceramic material, and Gorilla Glass 5. But those design choices necessitated compromise — just like the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-7-review/\">iPhone 7</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u11-review/\">HTC U11</a>, the PH-1 doesn’t have a 3.5mm headphone socket.</p>", "<p>“Headphone jacks are pretty big components and they don’t play nice with all-screen Phone architectures,” <a href=\"https://www.reddit.com/r/IAmA/comments/7048au/im_andy_rubin_cofounder_of_the_mobile_operating/dn0ajz1/\">said</a> an Essential engineer in a Reddit Q&amp;A. “We studied it very seriously, but fitting a headphone jack into our Phone required tradeoffs we were uncomfortable with. We’d have grow a huge “chin” in the display and reduce the battery capacity by 10 percent, or we’d need a huge headphone bump! We decided it was more important to have a beautiful full-screen display in a thin device with solid battery life. Then we made sure we to build ya’ll [sic] a high-quality DAC in a tiny adapter that can elegantly live on your headphones. – Dave”</p>", "<p>Under the PH-1’s hood lies a Qualcomm Snapdragon 835 processor, an Adreno 540 GPU, 4GB of RAM, and 128GB of internal storage. The two camera lenses on the phone’s rear, a 13-megapixel dual RGB color lens with hybrid autofocus (combining contrast, phase detect, and IR laser assist) and a second f/1.85 monochrome lens, can shoot videos at 4K 30fps (or 1080p 60fps/720p 120fps) and capture 200 percent more light than the average sensor. And the 8-megapixel, f/2.2 selfie camera can record video at 4K resolution.</p>", "<p>The PH-1’s other highlights include four microphones in a three-dimensional arrangement that filters out background noise, a 3,040mAh battery with rapid charging technology, a barometer, a USB Type-C port, and a rear fingerprint sensor that Essential claims is the “fastest available technology.”</p>", "<p>You’ll find a 3,040mAh battery in the Essential Phone which should be enough to power the phone through a day of heavy use. And luckily the phone supports fast-charging so it replenishes the battery quickly.</p>", "<p>The Essential Phone ships with Android 7.1.1 Nougat, but can be updated to Android 8.1 Oreo.  We expect to see an Android P update for the Essential Phone shortly after its launched, and the company said it’s likely the phone will also receive an Android Q update in 2019.</p>", "<p>When it comes to special features, Essential phone is joined by a <a href=\"https://www.digitaltrends.com/mobile/moto-mods-mwc-2017/\">Moto Mod-style</a> range of <a href=\"https://www.theverge.com/2017/5/30/15711194/essential-phone-modular-magnetic-accessory-system\" target=\"_blank\" rel=\"noopener noreferrer\">modular accessories</a>, which attach using a combination of magnetic pins and a 60GHz wireless USB adapter on the device’s back. A couple of modules (which Essential calls “Click Connectors”) have been announced so far: A 360-degree camera, and a dock that charges the phone when it’s not in use.</p>", "<p>The Essential Phone features a dual camera module with a 13-megapixel lenses. Both lenses have an f/1.85 aperture. The primary lens on the Essential Phone shoots in color while the secondary lens shoots in black and white. You’ll find an 8-megapixel shooter on the front of the phone.</p>", "<p>When the Essential Phone was first released, many were underwhelmed with its camera. However, Essential has released a number of camera updates over the past year that vastly improve its performance.</p>", "<p>In addition to the built-in camera modules on the Essential Phone, there’s also the Essential Camera, which the company claims is the “world’s smallest” 360-degree camera. It attaches to magnets at the top of the phone’s body, allowing it to poke its “head” over the top of the phone. The camera comes in at just 35 grams, and has two 12-megapixel lenses that can shoot 4K resolution, 30 fps video, as well as four microphones that capture sound in 3D. Following a tease that <a href=\"https://support.essential.com/hc/en-us/articles/115007853827-Can-the-360-camera-stream-live-video-\" target=\"_blank\" rel=\"noopener noreferrer\">support for livestreaming</a> would soon also be included, the Essential Camera has now made good on its promise.</p>", "<p>After a rocky start, the Essential Phone began shipping on August 25, 2017. And while some early buyers paid $700 for the handset, Essential quickly lowered the price to $500 and temporarily offered a $200 credit for the Essential Store for those early purchasers.</p>", "<p>All four major U.S. carriers support the Essential Phone. Sprint is the only carrier that carries the phone and accessories in-store.</p>", "<p>For those who don’t live in the United States, the Essential Phone is available on the <a href=\"https://www.essential.com\">company’s website</a> for customers in Canada, France, Japan, and the United Kingdom.</p>", "<p>Essential is also planning to release a smart speaker with an intelligent assistant — the <a href=\"https://www.essential.com/home\">Essential Home</a>. It’s similar to Amazon’s Echo and Google Home, the main difference being a circular screen that shows exactly what tasks the Essential Home is performing.</p>", "<p>Essential Home’s round “auto-display” can be activated with a tap, a glance, or a question. Just like Amazon’s Echo speakers, Microsoft’s Cortana Assistant, and Google Home, it lets you control music, set timers, and more. There’s no word on a release date at this time, but it has been promised that it will work with smart home platforms like SmartThings, HomeKit, and Nest.</p>", "<p>Essential Home runs a new operating system called Ambient OS, which Essential describes as a “proactive life manager.” It will notify you when you need to leave early to make an important meeting, or if you appear to have forgotten about an upcoming appointment. And it will secure your data by storing it locally, on your in-home network, rather than on a remote server like Google Home and Amazon’s Alexa.</p>", "<p><i>Updated on August 20: The Essential Phone is available for $224 on Amazon, for a limited time.<br>\n</i></p>"]},
{"title": "\n\t\tEssential is reportedly building an A.I.-powered phone that mimics its user\t", "author": ["\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"], "text": ["<p>It looks like the <a href=\"https://www.digitaltrends.com/mobile/essential-phone-news/\">Essential Phone</a> is getting a successor. According to a new <a href=\"https://www.bloomberg.com/news/articles/2018-10-10/android-creator-is-said-to-build-ai-phone-that-texts-for-you\" target=\"_blank\" rel=\"noopener\">report from Bloomberg</a>, Essential has begun work on a new phone that will use artificial intelligence that mimics the user to perform tasks like automatically respond to messages.</p>", "<p>It seems as though Essential is working full steam ahead on the new project — in fact, it has reportedly paused development on things like a planned home speaker and potentially some other products in order to put its focus on the new phone.</p>", "<p>Even the design of the new phone would be totally different than other smartphones, according to the report. It will reportedly have a small screen, and the user will mostly interact with it through voice controls, which will work with Essential’s own artificial intelligence software. In other words, the device will aim to be more of a digital assistant than any phone before it.</p>", "<p>It all sounds a bit sci-fi, but that’s apparently the point. Andy Rubin, co-founder of Android and founder of Essential Products, is reportedly trying to build a device that “captures people’s imagination” by being something that’s totally different from the competition.</p>", "<p>Of course, Essential has a long road ahead of it. Currently, the consumer A.I. space is dominated by the likes of Google, Amazon, and Apple, but even the assistants from those companies sometimes fail, forcing the user to manually perform the task they’re asking the assistant to do. With a phone that has only a small display, manually doing tasks may be much harder. The new device, however, could be targeted at those who want to spend less time using their phones.</p>", "<p>So when will we see Essential’s new device? Essential reportedly aims to have the first prototype ready by the end of the year, but it’s unlikely consumers will see what that prototype looks like. According to the Bloomberg report, Essential is aiming to show the device off to industry partners at the Consumer Electronics Show in January in Las Vegas — though consumers probably won’t see the device until well into 2019.</p>", "<p>Even when Essential does eventually release the new device, there’s no guarantee that it will sell — and if it doesn’t, this could be one of the last devices we see from Essential.</p>"]},
{"title": "\n\t\tThis high-end Android smartphone only costs $250 for Amazon Prime Day (updated)\t", "author": ["\n\t\t\t\t\t\tJulian Chokkattu\t\t\t\t\t"], "text": ["<p>The Essential Phone, from the creator of Android, is getting an <a href=\"https://www.digitaltrends.com/go/c16dbde6276f628c1534f31406a80f517939baf9/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">insanely good discount</a> thanks to <a href=\"https://www.digitaltrends.com/dtdeals/best-amazon-prime-day-deals/\">Amazon’s Prime Day</a>.</p>", "<p>The phone <a href=\"https://www.digitaltrends.com/mobile/essential-phone-news/\">initially cost $700</a> when it was announced late last year, but the price quickly dropped to $500. On Prime Day, you only have to shell out $250 to own one — but you need to act fast. At the time of publication, all three color variants of the Essential Phone are back to their original price of $470 (or $480 for the Pure White color), but you can still find some sold by Amazon for the lower price.</p>", "<p>Head over to this <a href=\"https://www.digitaltrends.com/go/14eb97a1aed3614bc40e72a6f19c6c55112a6e5e/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">link to find a different seller</a> offering the phone for $250 — it’s still sold and shipped by Amazon — and you’ll be able to add the phone to your cart and purchase it. It is still temporarily out of stock, but Amazon will ship the phone to you when more units are available. The good thing is you’ll have still snagged it for $250, and you’ll only get charged when the product is shipped.</p>", "<p>The Essential Phone is powered by last year’s Qualcomm Snapdragon 835 processor with 4GB of RAM, and 128GB of internal storage. Those are flagship specifications from last year that rival a <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s8-review/\">Galaxy S8</a>, but that is plenty powerful for most people. There is a 3,040mAh battery, which should last about a full day, and the back of the phone has a modular system that lets you add mods like a 360-degree camera. The Essential Phone works with all major U.S. networks including AT&amp;T, Sprint, Verizon, and T-Mobile.</p>", "<p>The phone is made of ceramic and titanium, and we thought it was one of the best-looking phones of 2017. In our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/essential-phone-review/\">Essential Phone review</a>, we liked every aspect of the phone except for its camera. The dual-lens system was simply not good enough for the $700 price tag. Essential has since published updates to the phone that have improved the camera, and for $250, it’s entirely a steal.</p>", "<p>Because the software is pure stock Android 8.1 Oreo, you also will be able to get the next version of Android P quickly, along with timely security updates. The display was among the first to ever include a notch — before the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a> — and it’s crisp with a 2,560 × 1,312-pixel resolution.</p>", "<p>The only concern we have is with a recent report claiming <a href=\"https://www.digitaltrends.com/mobile/essential-considering-sale-cancels-essential-phone-ph-2/\">Essential may be looking</a> to sell itself, or that work on the Essential Phone 2 has been canceled, with a new strategy focusing on smart home products. Regardless, while the future of Essential is unclear, the Prime Day price for this phone is one of the best deals we have seen yet. If you want a new phone, you should snag it <a href=\"https://www.digitaltrends.com/go/c16dbde6276f628c1534f31406a80f517939baf9/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">from Amazon now</a>.</p>", "<p><em>Updated on July 17: We’ve added more availability information.</em></p>"]},
{"title": "\n\t\tAs sale rumors swirl, Essential claims it’s focusing on ‘game-changing’ products\t", "author": ["\n\t\t\t\t\t\tJulian Chokkattu\t\t\t\t\t"], "text": ["<p>After its first product launch saw <a href=\"https://mobile.twitter.com/fjeronimo/status/963054359000113152\">dismal sales</a> and immediate price cuts, Essential, the company created by Android co-founder Andy Rubin, is considering selling itself, according to <a href=\"https://www.bloomberg.com/news/articles/2018-05-24/andy-rubin-s-phone-maker-essential-is-said-to-consider-sale\">sources speaking to Bloomberg</a>. That is a quick turnaround, considering the <a href=\"https://www.digitaltrends.com/mobile/essential-phone-news/\">Essential Phone (PH-1)</a> launched late in 2017.</p>", "<p>Essential was the first to introduce the “notch” design — a cutout at the top of the phone housing the camera — that beat the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a> to the punch. It also distinguished itself with its titanium and ceramic design, and also by running a stock version of Android with zero bloatware, offering swift Android updates when Google rolled them out. Sadly, it wasn’t enough. Reviews, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/essential-phone-review/\">including ours</a>, dinged the phone for its poor camera, though Essential has spent the past few months improving it through software updates.</p>", "<p>When Essential launched its first smartphone, the company announced — perhaps prematurely — its road map for the coming year. The plan was to create modular components for its flagship phone every quarter, and then launch a smart home product called Essential Home, running a proprietary operating system called Ambient OS. To date, the company has only launched one module — a 360-degree camera — and a few different color variants of the original Essential Phone. The device’s price also dropped fairly quickly from $700 to below $500.</p>", "<p>Now, the Bloomberg report states the company is considering selling its patent portfolio, the original Essential Phone as well as the 360-degree camera, its engineers, and its smart home product. Oh, and it has ceased development of an upcoming phone, presumably the Essential Phone (PH-2). A final decision hasn’t been made yet.</p>", "<p>“We always have multiple products in development at the same time and we embrace canceling some in favor of the ones we think will be bigger hits,’ an Essential spokesperson told Digital Trends. “We are putting all of our efforts toward our future, game-changing products, which include mobile and home products.”</p>", "<p>Rubin also tweeted out the same exact response.</p>", "<p>It sounds as though development of the Essential Phone 2 has been canceled. Only 150,000 Essential Phones have been sold to date, which is why the company may be gearing up to exit the smartphone business. Bloomberg states there is a chance it could re-enter the market, as Essential has explored using a different manufacturer other than Foxconn.</p>", "<p>The Essential Home is reportedly still in the works and it’s expected to launch next year, according to Bloomberg’s sources.</p>"]},
{"title": "\n\t\tFrom weird to practical, 18 small travel essentials you’ll actually want to pack\t", "author": ["\n\t\t\t\t\t\tLes Shu\t\t\t\t\t"], "text": ["<p>Ultimately, what you pack for a trip is up to you. But there are a few accessories that could make the journey a bit easier. Here are 18 items that we would consider always packing — some are no-brainers, and some are quirky, but we made sure each is useful, highly rated by users, and won’t take up much room in your carry-on or checked bag. So before you board your next plane, bus, ship, or train, be sure to pack one or two (or all) of these accessories.</p>"]},
{"title": "\n\t\tSay goodbye to the Essential Phone: It’s sold out and won’t be restocked\t", "author": ["\n\t\t\t\t\t\tAaron Mamiit\t\t\t\t\t"], "text": ["<p>The Essential Phone is sold out on the official Essential website and in most retail outlets, with no more restocks planned for the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/essential-phone-review/\">polarizing device.</a></p>", "<p>The smartphone, also named the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/essential-phone-review/\">Essential PH-1</a>, was hyped up before its release last year because Andy Rubin, the founder of Essential, is also the creator of the Android mobile operating system. The Essential Phone was priced at $700 upon launch, entering a field populated by Apple’s iPhone X, Google’s Pixel 2 XL, and Samsung’s Galaxy Note 8. The price tag was later reduced to $500, which made the Essential Phone more appealing to customers.</p>", "<p>The Essential Phone went out of stock over the holiday season, partly due to significant price cuts that indicated retailers were <a href=\"https://www.engadget.com/2018/12/28/essential-phone-wont-be-restocked-discontinued/\" target=\"_blank\" rel=\"noopener\">cleaning out</a> the device’s inventory. It appears that this marks the end of the device, so, unfortunately, customers who were planning to buy the Essential PH-1 after the holidays will likely find it very hard to do so.</p>", "<p>“We are sold out of Essential Phone on essential.com and won’t be adding any new inventory. We are now hard at work on our next mobile product and will continue to sell accessories and provide speedy software updates and customer support to our existing community,” <a href=\"https://9to5google.com/2018/12/28/essential-phone-rip-stock-discontinued/\" target=\"_blank\" rel=\"noopener\">said</a> a spokesman for the company.</p>", "<p>Current Essential Phone users will be happy to know that despite the phone’s discontinuation, Essential reiterated that updates for it will continue. Essential previously promised that the Essential PH-1 will be upgraded at least to <a href=\"https://www.digitaltrends.com/mobile/possible-android-q-names/\">Android Q</a>.</p>", "<p>Another positive note from the spokesman’s statement is the confirmation that Essential is working on its next product. It was previously reported that the device will be an artificial intelligence-powered <a href=\"https://www.digitaltrends.com/mobile/essential-phone-2-news/\">smartphone </a>that performs tasks by mimicking its user, such as automatically replying to messages.</p>", "<p>The new smartphone is said to have a unique design, with a small screen because users will interact with it mostly through voice commands. It will certainly be a different device compared to the competition, and there are rumors that Essential will be ready to show off the smartphone at CES 2019 in January.</p>", "<p>Essential is able to roll out major Android updates for the Essential Phone faster than other non-Google Android smartphone manufacturers, and it is expected that the company will do the same for the rumored new smartphone.</p>"]},
{"title": "\n\t\tBeer tech! Picnic tech! Hiding from your boss tech! It’s the DT Summer Tech Guide!\t", "author": ["\n\t\t\t\t\t\tDigital Trends Staff\t\t\t\t\t"], "text": ["<p><a href=\"http://www.digitaltrends.com/wp-content/uploads/2013/06/DT-2013-Summer-tech-guide-Gerber-Shard-Keychain-Tool.jpg\" data-dt-zoomable=\"1\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"http://img.digitaltrends.com/image/dt-2013-summer-tech-guide-gerber-shard-keychain-tool-300x300.jpg\" onerror=\"dti_load_error(this)\" class=\"alignright size-medium wp-image-456711 dt-lazy-load dt-lazy-pending\" alt=\"DT 2013 Summer tech guide Gerber Shard Keychain Tool\"></a>Take that ridiculous guitar-shaped bottle opener off your keychain. It’s not a badge of drinking honor, it’s a badge of shame that you don’t know how to crack a beer in a <a href=\"http://www.popularmechanics.com/home/skills/20-ways-to-open-a-beer-bottle-8347640\" target=\"_blank\">multitude of other more resourceful ways</a>. Got it? Good, now recycle it (we’re in Portland, for chrissakes) and replace it with Gerber’s Shard, a tiny little keychain gadget that includes <i>useful tools</i> like flathead and Philips screwdrivers, so you can save the day when that rusty grill starts falling apart at a cookout. Or shotgun a beer. Or whatever. Yes, there’s a still a bottle opener on here, but do yourself a favor and learn to <a href=\"http://www.youtube.com/watch?v=nrKTKQVsib4\" target=\"_blank\">open a beer with another beer</a> – you’ll never be thirsty.</p>", "<p><a href=\"http://www.digitaltrends.com/wp-content/uploads/2013/06/DT-2013-Summer-tech-guide-Tjiller.jpg\" data-dt-zoomable=\"1\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"http://img.digitaltrends.com/image/dt-2013-summer-tech-guide-tjiller-300x300.jpg\" onerror=\"dti_load_error(this)\" class=\"alignleft size-medium wp-image-456717 dt-lazy-load dt-lazy-pending\" alt=\"DT 2013 Summer tech guide Tjiller\"></a>Yes, beer coozies are cool again, what with the PBR-ification of hipsterdom, but let’s get real: they don’t actually keep your beer much colder than a paper bag. And while various freeze-first varieties have popped up over the years, they all have two serious drawbacks: first, they last about as long as one beer. Second, they leave a puppy-sized puddle on the table as they melt. The revolutionary Tjiller, aside from being delightfully difficult to pronounce, has been designed with a proprietary gel that sits behind an aluminum membrane. This is the point of contact with the can, which ensures a slow release of temperature that keeps the Tjiller cold and dry long after your Kisai Intoxicated watch tells you it’s time to go home.</p>", "<p><a href=\"http://www.digitaltrends.com/wp-content/uploads/2013/06/DT-2013-Summer-tech-guide-Fujifilm-FinePix-XP200.jpg\" data-dt-zoomable=\"1\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"http://img.digitaltrends.com/image/dt-2013-summer-tech-guide-fujifilm-finepix-xp200-300x300.jpg\" onerror=\"dti_load_error(this)\" class=\"alignright size-medium wp-image-456710 dt-lazy-load dt-lazy-pending\" alt=\"DT 2013 Summer tech guide Fujifilm FinePix XP200\"></a>There are various ways to tell if your summer vacation won’t suck. Will it involve water? Dirt or sand? The potential for long falls off high things? Any of these indicate a solid vacation choice, and all of them require a camera that can handle various vacation-related mishaps. The <a href=\"http://www.digitaltrends.com/digital-camera-reviews/fujifilm-finepix-xp200-review/\">FinePix XP200</a> has a 16-megapixel CMOS sensor for better low-light capture, image stabilization, a 5x optical zoom, and shoots video in 1080i HD; but that’s not why you need it this summer. You need it because all of the above come packaged in a bomb-proof casing that’s waterproof to 50 feet and shockproof to 6.6 feet. We’re not exactly sure why the shockproof rating is measured in feet, but we bet you’re going to find out. You know why? Because you summer vacation is going to be awesome. </p>", "<p><a href=\"http://www.digitaltrends.com/wp-content/uploads/2013/06/DT-2013-Summer-tech-guide-Biolite-Camp-Stove-2.jpg\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"http://img.digitaltrends.com/image/dt-2013-summer-tech-guide-biolite-camp-stove-2-300x300.jpg\" onerror=\"dti_load_error(this)\" class=\"alignleft size-medium wp-image-456736 dt-lazy-load dt-lazy-pending\" alt=\"DT 2013 Summer tech guide Biolite Camp Stove\"></a>When you’re going “real camping” (as opposed to those “car camping” wusses) space is at a premium and you can’t afford to load your pack with a bunch of unitaskers. The <a href=\"http://www.digitaltrends.com/lifestyle/review-biolite-camp-stove/\">Biolite</a> is different from your average camp stove right out of the box, in that it runs on small pieces of wood instead of white gas or kerosene. But what makes it particularly awesome is that it will both cook your food and charge anything with a USB charging port. (Hey, just because you’re hardcore doesn’t mean you don’t wanna kick it next to the campfire and play Plants vs. Zombies, right?) The Biolite uses heat to create thermoelectric power and charge it’s built-in battery. Like any campstove worth its salt, it also has a fan to get your biomass fuel up to temperatures high enough to boil a cup of water in about two minutes – just enough time to text your friends and tell them how much better meals taste when taken under a canopy of stars, far from their petty luxuries. </p>", "<p><a href=\"http://www.digitaltrends.com/wp-content/uploads/2013/06/DT-2013-Summer-tech-guide-Kisai-Intoxicated-LCD-Watch.jpg\" data-dt-zoomable=\"1\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"http://img.digitaltrends.com/image/dt-2013-summer-tech-guide-kisai-intoxicated-lcd-watch-300x300.jpg\" onerror=\"dti_load_error(this)\" class=\"alignright size-medium wp-image-456713 dt-lazy-load dt-lazy-pending\" alt=\"DT 2013 Summer tech guide Kisai Intoxicated LCD Watch\"></a>The only downside to summer BBQs is the part where you drive home tipsy, get pulled over, and lose your license … or worse. Get a post-cookout gut check with the Kisai Intoxicated watch, which packs a built-in sobriety test and a fully functioning breathalyzer. Just blow into the watch, and its blood-alcohol meter tells you exactly how much sauce is flowing through your veins. The LCD screen lights up green, yellow, or red to quickly let you know when Johnny Law is going to strongly disapprove of your driving. Of course, Intoxicated also sports a clock, calendar, alarm, and charges via USB – none of which will be of much use if you wind up in jail, but are otherwise useful little additions to a device that will make you the most responsible killjoy at the party. </p>", "<p><a href=\"http://www.digitaltrends.com/wp-content/uploads/2013/06/samsung-ativ-5.jpg\" data-dt-zoomable=\"1\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"http://img.digitaltrends.com/image/samsung-ativ-5-300x300.jpg\" onerror=\"dti_load_error(this)\" class=\"alignleft size-medium wp-image-456729 dt-lazy-load dt-lazy-pending\" alt=\"DT 2013 Summer tech guide samsung ativ book 5\"></a>It’s summer; no matter how much work you have to do, you are <i>not</i> doing it at the office. Untether yourself with the 14-inch Ativ Book 5, which delivers all the goodness of a touch-enabled Windows 8 experience and Samsung’s SideSync software. That latter tech allows you to pair your Samsung phone to the computer so you can do things like answer text messages from you boss while grinding away at the keyboard. And after you’ve doused your burning inbox with a Corona, <a href=\"http://www.digitaltrends.com/laptop-reviews/samsung-ativ-book-5-review/\">the Book 5</a> offers Intel’s HD Grahpics 4000 chip and two JBL speakers with Bass Boost, which means you’ve got a mini home theater in your laptop bag. That’s important, because you’re only allowed two carry ons for the flight to your beach-side not-office. </p>", "<p><a href=\"http://www.digitaltrends.com/wp-content/uploads/2013/06/DT-2013-Summer-tech-guide-Puzzlebox-Orbit.jpg\" data-dt-zoomable=\"1\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"http://img.digitaltrends.com/image/dt-2013-summer-tech-guide-puzzlebox-orbit-300x300.jpg\" onerror=\"dti_load_error(this)\" class=\"alignright size-medium wp-image-456714 dt-lazy-load dt-lazy-pending\" alt=\"DT 2013 Summer tech guide Puzzlebox Orbit\"></a>“Oh, you have a kite there? That’s nice.  Excuse me while I fly this helicopter with MY BRAIN.” This could be an actual conversation you have with someone this summer, if you decide that your most complex organ needs to be a bit more involved in your play time. The Puzzlebox Orbit acts like an EEG <a href=\"https://exg5.exghost.com/owa/redir.aspx?C=pfcnIO_AKkWjeYOUQxQkwJRul3UpQtBIfFYYiwDC4h1r2ZLzUBxsm6C9swFwdot44Z3wyf_Coio.&amp;URL=http%3a%2f%2fen.wikipedia.org%2fwiki%2fElectroencephalography\" target=\"_blank\">http://en.wikipedia.org/wiki/Electroencephalography</a>, but, you know, for fun. Put on the electrode-filled cap, then let your brain do the flying. It reads for certain brainwaves, so all you need to do is concentrate. It only goes up and down, which isn’t all that impressive as far as super powers go, but it’s still cooler than all your friends who have to use their <i>hands</i> to do things. So lame. </p>", "<p><a href=\"http://www.digitaltrends.com/wp-content/uploads/2013/06/DT-2013-Summer-tech-guide-Drivemocion-LED-car-sign.jpg\" data-dt-zoomable=\"1\"><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" data-dt-lazy-src=\"http://img.digitaltrends.com/image/dt-2013-summer-tech-guide-drivemocion-led-car-sign-300x300.jpg\" onerror=\"dti_load_error(this)\" class=\"alignleft size-medium wp-image-456709 dt-lazy-load dt-lazy-pending\" alt=\"DT 2013 Summer tech guide Drivemocion LED car sign\"></a>Summer is here, which means giving up the comfortable confines of your Lay-Z-Boy and getting your butt out the door for another memorable road trip! Only this time, let drivers around you know exactly what you’re thinking with the Drivemocion LED car sign. Think of Drivemocion as rear-mounted billboard for your thoughts and emotions. The sign suctions to the rear of your car and displays a number of pre-written messages like “back off,” “slow down,” and “sorry.” It even has facial expressions you can choose from, so you can kick off that summer romance straight from the road!</p>"]}
]