[
    {
        "title": "OnePlus 6T Review: The No Bullshit Best Deal in Smartphones",
        "author": "Sam Rutherford",
        "text": [
            "<p>Since its inception, OnePlus has danced around the fringes of the smartphone market, catering to nerds and enthusiasts with spec-laden devices for reasonable prices. And unlike the Apples and the Samsungs of the world, OnePlus has thrived even though it really only makes one product a year, typically released in the spring and then refreshed in the fall. And while the OnePlus 6T is the expected remix to the <a href=\"https://gizmodo.com/oneplus-6-review-the-best-android-phone-that-wont-dest-1826158898\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/oneplus-6-review-the-best-android-phone-that-wont-dest-1826158898', {metric25:1})\">OnePlus 6</a> I checked out earlier this year, it represents a big step forward for OnePlus as a major player in the phone game and for people who just want a damn good handset.</p>",
            "<p>Previously, in order to attract new customers, OnePlus was largely reliant on word of mouth and efforts like collabs with streetwear brands to drive unlocked phone sales through its website. And that’s fine when a company is still in startup mode, but in the U.S. where just <a href=\"https://www.npd.com/wps/portal/npd/us/news/press-releases/2016/unlocked-mobile-phones-account-for-12-percent-of-the-us-market-with-growth-expected-to-continue-according-to-a-new-report-from-npd-connected-intelligence/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.npd.com/wps/portal/npd/us/news/press-releases/2016/unlocked-mobile-phones-account-for-12-percent-of-the-us-market-with-growth-expected-to-continue-according-to-a-new-report-from-npd-connected-intelligence/', {metric25:1})\">12 percent or so</a> of smartphones are purchased as unlocked devices, that strategy puts some serious limits on a phone’s reach. But starting with the 6T, OnePlus has partnered with T-Mobile to make its phones available for purchase in brick-and-mortar carrier stores for the first time ever. And on top of that, OnePlus also worked with Verizon to offer full compatibility with Big Red’s network, which is another OnePlus first.</p>",
            "<p>This one-two combo means that now, customers on carriers that collectively hold over <a href=\"https://www.statista.com/statistics/199359/market-share-of-wireless-carriers-in-the-us-by-subscriptions/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.statista.com/statistics/199359/market-share-of-wireless-carriers-in-the-us-by-subscriptions/', {metric25:1})\">85 percent of the U.S.’ wireless market</a> can turn to a OnePlus phone as a real option for their next phone, a big improvement from past years when OnePlus devices were strictly limited to GSM networks. And with the 6T now available from T-Mobile, potential buyers can purchase the phone with monthly payments instead all at once—which for better or worse is simply how things are done in the States—thereby lowering the barrier to entry even more.</p>",
            "<p>Meanwhile, on the tech side, while the 6T features essentially the same glass-backed design OnePlus debuted six months ago, the phone sports some clever new tricks, most notably of which is a new in-screen fingerprint reader. Yup, that’s right, before smartphone giants like Samsung, LG, or Apple figured out how to properly marry screens and fingerprint sensors, OnePlus (along with the help of its parent company <a href=\"https://en.wikipedia.org/wiki/BBK_Electronics\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://en.wikipedia.org/wiki/BBK_Electronics', {metric25:1})\">BBK Electronics</a>) is the first company to bring this feature to the U.S. in a meaningful way.</p>",
            "<p>That means now you can have a front-facing fingerprint reader without needing sacrifice on screen size, and when combined with a new and more compact teardrop-shaped notch up top and only the slightest of chins down bottom, there’s even more of the OnePlus 6T’s 6.4-inch AMOLED screen to enjoy. And with a claimed unlock time of 0.34 seconds, OnePlus says its integrated optical fingerprint reader is just as fast as the capacitive touch sensors used on the back of the OnePlus 6.</p>",
            "<p>The way it works is that beneath the screen, there’s a tiny camera that looks up at your finger, and any anytime you want to unlock your phone, it fires a green light at your digits to ensure the most accurate reading possible. In practice, things are even simpler. All you have to tap your finger on the scanner, and voila, you’re in. However, there are a couple things do have an impact on how fast the whole process really feels.</p>",
            "<p>To spice things up, OnePlus added three different animations to the unlock process, so there’s no doubt when that optical fingerprint reader is working. However, somewhat contrary to what you might think, you don’t actually need to hold your finger down until the end of the animation, which often takes longer than what the phone actually needs to ID your print, something that can make it seem like in-screen scanner is slower than it actually is. At the same time, I did run into a few situations where I pulled my finger away a bit too quickly, so there’s is still a bit of an adjustment, even if it’s mostly a mental one. Anecdotally, I found the in-screen fingerprint reader is less tolerant of off-angle taps, and like all fingerprint readers, OnePlus’ optical scanner can still be a bit finicky, sometimes require a long dead-center press instead of a quick tap to let you in.</p>",
            "<p>Unfortunately, there is a downside to the 6T’s in-screen fingerprint reader, because due to the placement of the optical sensor beneath the bottom section of the display, that left basically no room for a headphone jack. So instead of trying to move that port somewhere else, OnePlus said screw it. At this point, it’s hard to get too mad about that decision, as it’s clear that’s where the smartphone industry is heading, but since OnePlus along with Samsung was one of the few companies that previously hadn’t yet axed the headphone jack, it’s sorta sad to see more gadget maker say goodnight to our once beloved port.</p>",
            "<p>As for the rest of the 6T’s specs, you still get a Qualcomm Snapdragon 845 chip and your choice of 6GB or 8GB of RAM. But the real bonus is that for the same $550 starting price as the old OnePlus 6, the 6T’s base storage has been increased from 64GB to 128GB, with an optional 256GB model available for $630. The OP6T’s battery has also received a sizable bump up from 3,300 mAh to 3,700, and the difference in longevity is quite noticeable. On our rundown test, the standard OP6 managed a solid 13 hours and 3 minutes, but on the 6T, we got an even better 14:37. That’s pretty damn good considering that despite having a bigger 4,000 mAh battery (though with a higher-res screen) the <a href=\"https://gizmodo.com/samsungs-galaxy-note-9-is-the-best-big-phone-1828348138\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/samsungs-galaxy-note-9-is-the-best-big-phone-1828348138', {metric25:1})\">Galaxy Note 9</a> only lasted 14:11 on the same test.</p>",
            "<p>Elsewhere, the 6T’s other major improvements include enhanced portrait and selfie modes, along with a new Night Mode specifically designed to improve dynamic range and general image quality in low-light scenarios. However, in head-to-head testing against a <a href=\"https://gizmodo.com/google-pixel-3-review-the-other-way-to-make-a-killer-p-1829749807\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-pixel-3-review-the-other-way-to-make-a-killer-p-1829749807', {metric25:1})\">Pixel 3</a>, while OnePlus’ Night Mode did a solid job of cutting down on noise, I found it also oversharpened photos to the point where some bright lights pop out a little too much, while hard lines have halo artifacts around them. Night mode is a nice extra tool to have for when things get real dark, but it’s not exactly a game changer.</p>",
            "<p>As for normal photos, OnePlus has also hopped on the trend of using AI to identify objects and accordingly adjust the settings, except that on the OP6T, there’s no pop up or icon that tells you when it’s happening. OnePlus prefers a less intrusive approaching to AI photo tuning, which is generally fine, but it can result in situations where your pics suddenly look rich and more vivid when the AI kicks in. As a whole, while the OnePlus 6T can’t quite match the kind of pics you’d get from a Pixel 3, it comes damn close, and even in a few situations, even topped Google’s proprietary HDR magic.</p>",
            "<p>Lastly, while talking about software typically isn’t very interesting, I feel like it’s important to note how far OnePlus’ Oxygen OS has come. After years of streamlining, making animations feel smooth, and focusing on app management that’s based more on actual usage instead of simply how much RAM an app takes up, Oxygen OS sometimes feels like an even better version of Android than what you’d get on a Pixel. It’s super snappy, there’s no bloat, and you get bonuses like a built-in dark theme, UI customizations, and the choice of three different navigation setups (the three button Android nav, the Android 9 Pie “pill,” and full on gestures) that you don’t get from Google’s stock OS.</p>",
            "<p>In the end, while in absolute terms a <a href=\"https://gizmodo.com/google-pixel-3-review-the-other-way-to-make-a-killer-p-1829749807\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-pixel-3-review-the-other-way-to-make-a-killer-p-1829749807', {metric25:1})\">Pixel 3</a> or <a href=\"https://gizmodo.com/samsung-galaxy-s9-review-the-best-android-phone-dont-n-1823575944\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/samsung-galaxy-s9-review-the-best-android-phone-dont-n-1823575944', {metric25:1})\">Galaxy S9+</a> might be a better overall phone than a OnePlus 6T, are those phone’s really worth $300 more? Or how about a whopping $500 in the case of something like an <a href=\"https://gizmodo.com/the-iphone-xs-is-forever-1829305262\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-iphone-xs-is-forever-1829305262', {metric25:1})\">iPhone XS</a>? Sure, for some folks, the OnePlus 6T’s lack of wireless charging, a microSD card slot, and official water-resistance might be downers.</p>",
            "<p>But for all the people who say they want something fast and reliable for a decent price, the OnePlus 6T is your phone. It’s got excellent battery life, flagship specs, and a neat in-screen fingerprint reader Americans can’t really get on anything else yet. And now, thanks to wider availability and better carrier support, the OnePlus 6T needs to be a serious consideration for anyone looking to sidestep the onslaught of $1,000 phones. While its original motto always felt a bit trite, five years after its start, OnePlus’ latest phone is closer to being a flagship killer than ever before.</p>",
            "<p>Oxygen OS (based on Android 9 pie) • Qualcomm Snapdragon 845 • 6GB/8GB of RAM • 128GB/256GB of storage • in-screen optical fingerprint sensor • 6.4-inch 2340 x 1080 AMOLED display • 16-MP front camera • dual 20-MP rear cameras • USB 2.0 Type-C port • dual nano sim tray • 3,700 mAh battery, bottom-firing speaker • 6.2 x 2.9 x 0.32 inches • 6.52 ounces • compatible with AT&amp;T, T-Mobile and Verizon • available in mirror black and midnight black</p>"
        ]
    },
    {
        "title": "The Best Phones You Can Buy Right Now ",
        "author": "Sam Rutherford",
        "text": [
            "<p>After one of the most jam-packed product release seasons ever, all the big phones are finally out. But which one is right for you? Between multiple releases from Apple, Samsung, and Google, Huawei’s continued global push, and old names like Nokia and <a href=\"https://gizmodo.com/palms-ultra-tiny-phone-is-an-absolute-snack-1830528949\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/palms-ultra-tiny-phone-is-an-absolute-snack-1830528949', {metric25:1})\">Palm</a> popping up again, there’s a seemingly an endless number of choices. And to make things even more daunting, with several phones pushing the $1,000 mark, making a hasty purchase can quickly turn into an expensive mistake.<br></p>",
            "<p>But don’t worry, we’ve got your back because we’ve tested and reviewed all of this year’s most important phones so you don’t have to. So here are our top picks for the best phone you should buy right now.</p>",
            "<p>What Google’s Pixel 3 lacks in sheer specs, it more than makes up for in software thanks to incredible features like Night Sight, a built-in call screener, and all the other Pixel-specific tweaks that make Google’s homegrown phones the smartest and most considerate handsets on the market. And with things like Google’s AI-powered appointment booking service <a href=\"https://gizmodo.com/i-broke-google-duplex-but-its-still-impressive-1827131546\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/i-broke-google-duplex-but-its-still-impressive-1827131546', {metric25:1})\">Duplex</a>, the Pixel 3 is only going to get better.</p>",
            "<p>Even after notches became all the rage, <a href=\"https://gizmodo.com/samsung-galaxy-s9-review-the-best-android-phone-dont-n-1823575944#_ga=2.108489601.2086121615.1542667657-1681541265.1539891498\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/samsung-galaxy-s9-review-the-best-android-phone-dont-n-1823575944#_ga=2.108489601.2086121615.1542667657-1681541265.1539891498', {metric25:1})\">Samsung’s Galaxy S9</a> is still easily one of the best-looking phones on the market. However, class-leading design isn’t the only thing the S9 has going on. It was one of the first phones on the market sporting Qualcomm’s Snapdragon 845 chipset, and on its rear camera, Samsung created the first smartphone lens with a variable aperture to help capture best photos possible, no matter how much light is available. And while the S9 isn’t the newest phone on this list, because it’s been around for it, you can get a brand new S9 for as little as $520, or $640 for the S9+.</p>",
            "<p>Thanks to an increasing number of $1,000 phones, mid-range handsets have never been more important. And year after year OnePlus keeps pumping out affordable devices that are far and away the best handsets you get for around $500. And with the 6T, OnePlus is actually pulling further ahead thanks to a partnership with T-Mobile that puts OnePlus phones in carrier stores for the first time ever. And unlike previous handsets, the OP6T is the company’s first device with support for Verizon’s network too. You also get specs that match the best flagships out right now, an in-screen fingerprint reader, and a gorgeous OLED display with a notch that isn’t offensively large.</p>",
            "<p>If the OnePlus 6T doesn’t suit your fancy, consider the<strong> </strong><a href=\"https://gizmodo.com/the-xperia-xz2-is-the-best-phone-sony-has-made-in-years-1827049055#_ga=2.75377553.2086121615.1542667657-1681541265.1539891498\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-xperia-xz2-is-the-best-phone-sony-has-made-in-years-1827049055#_ga=2.75377553.2086121615.1542667657-1681541265.1539891498', {metric25:1})\">Xperia XZ2</a> and <a href=\"https://gizmodo.com/finally-a-perfect-phone-for-small-hands-1827851267#_ga=2.75377553.2086121615.1542667657-1681541265.1539891498\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/finally-a-perfect-phone-for-small-hands-1827851267#_ga=2.75377553.2086121615.1542667657-1681541265.1539891498', {metric25:1})\">XZ2 Compact </a>instead. With a Snapdragon 845 chip, 6GB of RAM and 64GB of storage, the standard XZ2 has all the specs you want in a flagship phone for just $500. And featuring Sony’s super powerful haptic vibration engine, the XZ2 has the power to add a rumble to pretty much any content you watch or listen to on your phone. Meanwhile, the XZ2 Compact might be the last bastion for people who still like small phones but don’t want to compromise on specs or performance. And unlike it’s bigger sibling, the XZ2 Compact is certified to work on GSM carriers like AT&amp;T and T-Mobile, and Verizon’s CDMA network as well.</p>",
            "<p>Note: We considered putting the Pocophone F1 here as well due to its flagship specs and incredible value, we haven’t had a chance to spend as much time with it as we’d like. Also, due to its very limited support for 4G LTE here in the U.S., it’s difficult to recommend.</p>",
            "<p>For years, Motorola’s G-series phones have been the kings of the budget phone world, and the G6 is a latest and greatest example of Moto’s dominance. Critically, the G6 boasts compatibility with all the major carriers, is available both unlocked and from brick-and-mortar wireless stores, and still retains important features like microSD card expandability and a headphone jack. Whether it’s for a young teen getting their first phone, or someone who just wants something simple and reliable the won’t blow your finances, the Moto G6 has got you.</p>",
            "<p>Starting at $350, the<a href=\"https://gizmodo.com/preview/nokia-7-1-review-solid-budget-simplicity-1830529419\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/preview/nokia-7-1-review-solid-budget-simplicity-1830529419', {metric25:1})\"> Nokia 7.1 </a>typically costs $100 more than the Moto G6, but it’s totally worth it. Because for the extra money, you get more base storage and RAM, better cameras, a bigger, brighter screen, and a much nicer design. And since the Nokia 7.1 is part of Google’s Android One program, that also means its software and security updates are managed by Google, and you won’t have to put up with any unwanted bloatware either. The major downsides to the Nokia 7.1 is that unlike the G6, it’s only available as an unlocked device from third-party retailers, and it doesn’t support CDMA networks like Verizon or Sprint.</p>",
            "<p>Like hypercars, hyper phones are handsets that are big, fast, and defined by excess. But if you want a phone that can handle everything home and work can throw at you, the Note 9 is it. It’s got a big, gorgeous 6.4-inch display, ridiculous battery life that lasts upwards of upwards of 14 hours on a charge, built-in iris scanners and a secure folder to hide sensitive documents, and of course Samsung’s S-Pen. The phone even comes with 128GB of base storage (and a microSD card slot), which is twice what you get from a similarly priced iPhone XS. And just in case that’s not enough, you can even turn the Note 9 into a mini desktop by hooking up a USB-C to HDMI cable to a nearby monitor.</p>",
            "<p>While this phone isn’t really an option for folks in the states since Huawei isn’t making a U.S. specific variant, the sheer technical superiority of the <a href=\"https://gizmodo.com/huaweis-mate-20-pro-is-absolutely-loaded-1829779386#_ga=2.70094611.2086121615.1542667657-1681541265.1539891498\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/huaweis-mate-20-pro-is-absolutely-loaded-1829779386#_ga=2.70094611.2086121615.1542667657-1681541265.1539891498', {metric25:1})\"><strong>Mate 20 Pro</strong></a> can’t be denied. That’s because even though it lacks a stylus, it has pretty much every other feature you’d ever need, and maybe even a few tricks you didn’t even know you wanted. We’re talking about full-on 3D face scanning tech, a fingerprint sensor that’s built into the screen, a new 7-nanometer chipset with dual NPUs, and even wireless charging that can be reversed in order to power up other devices.</p>",
            "<p>With three new iPhones for 2018 along with two older models still on sale, choosing the right phone from Apple is actually a bit trickier than normal. However, with a somewhat reasonable (for Apple) price of $750, the same A12 processor, FaceID tech, and 64GB of storage you get from its more expensive siblings, the iPhone XR is our top recommendation for people who want a new Apple handset. As an added bonus, the iPhone XR also boasts battery life that’s about an hour longer than the $1,000 iPhone XS, and it comes it a bunch of fun colors.</p>",
            "<p>For people who want a little more, the<strong> </strong><a href=\"https://gizmodo.com/the-iphone-xs-is-forever-1829305262\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-iphone-xs-is-forever-1829305262', {metric25:1})\">iPhone XS or XS Max</a> are the clear upgrades to the XR, just know that you’ll need to shell out at least an extra $250 to get one. The main benefits when moving up to the iPhone XS and XS Max is a significantly more vibrant and higher resolution OLED screen that’ll make all sorts of content look better, and a second rear camera with a 2x zoom to help bolster your mobile photo toolkit. Also, thanks to new stronger glass backs and an IP68 rating for water-resistance (versus the XR’s IP67 rating), Apple’s high-end iPhones should also be slightly more durable than the iPhone XR.</p>"
        ]
    },
    {
        "title": "It’s Kind of Brilliant How This Dual-Screen Smartphone Avoids the Notch",
        "author": "Sam Rutherford",
        "text": [
            "<p>2018 may have been a pretty sedate year for phones, with many flagships including the <a href=\"https://gizmodo.com/samsung-galaxy-s9-review-the-best-android-phone-dont-n-1823575944\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/samsung-galaxy-s9-review-the-best-android-phone-dont-n-1823575944', {metric25:1})\">Galaxy S9</a> and <a href=\"https://gizmodo.com/the-iphone-xs-is-forever-1829305262\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-iphone-xs-is-forever-1829305262', {metric25:1})\">iPhone XS</a> trotting out essentially the same design for a second tour of duty. But as we move closer to 2019, phones like the <a href=\"https://gizmodo.com/this-gorgeous-all-screen-phone-shows-how-the-notch-dies-1829737051\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/this-gorgeous-all-screen-phone-shows-how-the-notch-dies-1829737051', {metric25:1})\">Oppo Find X</a> and this wonderful, new dual-screen device suggest things could get a lot more interesting real soon.</p>",
            "<p>Created by Chinese smartphone company Nubia (which is partially owned by ZTE), the <a href=\"http://www.nubia.com/nubiaX\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'http://www.nubia.com/nubiaX', {metric25:1})\">Nubia X</a> solves the problem of where to put the selfie cam on an all-screen phone by dodging the question entirely. That’s because instead of using the main 6.1-inch LCD screen and a front-facing camera to take selfies, you can simply flip the phone around and use its rear camera and 5.1-inch secondary 1520 x 720 OLED screen on the back to frame up your shot.</p>",
            "<p><span class=\"twitter-embed\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=twitter-1057555736203415552&amp;autosize=1\" height=\"159\" id=\"twitter-1057555736203415552\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"500\" frameborder=\"0\"></iframe></span></p>",
            "<p>This solution might sound like overkill, but in some ways, it’s a much simpler overall design. Cameras are quickly becoming much more difficult and expensive to make than screens, and by only including one module on the back, it gives phone makers the ability to focus more on delivering a single, high quality photography experience.</p>",
            "<p>On top of that, with the prevalence of so many phones designed with glass panels in front and back, the Nubia X shouldn’t be much more fragile than a typical handset. Also, that extra display can be used for way more than just selfies. Nubia says its rear, always-on display can show off your favorite art or be used as clock, or it can double as a full-on second display with access to all your standard Android screens and apps.</p>",
            "<p>Inside, the Nubia X’s specs look pretty solid as well—featuring a Qualcomm Snapdragon 845 chip, 6GB/8GB of RAM, up to 128GB of storage, and a sizable 3,800 mAh battery. And because there’s no room in front or back for a traditional fingerprint sensor, Nubia opted for an in-screen fingerprint reader like we’ve seen on the <a href=\"https://gizmodo.com/oneplus-6t-review-the-no-bullshit-best-deal-in-smartph-1830066240\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/oneplus-6t-review-the-no-bullshit-best-deal-in-smartph-1830066240', {metric25:1})\">OnePlus 6T</a> and <a href=\"https://gizmodo.com/huaweis-mate-20-pro-is-absolutely-loaded-1829779386\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/huaweis-mate-20-pro-is-absolutely-loaded-1829779386', {metric25:1})\">Huawei Mate 20</a>.</p>",
            "<p>Unfortunately, there don’t seem to be any plans to bring the Nubia X stateside quite yet, but between this, multiple bendy phones in the works, and the r<a href=\"https://gizmodo.com/palm-returns-with-a-teeny-tiny-smartphone-to-help-you-d-1829751362\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/palm-returns-with-a-teeny-tiny-smartphone-to-help-you-d-1829751362', {metric25:1})\">ebirth of Palm</a> coming up, companies are really starting to put the fun back into phones again.</p>"
        ]
    },
    {
        "title": "OnePlus May Finally Get Its Chance to Talk You Out of Dropping $1,000 on a Smartphone",
        "author": "Sam Rutherford",
        "text": [
            "<p>OnePlus is well known among smartphone and tech enthusiasts, but more than four years after <a href=\"https://gizmodo.com/oneplus-one-review-an-unbelievably-fantastic-smartphon-1598476240\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/oneplus-one-review-an-unbelievably-fantastic-smartphon-1598476240', {metric25:1})\">releasing its first handset</a> and  partnering with <a href=\"https://www.youtube.com/watch?v=mpQIDeu1DCE\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.youtube.com/watch?v=mpQIDeu1DCE', {metric25:1})\">supermodels</a> and trendy fashion brands like Colette to help push its products, OnePlus still isn’t exactly a household name  in the U.S.</p>",
            "<p>However, according to <a href=\"https://www.cnet.com/news/oneplus-6t-will-launch-in-october-with-t-mobile-as-us-partner/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.cnet.com/news/oneplus-6t-will-launch-in-october-with-t-mobile-as-us-partner/', {metric25:1})\">a report from CNET</a> (that was later backed up by <a href=\"https://twitter.com/saschasegan/status/1030456514870484995\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://twitter.com/saschasegan/status/1030456514870484995', {metric25:1})\">PCMag’s Sascha Segan</a>), it seems OnePlus will make a big push at last into the American smartphone market by partnering with T-Mobile to sell the upcoming OnePlus 6T in retail stores later this fall.</p>",
            "<p>This would mark the first time a major U.S. carrier has agreed to sell a OnePlus phone in its stores. That would be a huge deal, because as Huawei CEO Richard Yu highlighted earlier this year at CES 2018, <a href=\"https://www.wsj.com/articles/why-the-u-s-smartphone-market-is-hard-to-crack-1515583800\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.wsj.com/articles/why-the-u-s-smartphone-market-is-hard-to-crack-1515583800', {metric25:1})\">more than 90 percent of U.S. smartphone sales occur via carrier channels</a>. That kind of dominance by carriers has left little room for smaller brands such as OnePlus to expand, a sentiment not lost on Huawei, which after years of trying to sell its phones directly via its website and other online retailers, saw deals with <a href=\"https://gizmodo.com/report-at-t-cancels-plans-to-sell-phones-from-chinese-1821898633\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/report-at-t-cancels-plans-to-sell-phones-from-chinese-1821898633', {metric25:1})\">AT&amp;T</a> and <a href=\"https://gizmodo.com/report-verizon-dumps-huawei-phones-as-us-government-pr-1822545973\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/report-verizon-dumps-huawei-phones-as-us-government-pr-1822545973', {metric25:1})\">Verizon</a> torpedoed due to security concerns from U.S. politicians.</p>",
            "<p>The partnership also makes a lot of sense for both parties, because by working with OnePlus, T-Mobile gets the opportunity to attract younger, more tech-savvy customers as it tries to further distance itself from AT&amp;T and Verizon. Additionally, since OnePlus has historically made  phones with global compatibility that rely on GSM networks, the company was really only able to choose between  T-Mo or AT&amp;T in the U.S.—unless it made some big changes with the upcoming OP6T.</p>",
            "<p>As for the rest of the world, OnePlus has recently seen rapid growth in Asia, which led to the company’s <a href=\"https://www.androidheadlines.com/2018/01/oneplus-doubled-its-revenue-to-1-4-billion-in-2017.html\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidheadlines.com/2018/01/oneplus-doubled-its-revenue-to-1-4-billion-in-2017.html', {metric25:1})\">revenue doubling to 1.7 billion in 2017</a>, while also surpassing both Samsung and Apple to become the <a href=\"https://9to5google.com/2018/07/31/oneplus-samsung-apple-india-sales-q2-2018/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://9to5google.com/2018/07/31/oneplus-samsung-apple-india-sales-q2-2018/', {metric25:1})\">number one premium phone  brand in India.</a></p>",
            "<p>Later this fall, if OnePlus arrives in T-Mo stores with a new phone, it could be poised to steal even more sales from expensive flagship phones by targeting customers who want solid, up-to-date specs, but are scared away by the $700-plus price tags seen on iPhones, Galaxy phones, and others. Reached by Gizmodo, a spokesperson for OnePlus declined to comment on any plans it may have with T-Mo: “We don’t comment on rumors or speculation,” they said.</p>",
            "<p>However, it must be said that T-Mo would only just be a start, because unless OnePlus adds  support for CDMA, it’s effectively punting on one-third of the U.S. smartphone market. But for people tired of the Apple/Samsung or AT&amp;T/Verizon duopolies, OnePlus’ partnership with T-Mobile could be just what the U.S. needs to help shake things up. </p>",
            "<p>[<a href=\"https://www.cnet.com/news/oneplus-6t-will-launch-in-october-with-t-mobile-as-us-partner/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.cnet.com/news/oneplus-6t-will-launch-in-october-with-t-mobile-as-us-partner/', {metric25:1})\">CNET</a>]</p>"
        ]
    },
    {
        "title": "OnePlus Killing the Headphone Jack Is More About Money Than Good Timing",
        "author": "Sam Rutherford",
        "text": [
            "<p>Look, I’m not going to say OnePlus is being greedy by axing the headphone jack on the upcoming OnePlus 6T. OnePlus is a company, and companies need to make money, or else they go away. But to say that the reason behind switching to wireless audio on the OP6T was largely down to “waiting for the right time” doesn’t exactly sit right, either.</p>",
            "<p>OnePlus is set to reveal its next phone on October 17, and in the run-up to the event, the company has been teasing details about the OnePlus 6T, like the inclusion of <a href=\"https://www.cnet.com/news/oneplus-6t-in-screen-fingerprint-sensor-confirm-on-display-exclusive/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.cnet.com/news/oneplus-6t-in-screen-fingerprint-sensor-confirm-on-display-exclusive/', {metric25:1})\">an in-screen fingerprint reader</a> and the <a href=\"https://www.techradar.com/news/the-oneplus-6t-wont-have-a-headphone-jack-but-battery-life-will-be-improved\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.techradar.com/news/the-oneplus-6t-wont-have-a-headphone-jack-but-battery-life-will-be-improved', {metric25:1})\">phone’s lack of a headphone jack</a>, the latter of which has a lot of smartphone fanatics up in arms, as the 6T would be the first phone from OnePlus without a 3.5mm port. </p>",
            "<p>In an interview between <a href=\"https://www.techradar.com/news/the-oneplus-6t-wont-have-a-headphone-jack-but-battery-life-will-be-improved\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.techradar.com/news/the-oneplus-6t-wont-have-a-headphone-jack-but-battery-life-will-be-improved', {metric25:1})\">Techradar</a> and OnePlus co-founder Carl Pei, Pei defended the choice by saying “[Removing the headphone jack] was a very controversial decision. We’re not doing it for the sake of doing it and because everyone else is. We believe now is the right time, as it’ll benefit the majority of our users while keeping the downside low.”</p>",
            "<p>Pei also added that based on a survey the company conducted earlier this year, 59 percent of users in the OnePlus community already owned wireless headphones of some sort. Now clearly, those numbers illustrate a shift from similar <a href=\"https://forums.oneplus.com/threads/the-oneplus-5t-lets-talk-about-the-headphone-jack.671594/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://forums.oneplus.com/threads/the-oneplus-5t-lets-talk-about-the-headphone-jack.671594/', {metric25:1})\">data gathered by OnePlus</a> in November 2017, when apparently less than 20 percent of its users used wireless headphones. But still, I can’t help but think about those other 41 percent of users still using wired headphones, or the 70 percent of users who  claimed a year ago that audio quality was a bigger priority. </p>",
            "<p>When the <a href=\"https://gizmodo.com/oneplus-6-review-the-best-android-phone-that-wont-dest-1826158898\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/oneplus-6-review-the-best-android-phone-that-wont-dest-1826158898', {metric25:1})\">OnePlus 6</a> came out earlier this spring, it still had a headphone jack. Pei himself even made a couple jokes about headphone jacks during the <a href=\"https://youtu.be/QpFcf7uBacI?t=4445\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://youtu.be/QpFcf7uBacI?t=4445', {metric25:1})\">OnePlus 6's announcement event.</a> So what changed between last May and now, aside from a slight shift in demographics, that would encourage OnePlus to finally kill the headphone jack?</p>",
            "<p>My guess—and this is only a theory—is that the turning point happened when OnePlus <a href=\"https://forums.oneplus.com/threads/introducing-the-oneplus-6-and-bullets-wireless.834107/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://forums.oneplus.com/threads/introducing-the-oneplus-6-and-bullets-wireless.834107/', {metric25:1})\">released the Bullets Wireless earbuds</a> alongside the OnePlus 6. Prior to that, OnePlus didn’t really have a track record when it came to making bluetooth headphones. But then <a href=\"https://www.theverge.com/2018/5/21/17375546/oneplus-bullets-wireless-review-bluetooth-earphones\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.theverge.com/2018/5/21/17375546/oneplus-bullets-wireless-review-bluetooth-earphones', {metric25:1})\">a few</a> <a href=\"https://www.techradar.com/reviews/oneplus-bullets-wireless\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.techradar.com/reviews/oneplus-bullets-wireless', {metric25:1})\">breathless</a> <a href=\"https://www.androidcentral.com/oneplus-bullets-wireless-headphones-review\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidcentral.com/oneplus-bullets-wireless-headphones-review', {metric25:1})\">reviews</a> came out and suddenly the need for a headphone jack didn’t seem quite as vital. And hey, if OnePlus sells a few more wireless headphones because of that decision, that’s just a bonus right?</p>",
            "<p>On top of that, Bullets Wireless are actually pretty decent wireless headphones, especially for the price. But they were never my thing because I’ve always balked at the idea of “wireless” headphones that still leave you with a cord dangling from your head. </p>",
            "<p>You can’t completely factor out the tired cliche about the 3.5mm jack taking up space, either. Less ports sticking into the body means more room for things like bigger batteries and in-screen fingerprint sensors. Though I’ve got to say, if OnePlus doesn’t also <a href=\"https://forums.oneplus.com/threads/lets-talk-about-wireless-charging.676075/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://forums.oneplus.com/threads/lets-talk-about-wireless-charging.676075/', {metric25:1})\">reverse its stance on wireless charging</a> (or lack thereof), it will seem a bit strange to simultaneously move to Bluetooth audio while still making the act of jamming a power cable into the phone a necessity. </p>",
            "<p>At this point, it’s kind of hard to get really mad about the change. It’s not about courage, it’s about money, and the <a href=\"https://techcrunch.com/2018/02/01/apple-5-5-billion-revenue-other-products-q1-2018/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://techcrunch.com/2018/02/01/apple-5-5-billion-revenue-other-products-q1-2018/', {metric25:1})\">billions of dollars Apple has made from selling Airpods</a> has essentially outvoted headphones of the wired variety into obsolescence. OnePlus is just following Apple’s business model. And while making the move into wireless audio two years after Apple did certainly says something about timing, OnePlus can’t divorce itself from the upside to its financials that decision will have either. Both things are playing a big part, and unless enough people get upset about it, it’s probably going to work.</p>"
        ]
    }
]