[
    {
        "title": "\n\t\tGoogle will announce hardware on October 9, new Pixel phones expected\t",
        "author": [
            "\n\t\t\t\t\t\tJulian Chokkattu\t\t\t\t\t"
        ],
        "text": [
            "<p>Google’s <a href=\"https://store.google.com/\">annual hardware launch</a> event will take place on October 9 in New York City. The company sent out invites to media (including Digital Trends) confirming the date, which had leaked in August.</p>",
            "<p>The date and venue are a change of pace, considering the past two Google October events have taken place in San Francisco on October 4. The company is widely expected to launch a slew of hardware products ranging from smartphones to smart home devices.</p>",
            "<p>The highlights will be the <a href=\"https://www.digitaltrends.com/mobile/google-pixel-3-news/\">Pixel 3 and Pixel 3 XL</a>, successors to last year’s critically acclaimed <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-review/\">Pixel 2</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-xl-review/\">Pixel 2 XL</a> smartphones. There have been an alarmingly high number of leaks for the Pixel 3 series, and if true, we know quite a lot about the phones. It may be due to carelessness. Recently, someone left a Pixel 3 in the back of a Lyft. Separately, a group in Russia claims to have gotten its hands on a shipment of Pixel 3 XL smartphones and even posted an unboxing video, showing <a href=\"https://www.youtube.com/watch?v=M77bSscDJpo\">everything you get in the box</a>.</p>",
            "<p>The Pixel 3 XL is expected to have a notch design, where a cutout at the top of the screen houses the front-facing camera. This has garnered some criticism, as the notch on the Pixel 3 XL looks unusually large. The smaller Pixel 3 may have a more traditional design, with slimmer bezels on the top and bottom. You can learn more about the two phones in our <a href=\"https://www.digitaltrends.com/mobile/google-pixel-3-news/\">Pixel 3 roundup</a>.</p>",
            "<p>As the new Pixel 3 devices are rumored to support wireless charging, leaks suggest Google will also announce <a href=\"https://www.digitaltrends.com/mobile/google-pixel-stand-news/\">the Pixel Stand</a> — a wireless charging dock that also turns the phone’s screen into a Smart Display for Google Assistant, similar to what Lenovo offers with <a href=\"https://www.digitaltrends.com/smart-home-reviews/lenovo-smart-display-review/\">its Smart Display</a>.</p>",
            "<p>Google is also rumored to be launch its <a href=\"https://www.digitaltrends.com/home/google-assistant-smart-display/\">own Smart Display</a> to compete with the likes of <a href=\"https://www.digitaltrends.com/smart-home-reviews/amazon-echo-show-2017-review/\">Amazon’s Echo Show</a>. It will essentially be a Google Home with a screen; you’ll be able to access YouTube videos with your voice thanks to Google Assistant, and make video calls with Google’s Duo app.</p>",
            "<p>Other products rumored to be on the docket are <a href=\"https://www.digitaltrends.com/computing/google-pixelbook-2-october/\">two Pixelbooks</a>, which are <a href=\"https://www.digitaltrends.com/laptop-reviews/google-pixelbook-review/\">Chromebooks</a> from Google running Chrome OS, and a potential followup to the <a href=\"https://www.digitaltrends.com/headphone-reviews/google-pixel-buds-review/\">Google Pixel Buds</a>. There’s likely more Google will announce at the event that we haven’t heard much about — for example, last year <a href=\"https://www.digitaltrends.com/photography/google-clips-life-logging-camera/\">Google’s Clips announcement</a> came as a surprise.</p>",
            "<p>Digital Trends will be on the scene in New York on October 9, reporting on everything Google will announce, so stay tuned.</p>"
        ]
    },
    {
        "title": "\n\t\tHere’s how to buy the new Google Pixel 3 and Google Pixel 3 XL\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>Google finally unveiled the new <a href=\"https://www.digitaltrends.com/mobile/google-pixel-3-news/\">Google Pixel 3 and Pixel 3 XL</a> — the company’s latest and greatest set of smartphones, featuring an upgraded processor and improved internals, a new design, and more.</p>",
            "<p>Now that the new phones are out, however, you might be wondering how you can get your hands on them for yourself. The phones are available in a few different colors, including “just black,” “clearly white,” and “not pink.” In case you’re wondering how to get the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Google Pixel 3</a> or <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-xl-review/\">Google Pixel 3 XL</a> for yourself, we put together this guide.</p>",
            "<p>As you might expect, the Google Pixel 3 and Pixel 3 XL are both now available for purchase <a href=\"https://store.google.com/us/product/pixel_3\">unlocked through the Google Store</a>. Here’s a rundown of Pixel 3 unlocked pricing.</p>",
            "<p>The unlocked version of the phone is compatible with all major carriers — so if you’re on T-Mobile, Sprint, or AT&amp;T, that’s how you’ll have to get the phones, considering the fact that they’re exclusive to Verizon.</p>",
            "<p>As mentioned, the Google Pixel 3 and Pixel 3 XL are exclusively available on Verizon, meaning that you won’t be able to get them through any other carrier except Google’s own Project Fi.</p>",
            "<p>The Google Pixel 3 and Pixel 3 XL are now fully available straight through the Verizon website or in a Verizon store, so if you’re a Verizon customer or willing to make the switch, then you can pull the trigger now.</p>",
            "<p>Here’s a rundown of pricing for the Google Pixel 3 and Pixel 3 XL on Verizon.</p>",
            "<p>If you’re thinking about picking up the new Google Pixel 3 or Pixel 3 XL, this is the perfect time. Verizon is offering $400 of either phone with no trade-in required for Black Friday. The offer is available online now, and will be available in Verizon stores beginning Friday, November 23.</p>",
            "<p>As you would expect, the Google Pixel 3 is also available <a href=\"https://fi.google.com/about/phones/#pixel-3\">through Google’s own Project Fi</a>, and it’s available for the same price as it is unlocked — so you’ll save a few bucks through Google compared to through Verizon. When it comes to deals, Project Fi is also offering a $799 service credit when you buy two Pixel 3 or Pixel 3 XL phones and add a new member to an existing group plan.</p>",
            "<p><em>Updated on November 22, 2018: Added information about Verizon Black Friday promotion. </em></p>"
        ]
    },
    {
        "title": "\n\t\tThe best Pixel 3 cases and covers\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>If you plan to buy one of Google’s <a href=\"https://www.digitaltrends.com/mobile/google-pixel-3-news/\">Pixel 3</a> smartphones, then you had better look into protecting it. The glass back, which enables Qi wireless charging to work, is also going to be breakable, so it’s a smart move to safeguard it. We’ve had a quick peek at the available options, tried out a handful, and these are the best <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Pixel 3</a> cases so far for the brand-new phone. You may also be interested in safeguarding the display with one of the <a href=\"https://www.digitaltrends.com/mobile/best-pixel-3-screen-protectors/\">best Pixel 3 screen protectors</a>.</p>",
            "<p>We’re still testing out a variety of other Pixel 3 cases, but so far, these are top two favorites.</p>",
            "<p>The official fabric case from Google is the one we’ve been using the most with our Pixel 3. Not surprisingly, it’s a perfect fit, with generous openings for easy access to the fingerprint sensor and USB-C port. In fact, there’s a gap above the USB-C port that makes it easy to swipe up from the bottom and use Android 9.0 Pie’s new navigation shortcuts. It doesn’t interfere with that stunning camera or the wireless charging either. The case features a plastic shell that’s slightly flexible, wrapped in a durable, gray fabric with soft, mint green padding on the inside. The power button cover is mint green to match the white Pixel 3, and there are blue, black, and pink versions of this case as well. The volume rocker protrudes a little, but it’s camouflaged by the finish. The case is almost flush with the screen at the front and it’s slim, so we wouldn’t expect much drop protection from this case, but it will ward off scrapes, it’s very comfortable to hold, and it definitely enhances your grip.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/862bbf335ee6f5c6b85424d31fea81cb952199d6/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Google\">Google</a></p>",
            "<p>With photography specialists in mind, Moment make protective cases for the Pixel 3 that look stylish and also support Moment’s lens range, which includes Wide, Tele Portrait, and Superfish lenses that start at $90. The shell is made of tough, fairly thick plastic with well-defined button covers and precise openings. There’s plenty of room around the USB-C port and a sloping cutout for the fingerprint sensor. The surround of the camera lens has a special locking system that makes it easy to clip on extra lenses, but these cases can be used without them and still look good. Our pick is the one with the flecked cream finish with the tan leather, but there’s a black case with a canvas panel on the back, as well as a black case with a walnut panel. With microfiber on the inside and a raised lip around the screen, we think this case should offer decent drop protection.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/70ec8843b4ac1413dac75cce9233e10701e9aa94/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a> <a href=\"https://www.digitaltrends.com/go/a76a5d313c9045cc2e7a980bfd6a9f3e7884c66b/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Moment\">Moment</a></p>",
            "<p>If you’re a fan of the Pixel 3’s look and you don’t want to cover it entirely, then you might fancy this translucent offering from Incipio. Crafted from its proprietary Flex2O material, this is a lightweight but highly durable case for the Pixel 3. The bottom portion of the case echoes the Pixel’s two-tone finish to add a touch of style, but it’s a fairly plain offering with accurate openings, button covers, raised bezels to protect the screen, and a subtle Incipio logo on the side. It offers protection against scratches and drops from up to 3 feet.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/56832b9286838ccc2c29c20bba813dc1a79e60af/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Incipio\">Incipio</a></p>",
            "<p>This case from Speck strikes a nice balance between protection and the desire to show off your Pixel 3’s style. It’s a completely clear case with an anti-yellowing coating and it promises to protect your Pixel 3 from drops of up to 8 feet. The bumper section is reinforced with a dual-layer shock-absorbing barrier, and there’s a raised bezel all the way around the screen to ensure it never touches down. It’s quite a chunky case that definitely adds some bulk, but it’s comfortable to hold and highly protective. There are no issues with the generous openings, and it won’t interfere with <a href=\"https://www.digitaltrends.com/mobile/best-wireless-phone-chargers/\">wireless charging</a> either.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/594095d982f20db3ce307694a9063d6d8af96b16/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Speck\">Speck</a></p>",
            "<p>We’re big fans of Nomad’s Horween leather cases and they age beautifully, developing their own patina over time. But don’t be fooled into thinking that these Pixel 3 cases are all style and no substance because there’s a tough polycarbonate shell inside, with a TPE bumper that can cope with falls of up to 6 feet. There’s plenty of room around the cutouts, and you’ll find subtle button covers for the power and volume rocker. The case also extends a little at the front to protect the screen. Wireless charging works just fine with this case on.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/636a080c6012d01946e356b636196da7819ee4b6/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Nomad\">Nomad</a></p>",
            "<p>If you tend to fumble your phones a lot, then this highly protective case from Tech21 is for you. When your Pixel 3 is wearing this cas,e you can drop it with impunity, because it will safeguard your phone from falls of up to 12 feet (not that you’d actually want to). Tech21 imbues the flexible bumper with its special FlexShock material, which will prevent any impact shock from penetrating. It’s a little chunky, but you’ll find good-sized openings and tactile button covers that are easy to find. Our pick is the eye-catching ultraviolet version, but you can opt for a more reserved smokey black if you prefer. Each is translucent, with a special check pattern on the back panel.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/9b78da7f959c91e6854a035517b2c8e6cd1e9acc/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Tech21\">Tech21</a></p>",
            "<p>Here’s a relatively tough case that combines malleable TPU with a hard polycarbonate frame for solid protection from knocks and falls. The matte, textured finish on the back enhances grip and won’t pick up grubby fingerprints. There’s also an extended lip around the screen to prevent it from touching down on any surface. Tapered openings for the fingerprint sensor and camera and well-defined button covers round out a good case.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/d7ce52d2c6a6270c016b556d4b84effe8b202661/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a> <a href=\"https://www.digitaltrends.com/go/ca27332905d5ade30c3ca1fa4e72266ed1f5e468/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Spigen\">Spigen</a></p>",
            "<p>For people who hate thick cases and prominent branding, the Totallee Thin case could be ideal. It’s extremely thin at 0.02 inches thick, it’s so light you’ll barely feel it, and it has no logos or garish patterns. The matte black version is pictured, but it also comes in frosted clear and glossy clear varieties. You can’t expect solid drop protection from a case this slight, but it will guard against scratches and minor bumps.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/faecc577725e1e2ca9e1bd954994bf49e59735b8/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Totallee\">Totallee</a></p>",
            "<p>This crystal-clear case from Ringke is very affordable, but still offers reasonable protection, with a hard, transparent polycarbonate back panel and a flexible, clear TPU bumper. The corners are reinforced for impact protection, and there’s a lanyard hole for anyone who wants to attach a strap. You’ll find accurate cutouts and thin button covers offering easy access to everything. You can also pick up this case with a smoke black translucent bumper.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/e19bcf715bfbbb7bba4c19f788dcb7d15aa09d26/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>You may like the eye-catching, ridged look of this Single Fit Label Series case from VRS Design. It’s like a small, tough suitcase designed to envelop your Pixel 3 and guard it from drop damage or scratches. It features raised edges around the screen, tactile button covers, and beveled openings for the fingerprint sensor and camera. You can pick it up in white or black and each case features a burst of color in the red/orange label tag.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/45acd00ca8ff773b342633bb8bd61e71fdf6f7f1/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"VRS Design\">VRS Design</a> <a href=\"https://www.digitaltrends.com/go/2a2083c08daa9b8b78d263314577301de0bdac22/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>"
        ]
    },
    {
        "title": "\n\t\tGoogle Pixel 3 vs. Pixel 2 vs. Pixel: Picking the perfect phone for you\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>As the developer of Android, Google turns out the <a href=\"https://www.digitaltrends.com/mobile/best-android-phones/\">slickest Android phones</a>. Snag a Pixel and you don’t have to worry about <a href=\"https://www.digitaltrends.com/mobile/are-android-devices-really-insecure-we-asked-some-experts/\">Android security</a> or <a href=\"https://www.digitaltrends.com/mobile/what-is-android-fragmentation-and-can-google-ever-fix-it/\">fragmentation</a> — you can simply enjoy a silky smooth, swiftly updated slice of Android heaven.</p>",
            "<p>The original Pixel is getting on a bit and the <a href=\"https://www.digitaltrends.com/mobile/google-pixel-3-news/\">Pixel 3</a> offers some upgrades over the still-excellent Pixel 2. If you’re thinking of upgrading, or wondering if last year’s Pixel might be good enough, then we have you covered right here. Learn exactly what separates the three Pixel generations as we compare them.</p>",
            "<p>A look at the spec sheet reveals the Pixel 3 has the popular Qualcomm Snapdragon 845 processor inside — the same chip you’ll find in everything from <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Samsung’s Galaxy Note 9</a> to <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz3-review/\">Sony’s Xperia XZ3</a>. It’s fast and plenty powerful. The Pixel 2 has last year’s Snapdragon 835 and the original Pixel has the Snapdragon 821. Each new generation of Qualcomm’s processor brings speed boosts and power efficiency enhancements. The Pixels all have 4GB of RAM.</p>",
            "<p>There’s 64GB or 128GB of storage in the Pixel 2 and Pixel 3, and you can also get a 128GB Pixel. The original, entry-level Pixel offered just 32GB of storage, which is definitely not enough, especially since there’s no MicroSD card slot in any of these phones.</p>",
            "<p>Battery size hasn’t changed much, going from 2,770mAh in the original to 2,700mAh in the Pixel 2 to 2,915mAh in the Pixel 3. Although it has a slightly larger screen to power, it also boasts better power efficiency. Sadly, these are all phones that will require daily charging, but the Pixel 3 is the only one to offer support for Qi wireless charging.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>Google’s understated style could also be described as dated. It has been slow to react to the <a href=\"https://www.digitaltrends.com/mobile/bezel-less-phone-comparison/\">bezel-less trend</a>, with each Pixel release featuring unashamedly large bezels around the screen compared to contemporaries. The Pixel 3 is certainly the most modern-looking of the trio. While the back of the Pixel 2 had a two-tone finish that combines matte aluminum with a glass portion at the top, the Pixel 3 is all glass. In the original Pixel, the glass took up perhaps a third of the back with the fingerprint sensor embedded in it, but in the Pixel 2, that glass portion shrank and the fingerprint sensor was found in the metal below. The Pixel 3 retains a similar style, but the back is all glass now. Only the original Pixel had a 3.5mm headphone jack, the newer Pixels rely on a single USB-C port instead.</p>",
            "<p>The original Pixel was only splash-resistant, but the Pixel 2 and Pixel 3 can be fully submerged in water without sustaining any damage. The relatively small size makes each Pixel easy to handle, and the original Pixel and the Pixel 2 should cope with falls better than their more delicate successor. The Pixel 2 and 3 both boast Gorilla Glass 5, while the original Pixel has Gorilla Glass 4.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>All three of the Pixels boast OLED screens, but while the Pixel 2 and original Pixel have 5-inch displays with 1,920 x 1,080-pixel resolutions, the Pixel 3 has a bigger, 5.5-inch display with a resolution of 2,160 x 1,080 pixels. The shift to a 19:9 aspect ratio, from 16:9 in the first two Pixels, gives you a decent extra chunk of screen real estate without increasing the size of the handset — in fact, the Pixel 3 is slightly smaller.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>The Pixel 2 has been our <a href=\"https://www.digitaltrends.com/mobile/best-camera-phones/\">reigning camera phone champion</a> for the last year. Despite relying on a single 12.2-megapixel lens, it takes consistently excellent shots in all kinds of different conditions — and it appears Google has stuck with it for the Pixel 3. The original Pixel was no slouch either, with a 12.3 megapixel camera. The Pixel 3 offers a range of new and exclusive A.I. smarts in the camera that enable it to snap shots before and after you press the shutter button, so it can choose the best one, where your subject is facing the camera, smiling, and has their eyes open. There’s also an A.I.-enhanced zoom capability, automatic subject tracking, so you don’t have to tap to refocus if you or your subject move, and improved low-light performance.</p>",
            "<p>The first two Pixels have 8-megapixel front-facing cameras, but the Pixel 3 kicks it up a notch with a dual-lens, front-facing camera that pairs two 8-megapixel lenses, one telephoto and one wide angle. That enables you to get a solid bokeh effect, with blurred backgrounds on your portrait photos. The second lens is wide angle, allowing for wider group selfie shots, or enabling you to capture more of your background.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>Google’s Pixel phones are mercifully free of manufacturer meddling, with the purest stock Android, which enables some of the best performance you’ll see on an Android phone. They’re also the first devices to get software updates, as Google can roll them out whenever it likes. We’re giving the Pixel 3 the win here because it will continue to be updated for longer than the other two, but the software experience on these phones is close to identical, with <a href=\"https://www.digitaltrends.com/mobile/android-9-pie-review/\">Android 9.0 Pie</a> on all of them.</p>",
            "<p>Some of the new Google Assistant capabilities, like the ability to screen your calls to weed out spam and the ability to make calls and makes restaurant reservations for you, will be rolling out on the new Pixels first.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>Google has something of a no-frills approach to its smartphones, preferring to focus on a slick, well-rounded experience. While there are no glaring flaws here, there also isn’t much to point to in terms of special features. The Pixel 3 sets itself apart from the other two with its dual-lens selfie-camera and the A.I. enhancements in the main shooter.</p>",
            "<p>The Pixel 3 is also the only one with Qi wireless charging support, and if you charge it using a Google Pixel Stand, you get access to schedule and commute information and more via one-touch shortcuts or voice commands.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>The first two Pixel phones cost $650 at launch for the lowest-capacity model, but the original Pixel can be found for significantly less now and we expect to see price drops on the Pixel 2, now that the Pixel 3 is here. The Pixel 3 costs significantly more at $800 for the 64GB version and $900 for the 128GB version.</p>",
            "<p>Stock issues impacted the original Pixel and the Pixel 2 as Google seemed to be caught off guard by the demand, but we don’t expect to see a repeat with the Pixel 3. Google has offered each Pixel unlocked and ready for use on any major U.S. carrier, and you can buy the Pixel 3 on an installment plan if you prefer.</p>",
            "<p>It’s somewhat surprising to see how little the Pixel has changed in three generations. The Pixel 3 is definitely the best of the bunch, but we’re talking about refinements here, with a slightly more modern design that squeezes in more screen and a better front-facing camera. It’s also faster and has a little more stamina than its predecessors, but there are no giant leaps. If your budget is limited and you can snag a discounted Pixel 2, we think it will serve you well for some time to come. If you’re looking to upgrade, we think you’ll feel the difference if you’re trading in an original Pixel, but Pixel 2 owners can stick with that model for another year.</p>"
        ]
    },
    {
        "title": "\n\t\tGoogle Pixel 3 vs. Samsung Galaxy S9: Which smaller Android flagship is best?\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>There are plenty of contenders in the <a href=\"https://www.digitaltrends.com/mobile/pixel-3-xl-vs-galaxy-note-9-oneplus-6t-mate-20-pro/\">Android heavyweight division</a>, but bigger isn’t always better. Unfortunately, if you’re looking for a truly great Android phone and you don’t want something that’s too big to manage one-handed, then your choices are a bit limited.</p>",
            "<p>Arguably the two best pocket-friendly Android phones come from Samsung and Google. But which is better? Find out as we pit Google Pixel 3 versus the Samsung Galaxy S9 in a variety  of categories to pick a winner.</p>",
            "<p>It’s no surprise to find that both these phones feature this year’s most popular flagship processor — the Qualcomm Snapdragon 845. They also both have 4GB of RAM. You can expect smooth performance and no issues running the latest games and apps with either phone, however, the Pixel 3 feels considerably smoother, thanks to Google’s software skills. It also performed slightly better in our benchmark tests. While you can pick up either with 64GB or 128GB of storage, the Galaxy S9 also has a 256GB variant and has a Micro SD card slot for expansion.</p>",
            "<p>Sadly, battery life is an Achilles’ heel for both phones. The S9 has a touch more capacity, but whichever one you choose, busy days will see a charge deplete well before bedtime. Both support fast charging, but the Pixel 3 charges more quickly than the S9. Both also support Qi wireless charging at up to 10W.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>Samsung has refined its curved design to near perfection in the Galaxy S9. The screen curves into the metal frame and so does the glass back, and it feels great in hand. The fingerprint sensor is on the back, just below the central camera lens. The front is almost completely screen, with thin slivers of bezel top and bottom.</p>",
            "<p>The Pixel 3 is a lot less alluring at first glance, but the etched glass back makes it comfortable to hold and also allows it to duck the usual fingerprint smudgefest. There’s a central fingerprint sensor on the back, but the camera lens is at the top left. The screen on the front is slightly smaller than the S9’s and there are bigger bezels top and bottom, though this does allow for front-facing speakers.</p>",
            "<p>Comparing the two, the S9 is a tiny bit bigger in every direction and a touch heavier. We find the Pixel 3 more comfortable to handle. It’s also a little too easy to accidentally cover the bottom-firing speaker on the S9 when you hold it in landscape to watch a movie or play a game. Your pick here will likely come down to personal preference and you should try to get your hands on both before choosing. The S9 certainly has more style, but the Pixel 3 feels just right.</p>",
            "<p>They’re both glass, so you’ll want a <a href=\"https://www.digitaltrends.com/mobile/best-pixel-3-cases/\">case for protection</a>. They also both have IP68 ratings, which means you don’t have to worry about rain or even submersion in shallow water.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>It’s a testament to Samsung’s design skill that it has managed to pack a 5.8-inch screen into the Galaxy S9. Even the ill-fated Note 7 only had a 5.7-inch screen, though it’s important to remember that screen size is measured diagonally, and one of the ways modern smartphone makers have packed bigger screens in is to stretch the aspect ratio. In other words, they’re taller but not as wide. The S9 has an 18.5:9 aspect ratio, while the Note 7 was 16:9. The Pixel 3 has a 5.5-inch screen with an 18:9 aspect ratio.</p>",
            "<p>Samsung’s AMOLED technology has led the field in smartphone screens for years, but the competition is catching up. Google also has an OLED screen in the Pixel 3, but at a resolution of 2,160 x 1,080 pixels, it isn’t quite as sharp as the S9’s display, which goes up to 2,960 x 1,440 pixels. Even with the extra size, the S9 scores a pixel-per-inch (PPI) rating of 570, compared to 443 for the Pixel 3.</p>",
            "<p>Both these displays are gorgeous and work well for reading, movies, or games, but Samsung’s S9 display has the edge.</p>",
            "<p><strong>Winner: Samsung Galaxy S9</strong></p>",
            "<p>On paper, both have two single-lens main cameras rated around 12 megapixels, and both are good, but the Pixel 3 gets consistently better shots than the Galaxy S9. In fact, the Pixel 3 is our reigning <a href=\"https://www.digitaltrends.com/mobile/best-camera-phones/\">camera phone champion</a>. It’s very fast and easy to use, enabling you to get wonderful photos without any fiddling. Google’s software smarts allow it to stitch together multiple shots to ensure every photo is sharp, with low noise and perfect contrast. There’s an excellent portrait mode that blurs the background and captures lovely photos of people. It also performs brilliantly in low light thanks to Night Sight.</p>",
            "<p>The Galaxy S9 camera is no slouch. It has a variable aperture that enables it to get the most from different lighting conditions, as well as a portrait mode, called Selective Focus, but it struggles to compete with the Pixel 3 on that front. There are also a lot of extras, like Super Slow Motion, which is very cool, and <a href=\"https://www.digitaltrends.com/mobile/ar-emojis-samsung-galaxy-s9-test/\">AR Emojis</a>, whichares not. The Pixel 3 wins the front-facing camera battle as well, with dual 8-megapixel lenses, which enable you to take wide selfies, ideal for squeezing in groups or getting some background into your selfies. Throw in the fact that you get free, unlimited, full-resolution photo and video storage with the Pixel 3 and it’s a clear winner here.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>If your idea of a Samsung phone is TouchWiz, then you’ll be glad to know that the manufacturer has overhauled its user interface and slimmed things down significantly. The S9 launched with Android 8.0 Oreo and Samsung’s Experience user interface over the top. Samsung adds some customization options and features that are useful, and some that aren’t. We’re also not sold on the usefulness or usability of Samsung’s apps compared to Google’s apps, and Bixby is light-years behind Google Assistant. Although an exception worth noting here is Samsung Pay, which has much wider compatibility at point-of-sale than <a href=\"https://www.digitaltrends.com/mobile/what-is-google-pay/\">Google Pay</a> does.</p>",
            "<p>The Pixel 3 launched with Android 9.0 Pie and some exclusive Google software features like Now Playing, which tells you what song is playing, and Screen Call, which can screen calls for you, giving you a real-time transcript. The Android experience on the Pixel 3 is as Google intended, and it’s by far the slickest we’ve ever experienced on an Android phone. The S9 is set to get Android 9.0 Pie and the new One UI at the time of writing. Going forward the Pixel 3 will get both security and Android feature updates much faster than the S9 will.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>We’ve mentioned Now Playing and Screen Call, and we’ve also discussed the unique features in the Pixel 3’s camera. Night Sight was added as an update after release, but there’s one more A.I. feature we’re still waiting for: <a href=\"https://www.digitaltrends.com/mobile/google-duplex-hands-on/\">Google Duplex</a>, which will enable Google Assistant on your Pixel 3 to make appointments or reservations for you.</p>",
            "<p>Samsung offers a lot more in the way of special features, but it feels like quantity over quality. If you’re interested in having your phone double up as a desktop, then DeX mode might pique your interest. We aren’t impressed by Bixby or AR Emojis, but we do love the Super Slow Motion video option.</p>",
            "<p>Google’s special features are things we use frequently, whereas Samsung’s aren’t.</p>",
            "<p><strong>Winner: Google Pixel 3<br>\n</strong></p>",
            "<p>The Samsung Galaxy S9 starts at $720 and you can get it and use it with any major carrier. If you shop around, you’ll be able to find one for a fair bit less than that now. The Google Pixel 3 starts at $800, but we have also seen it discounted, so keep an eye out if you want to buy one. You can find the Pixel 3 at Verizon, or buy an unlocked handset that will work with any major carrier.</p>",
            "<p>The Google Pixel 3 is quite simply the <a href=\"https://www.digitaltrends.com/mobile/best-android-phones/\">best Android phone</a> you can buy right now, so it naturally wins out overall. It offers slick performance, amazing software features, and the best camera you’ll find in a smartphone. If you’re used to Samsung phones, and you find value in the extras that the S9 offers, then it could still be the right choice for you, especially since it’s likely to cost you a fair bit less. But we’d pick the Pixel 3 every time.</p>"
        ]
    },
    {
        "title": "\n\t\tKey settings you need to change on your brand-new Google Pixel 3 or 3 XL phone\t",
        "author": [
            "\n\t\t\t\t\t\tJulian Chokkattu\t\t\t\t\t"
        ],
        "text": [
            "<p>Got your hands on a new <a href=\"https://www.digitaltrends.com/mobile/google-pixel-3-news/\">Pixel 3 or Pixel 3 XL</a> smartphone? We’ve rounded up a few settings we think you should tweak or turn on to make the best use of your new Android phone.</p>",
            "<p>You can check out our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Pixel 3</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-xl-review/\">Pixel 3 XL reviews</a> for our impressions, and check out our picks for <a href=\"https://www.digitaltrends.com/mobile/best-pixel-3-cases-version-1539691504/\">best Pixel 3</a> and <a href=\"https://www.digitaltrends.com/mobile/best-pixel-3-xl-cases/\">Pixel 3 XL cases</a> to add some protection to these all-glass phones.</p>",
            "<p>One of our favorite features on the Pixel 3 actually debuted on the Pixel 2. Now Playing uses on-device machine learning to listen to the music in your surroundings — whether you’re in a cafe or a restaurant, the Pixel 3 will try to find the name of the song, and it will display it on the lock screen and as a notification. Don’t worry, this is all being done offline, and “never sends songs or conversations to Google.” It’s turned off by default, so here’s how to turn it on.</p>",
            "<p>Head to the phone’s Settings either by pulling down the notification shade all the way down and tapping the gear icon, or by finding the Settings app in the app drawer. Now go to <em>Sound &gt; Now Playing </em>and tap on <em>Show songs on lock screen</em>. You can also choose to get notifications here or turn them off. Now Playing has improved on the Pixel 3 with a new “Now Playing History” section. Tap on it, and you’ll see a history of the songs identified by the phone sorted by date. Even better, tap on one of the songs, and you’ll get direct access to play the song on any installed music service like YouTube Music.</p>",
            "<p>This is also a good time to make sure your Ambient Display is turned on so you can see these music alerts by heading to <em>Settings &gt; Display &gt; Advanced &gt; Ambient Display</em>.</p>",
            "<p>The fingerprint sensor on the back of the Google Pixel 3 does more than just unlock your phone. You can swipe your finger down or up on it to pull the notification drawer down or push it up. It’s especially handy on the Pixel 3 XL, where it can be hard to reach the top of the large 6.3-inch screen. It’s turned off by default, so here’s how to toggle it on: Head to <em>Settings &gt; System &gt; Gestures &gt; Swipe fingerprint for notifications</em> and tap the toggle. Now swipe down or up on the fingerprint sensor, and you’ll see the notification drawer magically move up and down.</p>",
            "<p>Google’s Active Edge feature that lets you squeeze the sides of the phone to activate Google Assistant makes a return. You’ll be prompted with the option to configure this during the phone’s setup process, but there’s a way to tweak the sensitivity afterward. You can also turn it off completely if you want to just rely on pressing and holding down the home button, or on tapping the Assistant icon in the Google Search bar. Head to <em>Settings &gt; System &gt; Gestures &gt; Active Edge</em>. Here you can manually move the dot on the slider around to require a firm or light squeeze to activate Assistant, and there’s an option to turn it off completely below, or to make it work even when the screen is off.</p>",
            "<p>Active Edge isn’t purely to access Google Assistant either. You can squeeze the phone to silence an alarm, timers, notifications, and incoming calls, and you can toggle this off in the same screen.</p>",
            "<p>One of the new software features exclusive to the Pixel 3 and 3 XL is ‘Flip to Shhh,’ which, as it sounds, silences your device when you flip the phone on a table (display facing down). It’s a quick way to turn on Do Not Disturb, especially if your phone is vibrating loudly in a meeting or interview. Head over to <em>Settings &gt; Digital Wellbeing &gt; Flip to Shhh</em> and toggle it on. Alternatively, the setting option is also available in <em>Settings &gt; System &gt; Gestures &gt; Flip to Shhh. </em></p>",
            "<p>While you’re in the <a href=\"https://www.digitaltrends.com/mobile/how-to-use-google-digital-wellbeing-android-9-pie/\">Digital Wellbeing menu</a>, we recommend taking a look at Google’s options to help curtail smartphone usage. We don’t think app timers are too useful (unless you’re setting one up for a child), but we do recommend turning on Wind Down, which will turn the display to grayscale at night and will automatically turn on Do Not Disturb mode. It’s a great way of staying off your phone before bed, and not getting distracted. Just tap <em>Wind Down</em>, choose a start and end time, and you can customize whether you want Do Not Disturb turned on, as well as a grayscale screen, or even whether the phone should turn on Night Light (which turns the screen yellow <a href=\"https://www.digitaltrends.com/mobile/does-blue-light-ruin-sleep-we-ask-an-expert/\">to protect from blue light</a>).</p>",
            "<p>There’s no full on “dark mode” in the Pixel 3, but there’s a way to make the app drawer and notification drawer a darker color. It’s easier on the eyes when you’re in a dark room and don’t want to be blinded. By default this setting is on “Automatic (based on wallpaper),” which means if you have a dark wallpaper, the notification and app drawer will swap to a dark theme automatically, and vice versa if you have a lighter wallpaper. If you want to manually configure it, just head to <em>Settings &gt; Display &gt; Advanced &gt; Device Theme &gt; </em>and choose <em>Light </em>or <em>Dark.</em></p>",
            "<p>There are several ways to have your phone bypass the lock screen. You can set up <a href=\"https://www.digitaltrends.com/mobile/how-to-use-android-smart-lock/\">Smart Lock</a>, so your phone will not ask you to unlock it when you’re at home, or you can set it to trust connected Bluetooth devices so your smartwatch or headphones will keep your phone unlocked. But there may be a few moments when you may want to quickly lock down your phone to make sure no one can access it without your lock screen password. Google has made it easy, but you’ll need to turn this function on first.</p>",
            "<p>Head over to <em>Settings &gt; Security &amp; Location &gt; Lock Screen Preferences &gt; </em>and toggle on <em>Show Lockdown Option.</em> Now when you press and hold the power button, you’ll see an option to “Lockdown” the phone. This turns Smart Lock off, doesn’t let you use the fingerprint sensor, and hides notifications from the lock screen. It’s unlikely you’ll need to use this feature much, but it can be very handy in certain scenarios.</p>",
            "<p>Tired of your screen constantly rotating when you shift orientation? Auto-rotate is a handy feature, but it can be a bit too sensitive. A new smart rotation tool in Android 9 Pie makes it so that you can leave the auto-rotate toggle turned off all the time. How does it work? Well, first you actually do need to turn screen auto-rotate off. Pull down the notification bar all the way down until you see the quick settings tiles. Find <em>Auto-rotate</em>, and tap on it to turn it off (if it was on already). Now go into any app and rotate your screen to landscape — you’ll see a rotate icon pop up next to the home button. Tap it, and the screen’s contents will rotate to the correct orientation and it will stay locked. When you go back into portrait orientation, the button will pop up again, and just press it to lock it back to portrait. It’s a much smarter implementation than having to deal with an overly sensitive auto-rotate system.</p>",
            "<p>The Pixel 3 takes excellent photographs, and if you’re a professional photographer, you may want further control over editing those images. There’s now a handy way of making sure the Pixel 3 captures JPEGs and RAW file formats. Open the camera app by double tapping the power button, or by finding it in the app drawer. Tap <em>More</em> then <em>Settings</em>. Go to the <em>Advanced </em>tab, and then toggle on <em>RAW+JPEG control</em>. You’ll now see a separate album in the Google Photos app that will let you access these RAW photo files. Keep in mind, this uses up more device storage.</p>",
            "<p>The Pixel 3 and Pixel 3 XL don’t pack the biggest batteries inside, and they left us wanting more. You’ll want to make sure you have enough juice to last you a full day, and you can have Battery Saver mode automatically kick in when your phone hits a certain battery level. To do this, head to <em>Settings &gt; Battery &gt; Battery Saver &gt; </em><em>Turn On Automatically</em>. A slider will show up, and you can move the dot around to choose at what percentage you want Battery Saver mode to kick in. Battery Saver turns off some features in the phone and restricts background use for a few apps, which in turn helps extend battery life.</p>",
            "<p>A lot of people complained about the Pixel 2 XL’s screen last year looking a bit muted, so Google added a few display configurations to appease. We’ve yet to see any major problems with the screen on the Pixel 3 XL, but in both phones you will see the same screen color options. Head to <em>Settings &gt; Display &gt; Advanced &gt; Colors</em>. There are three options to choose from: Natural, Boosted, and Adaptive. As the name suggests, Natural gives you the most realistic-looking colors, while Boosted cranks up the saturation. The default Adaptive mode similarly increases the saturation, but it ensures things like skin tone and reds are toned down, according to <a href=\"https://9to5google.com/2018/10/09/google-pixel-3-displays-cameras-more/\">9to5Google</a>.</p>",
            "<p>Those are some of the key settings we think you should change, but we have plenty more <a href=\"https://www.digitaltrends.com/mobile/google-pixel-3-tips-and-tricks/\">tips and tricks</a> to customize your Pixel 3 and 3 XL further. Enjoy your new phone!</p>"
        ]
    },
    {
        "title": "\n\t\tGoogle Pixel 3 and Pixel 3 XL: Everything you need to know\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>Rarely has a flagship phone been so thoroughly leaked ahead of launch as Google’s Pixel 3 XL, but the company still had a few surprises in store at its New York event. The Google Pixel 3 and the Google Pixel 3 XL offer some significant upgrades over their predecessors, while still clearly belonging to the Pixel family.</p>",
            "<p><strong><em>If you want our take on the new phones, check out our full reviews of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-xl-review/\">Google Pixel 3 XL</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Pixel 3</a>.</em></strong></p>",
            "<p>On top of the usual processor upgrade, both Pixels now sport a dual-lens, front-facing camera designed to elevate your selfie game to the next level, some additional software smarts to get the best from the single-lens main camera, and support for Qi wireless charging. Google’s design has also been refined compared to last year’s <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-review/\">Pixel 2</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-xl-review/\">Pixel 2 XL</a>. If you’re in the market for a new Android phone, Google’s wares should be on your radar. Here’s everything you need to know about the Pixel 3 and 3 XL.</p>",
            "<p>Google was one of the first manufacturers to support <a href=\"https://www.digitaltrends.com/mobile/esim-explainer/\">eSIM cards</a> as part of its Google Fi network, and it put its money where its mouth was by equipping the Pixel 3 with eSIM support. But not many carriers supported eSIM, so the rollout to the new, less physical format has been a tad slow.</p>",
            "<p>However, Google has just announced it is rolling out eSIM support for the Pixel 3 for multiple carriers in multiple countries. According to <a href=\"https://www.theverge.com/circuitbreaker/2018/12/3/18123947/google-esim-support-pixel-3-sprint-international\">The Verge</a>, you can soon expect to see eSIM support for Sprint in the U.S., EE in the U.K., Airtel and Reliance Jio in India, and for Truphone and Gigsky in a bunch of other countries. In addition, Deutsche Telekom and Vodafone in Germany will be going one better and will soon be selling Pixel 3 phones with an eSIM.</p>",
            "<p>Google’s clever A.I. mode, Night Sight, is now rolling out to the Pixel 3 and Pixel 3 XL as an update to the Google Camera app. It stitches together multiple frames to reduce noise and boost colors and brightness for photos captured in very dark environments. You’ll find the new mode in the <em>More</em> section of the camera app, but it should pop up as a suggestion when appropriate. The new mode works with the main camera and the front-facing camera. We’re impressed by the <a href=\"https://www.digitaltrends.com/mobile/google-pixel-night-sight/\">results we’ve gotten with Night Sight</a> so far.</p>",
            "<p>At Google’s Pixel event earlier this year, the company announced Playground, a new Pixel camera mode that essentially allows users to display augmented reality characters in their photos. At launch, the feature offered Marvel characters, weather, signs, and more. Now, in celebration of National Cat Day, it’s getting some cats. Within the Playground feature, you will be able to add both cats and dogs, after which they will interact with each other on the screen, run around a scene, and so on.</p>",
            "<p>One of the most interesting new features to be shown off during the launch of the Pixel 3 was the ability for the phones to screen phone calls and block spam. When you get a call from an unknown number, for example, you can simply hit the “Screen Call” button, and Google Assistant will talk to the caller instead of you. The feature will be available on the Google Pixel 3 and Pixel 3 XL later this month, and will be coming to the original Pixel and Pixel 2 in November.</p>",
            "<p>The Google Pixel 3 XL may be getting good early reviews, but there is one feature that reviewers have consistently mentioned in a less-than-positive light — the huge notch. Thankfully, however, it seems as though Google is developing a way to hide the notch. The new feature is currently available in Android’s developer options and essentially puts a black bar at the top of the display. The result is that the phone basically looks like it has a large bezel at the top, though some may prefer that look to the notch. We tried out the new feature and you can see what it looks like below.</p>",
            "<p>Perhaps the most interesting addition to the Pixel’s software is that it will be getting <a href=\"https://www.digitaltrends.com/mobile/google-duplex-hands-on/\">Google Duplex</a>, Google’s ultra-realistic human-sounding version of Assistant that can call restaurants to make bookings. For now, the service will only call restaurants that don’t have online booking systems, which already have Assistant support. Initially, Google is only bringing the feature to New York, Atlanta, Phoenix, and the San Francisco Bay Area — though it’s likely the feature will roll out to more areas soon after.</p>",
            "<p>At first glance, the Google Pixel 3 looks a lot like the Pixel 2, but look closer and you’ll see that Google has cut the bezels down, enabling it to pack a 5.5-inch OLED screen into a body that’s actually a hair smaller than its predecessor’s. Not only has the screen size jumped by half an inch, but it’s also sharper, with a 2,160 x 1,080-pixel resolution that scores it a respectable 443 pixels-per-inch (ppi). Thankfully, there’s still room for stereo front-facing speakers.</p>",
            "<p>Flip around to the back and we find the same two-tone design as previous Pixels, with a fingerprint sensor in the middle and the camera lens at the top left, but this time the back is all glass, which allows the Pixel 3 to support wireless charging. Alongside the usual understated black version, there’s also white with a mint green power button, and an all-new “Not Pink” option with an orange power button.</p>",
            "<p>There are no real surprises inside, where we find Qualcomm’s Snapdragon 845 processor backed by 4GB of RAM. Storage options are 64GB or 128GB and there’s no room for a MicroSD card to expand on that. There’s also no room for a 3.5mm audio jack, so you’ll have to make use of the USB-C port or Bluetooth 5, but you do get USB-C earbuds in the box.</p>",
            "<p>Naturally, the Pixel 3 runs the latest Android 9 Pie version and Google has added various enhancements. In addition to Qi wireless charging, there’s also fast-charging support for the 2,915 mAh battery. That’s slightly bigger than the battery in the Pixel 2 and, coupled with the newer, more efficient processor, should translate to longer battery life.</p>",
            "<p>The Pixel 3 XL is more obviously different from its predecessor, with a large <a href=\"https://www.digitaltrends.com/mobile/why-are-android-phone-makers-embracing-the-notch/\">notch making a controversial appearance</a> at the top of the 6.3-inch OLED screen. It also retains a sizable chin below. The display sports a resolution of 2,960 x 1,440 pixels, which translates to a sharp 523 ppi. The screen is flanked by stereo front-facing speakers.</p>",
            "<p>Just like its smaller sibling, the Google Pixel 3 XL has a two-tone design on the glass back, with a fingerprint sensor in the middle and a single camera lens at the top left. It also comes in black, white with the mint green power button, and in the new pink color with an orange power button.</p>",
            "<p>The Qualcomm Snapdragon 845 processor is backed up by 4GB of RAM and there’s 64GB or 128GB of onboard storage, with no expansion option. You won’t find a 3.5mm audio jack here, but there are USB-C earbuds in the box and support for <a href=\"https://www.digitaltrends.com/home-theater/best-wireless-headphones/\">wireless headphones</a> via Bluetooth 5.0.</p>",
            "<p>The battery is rated at 3,430mAh, which is actually a touch smaller than last year’s Pixel 2 XL battery, but we expect power efficiency improvements to help keep it running for a day. There’s also support for Qi wireless charging and fast charging.</p>",
            "<p>The most exciting upgrades in the Google Pixel 3 and 3 XL are to be found in the camera department, and both phones have exactly the same camera setup.</p>",
            "<p>Google has stuck steadfastly with a single-lens main camera rated at 12.2 megapixels, even in the face of <a href=\"https://www.digitaltrends.com/mobile/photo-shootout-p20-pro-galaxy-s9-iphone-x-pixel-2/\">dual- and triple-lens competition</a>. We don’t blame it, as the camera in the Pixel 2 and 2 XL has held its own very well over the last year — in fact, it’s still our <a href=\"https://www.digitaltrends.com/mobile/best-camera-phones/\">reigning camera phone champion</a>. The main camera has optical image stabilization, laser autofocus, dual pixel phase detection, and support for high dynamic range (HDR).</p>",
            "<p>Google is able to squeeze such great performance out of its camera by employing some clever software trickery, instead of relying upon more hardware. The A.I.-powered camera in the Pixel 3 and 3 XL takes a burst of shots before and after you press the shutter button and then analyzes them to suggest the best options, looking for shots where subjects are looking at the camera with open eyes and smiles. It also offers an excellent portrait mode capable of blurring the background for the perfect bokeh, and it’s capable of automatically tracking subjects, so you don’t need to keep tapping to refocus. There’s a new zoom option that allows you to zoom in, even without a telephoto lens, with A.I. filling in the gaps and bringing you the detail level you want.</p>",
            "<p>The front-facing camera features a bigger upgrade, combining an 8.1-megapixel telephoto lens with an f/1.8 aperture and a second 8.1-megapixel wide-angle lens that features an f/2.2 aperture. This combination will enable you to capture great group selfies or get more background in, and it should also perform well in low light, making it perfect for grabbing shots at night or indoors.</p>",
            "<p>Just as it did with previous Pixel phones, Google is offering free, unlimited Google Photos storage for all the full resolution photos and videos you take with the Pixel 3 or 3 XL.</p>",
            "<p>Both the Pixel 3 and Pixel 3 XL run Android 9.0 Pie. They ditch the old home, back, and recents buttons in favor of the new gesture navigation.</p>",
            "<p>From next month, Google Assistant will be enhanced with the ability to screen spam calls, answer for you, and provide a transcription so you can decide whether to block them or call back. The new Pixels will also be the first to get the ability to make calls for you and perform tasks like making restaurant reservations.</p>",
            "<p>If you use your Pixel 3 or 3 XL with the new Pixel Stand, then you’ll also get special one-touch shortcuts or voice commands to enable you to check your schedule and more.</p>",
            "<p>The Google Pixel 3 starts from $799 and the Pixel 3 XL starts at $899. If you want the higher 128GB storage capacity of either, it will cost you an extra $100. Both of the phones are available now.</p>",
            "<p><em>Check out our <a href=\"https://www.digitaltrends.com/mobile/everything-google-announced-at-its-october-event-nyc/\">live blog</a> to learn about everything else Google announced.</em></p>",
            "<p><i>Updated on December 4, 2018: Google is rolling out more eSIM support around the world.</i></p>"
        ]
    },
    {
        "title": "\n\t\tVerizon’s buy one, get one offer is the best deal on the new Google Pixel 3\t",
        "author": [
            "\n\t\t\t\t\t\tLucas Coll\t\t\t\t\t"
        ],
        "text": [
            "<p>Mobile hardware is getting better and better, but when it comes to flagship smartphones, it doesn’t seem to be getting any cheaper. The latest flagships from Apple and Samsung are in fact among the most expensive devices we’ve ever seen, with prices for the Galaxy Note 9 and iPhone X starting at $1,000 (the newer iPhone XS is even more expensive at $1,100).</p>",
            "<p>But if it’s time for a new phone, then these flagships really are the best that money can buy. If you’re in the market for a new smartphone and you want one of the latest and greatest – without shelling out a grand or more – then the new Google Pixel 3 and Pixel 3 XL are fantastic options.</p>",
            "<p>Our review team sang high praise for the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Google Pixel 3</a> and its larger sibling, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-xl-review/\">Pixel 3 XL</a>.  The highlights of both designs were their great build quality, beautiful OLED displays, great performance, and intuitive software, with the phones’ <a href=\"https://www.digitaltrends.com/mobile/google-pixel-cuts-through-ai-hype/\">new Google A.I.</a> being a particularly impressive feature.</p>",
            "<p>Deals are typically scarce when it comes to new devices, as you’d expect from something that’s just been released and hasn’t even shipped yet. You can still score a deal, however, if you take advantage of pre-order bonuses like Verizon’s “buy one, get one” offer, which is by far the best deal going for the Google Pixel 3 right now.</p>",
            "<p>Google’s partnership with Verizon means that this is the only one of the main carriers you can use with the Pixel 3, but if you’re a Verizon customer or are looking to switch, then this BOGO offer lets you score a free 64GB Pixel 3 when you pre-order either the <a href=\"https://www.digitaltrends.com/go/a06cac4bc1476036d5686af6df7fab0baa6c8ea2/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Verizon\">Google Pixel 3</a> or <a href=\"https://www.digitaltrends.com/go/261f1df9285f2a85226dc463acafbc1055a5634b/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Verizon\">Pixel 3 XL</a> – effectively an $800 discount. This offer requires you to add a new line of service to your plan for at least one of the phones, and you’ll have to buy both up-front with the $800 rebate coming in the form of bill credits over 24 months.</p>",
            "<p>If you really want the Google Pixel 3, but simply can’t justify buying two phones to get a discount, then you also have a second option. Best Buy is offering a free $100 gift card with the pre-order of a new <a href=\"https://www.bestbuy.com/site/google-pixel-3-64gb-just-black-verizon/6303045.p?skuId=6303045\" target=\"_blank\" rel=\"noopener\">Pixel 3</a> or <a href=\"https://www.bestbuy.com/site/google-pixel-3-xl-64gb-just-black-verizon/6303050.p?skuId=6303050\" target=\"_blank\" rel=\"noopener\">Pixel 3 XL</a> – not a mind-blowing deal, but not bad considering the Pixel is already the cheapest of the new flagships to hit the market this fall even without any discounts. Note that you’ll still need to activate it through Verizon, though.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/a06cac4bc1476036d5686af6df7fab0baa6c8ea2/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Verizon\">Verizon</a></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/d39ddf1148137d6a2b81d364f4af1fc8104ccf1a/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Best Buy\">Best Buy</a></p>",
            "<p>Looking for more great stuff? Find <a href=\"https://www.digitaltrends.com/dtdeals/best-smartphone-deals/\">smartphone deals</a>, <a href=\"https://www.digitaltrends.com/dtdeals/best-iphone-deals/\">iPhone deals</a>, and more on our curated <a href=\"https://www.digitaltrends.com/deals/\">deals page</a>, and be sure to <a href=\"https://twitter.com/dealsdt\" target=\"_blank\" rel=\"noopener\">follow us on Twitter</a> for regular updates.</p>"
        ]
    },
    {
        "title": "\n\t\tThe Google Pixel Stand turns your Android phone into an Assistant-powered hub\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/mobile/google-pixel-3-news/\">Google Pixel 3 and Pixel 3 XL</a> may have stolen the show at Google’s annual hardware event, but they weren’t the only devices that the company unveiled. In fact, like Apple did with AirPower a little over a year ago, Google is also showing off a new wireless charger — called the Google Pixel Stand.</p>",
            "<p>The release of the Pixel Stand certainly doesn’t come as a surprise. The device was leaked a few times before Google’s October 9 event, so we already knew about its existence. While it may primarily serve as a wireless charging dock, it also offers more features — namely, it turns your phone into a Google Assistant screen when it’s charging, offering up information you may need when you need it.</p>",
            "<p>When you dock your phone, the user interface of your device adjusts to show information that you can see at a glance. The information, as you might expect, is powered by Google Assistant — so you will be able to quickly and easily ask Assistant to find information for you, kind of like how you can on the <a href=\"https://www.digitaltrends.com/home/google-home-hub-specs-roundup/\">new Google Home Hub</a>. On top of that, Google says you will be able to control your smart home devices while your phone is docked, and it knows your morning routine — so when you wake up, it will display information like commute times. Other features include the fact that when you dock your phone at night, it’ll automatically switch to Do Not Disturb, and when it’s waking you up in the morning it will display ambient light to help you wake up. During the day, you can also display an album of your favorite photos in a slideshow while your phone charges.</p>",
            "<p>For those interested in the Google Pixel Stand, it’s now available for pre-order for $80 <a href=\"https://store.google.com/us/product/pixel_stand\" target=\"_blank\" rel=\"noopener\">straight from the Google Store</a>. Google didn’t specifically name a date for full availability of the device, but we assume it’ll follow the Pixel 3’s lead and be available for purchase starting on October 18.</p>",
            "<p>Alongside the Pixel Stand, Google also announced the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Pixel 3</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-xl-review/\">Pixel 3 XL</a>, as well as the new <a href=\"https://www.digitaltrends.com/smart-home-reviews/google-home-hub-review/\">Google Home Hub</a>, a smart display that comes fully loaded with Google Assistant, and <a href=\"https://www.digitaltrends.com/laptop-reviews/google-pixel-slate-review/\">Pixel Slate</a>, a Chrome OS 2-in-1. To learn more about everything Google announced, check out our <a href=\"https://www.digitaltrends.com/mobile/everything-google-announced-at-its-october-event-nyc/\">handy roundup</a>.</p>",
            "<p><em>Updated on October 9, 2018: The Google Pixel Stand has been announced.</em></p>"
        ]
    },
    {
        "title": "\n\t\tThe best Google Pixel 3 tips and tricks\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Google Pixel 3</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-xl-review/\">Pixel 3 XL</a> are phones with hidden depths. In this guide, we’ve got step-by-step instructions for you here to help you customize your new phones, dig into the best shortcuts, and uncover the most exciting features.</p>",
            "<p>We’ll run through some features exclusive to the Pixel line, and some that will work on any <a href=\"https://www.digitaltrends.com/mobile/android-9-pie-review/\">Android 9.0 Pie</a> phone. Before we dive in, Pixel 3 XL owners might want to look at <a href=\"https://www.digitaltrends.com/mobile/how-to-hide-notch-on-pixel-3-xl/\">how to hide the notch</a>. Without further ado, here are our top Pixel 3 tips.</p>",
            "<p>Tap and hold on any open area of your home screen and you’ll get a pop-up menu that lets you select <em>Widgets</em> and <em>Wallpapers</em> – we recommend the <em>Living Universe</em> section in <em>Wallpapers</em>, where Google offers some fantastic animated wallpapers. Some of the other categories offer a <em>Daily wallpaper</em> option that changes your wallpaper every day.</p>",
            "<p>You’ll also find <em>Home settings</em> in here, where you can decide if you want Notification dots, whether new app icons should be added to the Home screen, set <em>At A Glance</em> info like calendar events to stay at the top of the screen, and more.</p>",
            "<p>Pull down the notification shade with two fingers and tap the wee pencil icon at the bottom right to edit the quick settings toggles that appear. You can simply tap and drag icons to add or remove them and select your preferred spot.</p>",
            "<p>Because blue light can make it <a href=\"https://www.digitaltrends.com/mobile/does-blue-light-ruin-sleep-we-ask-an-expert/\">harder to fall asleep</a>, most phone manufacturers now offer a <a href=\"https://www.digitaltrends.com/mobile/how-to-use-blue-light-filter-phone/\">blue light filter</a> that can be scheduled to kick in near bedtime. On your Pixel 3, go into <em>Settings &gt; Display &gt; Night Light</em> and tap <em>Schedule,</em> where you can choose to have it turn on precisely when you want or automatically align with the sunset and sunrise in your area.</p>",
            "<p>You can also set this as a part of your <em>Wind Down</em> bedtime routine in <em>Settings &gt; Digital Wellbeing</em>.</p>",
            "<p>With 64GB of storage in the base model and no room for a Micro SD card, you might find that you run out of space on your Pixel 3 or 3 XL. Apart from uninstalling apps you don’t need, you should also go to <em>Settings &gt; Storage</em> and tap <em>Free up space</em>.</p>",
            "<p>Another way to free up space is to back up photos and video to Google Photos, where you can back up everything in its original quality for free. Once everything is backed up, tap on the small hamburger menu at the top left in Google Photos and then tap <em>Settings &gt; Free up device storage</em>.</p>",
            "<p>If a call comes in that you suspect may be spam — or you just don’t want to take it — <a href=\"https://www.digitaltrends.com/mobile/google-call-screening-how-to-use/\">tap <em>Screen call</em></a> and Google Assistant will answer for you, saying, “Hi, the person you’re calling is using a screening service from Google, and will get a copy of this conversation. Go ahead and say your name, and why you’re calling.”</p>",
            "<p>You’ll see what they say transcribed in real time on your Pixel 3 screen and you can choose whether to answer, send a quick reply, or report as spam.</p>",
            "<p>To use split screen, simply swipe up from the bottom of the screen to open the multitasking view showing your recent apps and tap the app icon at the top of one of the apps you want open. Then select <em>Split screen</em> and choose the second app you want open. You can drag the bar in the middle to resize, then simply drag it all the way to the top or bottom when you’re done to go full screen with one of the apps.</p>",
            "<p>We definitely recommend turning Ambient Display on, so that you can see new notifications and other information on your Pixel 3’s screen even when it’s locked, but you should configure it. Since battery life isn’t the best, we wouldn’t recommend leaving it on all the time. Go to <em>Settings &gt; Display &gt; Advanced &gt; Ambient Display</em> and make sure that the <em>Always on</em> mode is off, but <em>New notifications</em> is on. We also turned on <em>Double-tap to check phone</em> and <em>Lift to check phone</em>, but you might feel one of those options is enough.</p>",
            "<p>You can simply double tap the power button to quickly launch the camera app at any time, even when your Pixel 3 is locked. It’s a handy shortcut when you want to capture a spontaneous moment and speed is important. You can toggle this feature on and off in <em>Settings &gt; System &gt; Gestures &gt; Jump to camera</em>.</p>",
            "<p>You can use your Pixel 3’s volume keys to snap photos or zoom in if you configure them. Open the camera app and swipe over to <em>More &gt; Settings</em>, then tap <em>Gestures</em> and choose your preference.</p>",
            "<p>You can also set what double tapping on the screen in the camera app should do here: Zoom in or switch cameras.</p>",
            "<p>Sometimes you’ll negotiate into the perfect group selfie position and realize that the main camera is on instead of the front-facing camera. Don’t worry, just twist your wrist twice and it should switch to the front-facing camera. This should be on by default, but you can find the option in <em>Settings &gt; System &gt; Gestures &gt; Flip camera</em>.</p>",
            "<p>If you haven’t already, you might want to check out <a href=\"https://www.digitaltrends.com/mobile/google-pixel-3-settings/\">key settings you need to change on your brand-new Google Pixel 3 or Pixel 3 XL</a>.</p>"
        ]
    },
    {
        "title": "\n\t\tCommon Google Pixel 3 problems, and how to fix them\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Google Pixel 3</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-xl-review/\">Pixel 3 XL</a> are arguably among the <a href=\"https://www.digitaltrends.com/mobile/best-android-phones/\">best Android phones</a> to date. They feature top-tier specs, uncluttered Android software, and all the <a href=\"https://www.digitaltrends.com/mobile/5-features-we-love-and-dont-pixel-3/\">artificial intelligence</a> Google can pack in. But these devices aren’t perfect. Since the launch of the <a href=\"https://www.digitaltrends.com/mobile/google-pixel-3-news/\">Google Pixel 3 and 3 XL</a>, a few issues have cropped up — ones you may be experiencing.</p>",
            "<p>If you have run into any Pixel 3 problems, we’ve put together this guide. Here’s everything you need to know about Pixel 3 problems, and how to fix them.</p>",
            "<p>The Pixel 3’s camera is incredible, but quite a <a href=\"https://www.androidcentral.com/im-fed-how-slow-google-pixel-3-camera\">few people are noticing</a> the camera app itself can sometimes take a while to start up. Starting the camera app on older Pixels had always been a snappy affair, so it was puzzling to see it taking a few seconds to load on the Pixel 3. We have confirmed this problem on our Pixel 3 XL, and it even extends to snapping a picture. Where there’s supposed to be zero lag when you tap the shutter button, we’re seeing the Pixel 3 take up to four seconds at times to actually capture the photograph. That’s bad, and frustrating. We reached out to Google.</p>",
            "<p>“We’ve been investigating some reports of camera sluggishness,” a spokesperson told Digital Trends. “We have an update for Camera rolling out in the coming weeks that should improve performance.”</p>",
            "<p><strong>Fix:</strong></p>",
            "<p>Have you noticed text messages on your Pixel device disappearing? You’re not going crazy. According to a <a href=\"https://www.androidpolice.com/2018/11/14/pixel-3-users-noticed-text-messages-vanishing/\" target=\"_blank\" rel=\"noopener\">report from Android Police</a>, the latest Pixel 3 security update is causing some text messages to disappear on some devices.</p>",
            "<p>Google has acknowledged the problem quickly, and promised a fix would be rolling out soon. However, that was back in November 2018, and it seems users are still waiting, with <a href=\"https://support.google.com/messages/thread/886627?hl=en\">one complaint</a> coming in on December 31.</p>",
            "<p><strong>Fix: </strong></p>",
            "<p>This is an issue that effects anyone charging with a non-Google-branded wireless charger. Because of the <a href=\"https://gizmodo.com/the-pixel-3-wont-wirelessly-charge-at-max-speed-except-1829955945\">weird way</a> Google has set up its wireless charging, it’s not possible to access fast 10W wireless charging on any pad that hasn’t been made by Google. However, the Pixel 3 <a href=\"https://twitter.com/NexusBen/status/1054914152119103488\">still displays</a> a <a href=\"https://www.reddit.com/r/GooglePixel/comments/9pkxsu/pixel_3_xl_wireless_charging/\">“Charging Rapidly”</a> message — even when charging using the slower 5W speeds. It’s not the biggest problem in the world, but it can be annoying if you don’t know about it.</p>",
            "<p><strong>Solution:</strong></p>",
            "<p>Some people have reported that opening the camera app while listening to music seems to cause the music app to close in the background, stopping the playback of the music. This is <a href=\"https://9to5google.com/2018/10/22/pixel-3-memory-management-issue-background-apps/\" target=\"_blank\" rel=\"noopener\">another bug</a> that seems to be related to memory management on the Google Pixel 3 and Pixel 3 XL. We were able to replicate the problem, both with Spotify and with Google’s own YouTube Music.</p>",
            "<p>Because the issue seems to be related to memory handling, it’s very likely we’ll see a software update fixing the issue in the near future. It’s possible the issue is actually the same problem causing photos not to save — and that it all comes down to issues with the Pixel 3 not handling its 4GB of memory well enough. While the fix wasn’t included in November’s patch for the Pixel 3, it was included <a href=\"https://source.android.com/security/bulletin/pixel/2018-12-01\">in December’s</a>.</p>",
            "<p><strong>Solution:</strong></p>",
            "<p>The Google Pixel 3 and Pixel 3 XL are Verizon-exclusive phones, basically meaning that Verizon is the only carrier in the U.S. with the right to sell the phones. Some owners, however, have reported that the Pixel 3 from Best Buy was also locked to the Verizon network, meaning users couldn’t buy the phone and activate it on another network. Once the phone was activated on Verizon, it was then unlocked — meaning you could only then use it on another network.</p>",
            "<p>Thankfully, it seems as though Verizon has, at least temporarily, <a href=\"https://www.theverge.com/2018/10/19/18001736/verizon-google-pixel-3-unlocked-carriers-activation\" target=\"_blank\" rel=\"noopener\">unlocked the Pixel 3</a> completely. The unlocking was sent to Pixel 3 phones through a software update — so you should be able to set up your phone without a SIM card, update it, then activate it on whatever network you choose.</p>",
            "<p><strong>Potential solution:</strong></p>",
            "<p>A number of users have reported that after taking a photo with the camera app, those photos aren’t saving — essentially meaning that the photo could be gone forever. That’s a pretty major problem, and one that seems to be pretty widespread too — a number of <a href=\"https://www.reddit.com/r/Android/comments/9pbk6z/google_still_hasnt_fixed_the_issue_of_photos/\" target=\"_blank\" rel=\"noopener\">users on Reddit</a> have reported running into it. The issue, in particular, seems to come up when you take a photo with the Google Camera app, then switch to another app or lock the phone immediately after taking the photo. In some situations, the photo will eventually appear again in the gallery, but that doesn’t seem to happen all the time.</p>",
            "<p>The issue seems to be related to how the Pixel 3 and Pixel 3 XL handle memory, and quitting out before the HDR processing is finished. Thankfully, this means that it can be fixed with a software update. It wasn’t included in November’s patch, which was a shame — but it was supposed fixed in <a href=\"https://source.android.com/security/bulletin/pixel/2018-12-01\">December’s update</a>.</p>",
            "<p><strong>Solution:</strong></p>",
            "<p>We’ll update this article when we hear more about issues related to the Google Pixel 3 and how to fix them.</p>"
        ]
    },
    {
        "title": "\n\t\tPixel 3 and Pixel 3 XL: 5 features we love, 5 features we don’t\t",
        "author": [
            "\n\t\t\t\t\t\tBrenda Stolyar\t\t\t\t\t"
        ],
        "text": [
            "<p>Google’s new smartphones <a href=\"https://www.digitaltrends.com/mobile/google-pixel-3-news/\">are finally here</a>. Following months of leaks, the company officially announced the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Pixel 3</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-xl-review/\">Pixel 3 XL</a> at its hardware event in New York City on October 9. The successor to the Pixel 2 brings along new artificial intelligence features, updated camera software, wireless charging capabilities, and more.</p>",
            "<p>While Google’s new smartphones offer plenty of things to be excited about, there are also additions we aren’t fans of. Here are five features we love about the Pixel 3 and Pixel 3 XL, and five that we don’t.</p>",
            "<p>As opposed to last year, the Google Pixel 3 and Pixel 3 XL come with the ability to be charged wirelessly. To charge the devices, Google released its own wireless charging pad — the <a href=\"https://www.digitaltrends.com/mobile/google-pixel-stand-news/\">Pixel Stand</a> — which comes with an 18-watt fast charger. Google says you can get seven hours of use after only 15 minutes of charging.</p>",
            "<p>The minute you place your Pixel 3 on the stand, you’ll also have access to Google Assistant,with shortcuts that appear on the display. It’ll also work similar to your Google Home — every morning, your Pixel 3 display will slowly brighten to gently wake you up and will then provide you with your morning routine.</p>",
            "<p>When you’re not using your Pixel 3 while it’s on the Pixel Stand, it won’t just sit there and charge. You’ll be able to turn your smartphone into a digital photo frame, allowing it to display all of your photos in a slideshow. When you’re listening to music, it’ll also display the music and cover art on the display.</p>",
            "<p>The Pixel 3 and Pixel 3 XL each feature dual front-facing speakers. This time around, the speakers are 40 percent louder than those included on its predecessors — which should provide a bigger and richer sound. Both smartphones will also ship with six months of YouTube Music for free.</p>",
            "<p>It’s no secret that the Pixel 2 offers impressive front-facing and rear-facing cameras that take stunning shots. The Pixel 3 is no different —  Google has added a ton of new features for an even better photo-taking experience.</p>",
            "<p>For starters, there’s Top Shot, which will help during those unexpected moments that can ruin a perfect shot — whether it’s a blink or a sneeze. The feature automatically captures a burst of shots in HDR Plus, giving you an array of alternate photos to choose from. Google also introduced Super res zoom, which uses artificial intelligence to provide you with sharp photos when you zoom in on a subject.</p>",
            "<p>Those who find themselves frustrated with the image quality of photos taken in low light will be happy to know athat the Pixel 3 will include Night Sight later this year. Whether you’re at a dimly lit restaurant or camping with friends at night, the smartphone uses machine learning to take natural-looking photos without having to turn on the flash.</p>",
            "<p>We also love the wid- angle camera on the front of the Pixel 3, which allows users to take even better selfies. With Group Selfie, you’ll be able to capture 184 percent more room in your photo. There’s also Photobooth mode that automatically snaps photos when it recognizes you’re smiling or making another expression.</p>",
            "<p>The Pixel 3 now includes Gmail’s Smart Compose, which automatically suggests phrases to use within emails, depending on the context, to help you write your emails faster. There’s also Gboard built into the device, which will recommend things like stickers and GIFs to use while texting.</p>",
            "<p>Google’s new smartphone also includes <a href=\"https://www.digitaltrends.com/mobile/apple-screen-time-and-google-digital-wellbeing/\">Digital Wellbeing</a>, which was introduced with the launch of Android P. You’ll be able to see how much time you’re spending on your phone and can set different time limits on specific apps. There’s also a new feature that will allow you to turn on Do Not Disturb mode by simply flipping your Pixel 3 over — which will mute notifications or rings.</p>",
            "<p>We all know how annoying it is to receive tons of phone calls from unknown numbers, only to pick up and realize it’s a telemarketer. That’s why we love that the Pixel 3 can answer for you instead. When you tap the “Screen Call” button, it will answer for you and ask who is calling and why. The conversation will then be transcribed in real time on your display, so that you can choose if you’d like to pick up. You also have the option of marking it as spam, asking for more information, or choosing to call back later. The feature will be available on the Pixel 3 in the U.S. right out of the box.</p>",
            "<p>After a full year of smartphone manufacturers <a href=\"https://www.digitaltrends.com/mobile/why-are-android-phone-makers-embracing-the-notch/\">adopting the notch design</a> that was first made popular by Apple’s iPhone X, Google has jumped on the bandwagon as well. As with any trend, the novelty soon wears off and the design starts to feel overdone — which is why we were disappointed to see the Pixel 3 XL feature the notch at the top of the display.</p>",
            "<p>The Pixel 3 and 3 XL feature 2,915 mAh and 3,430 mAh batteries, respectively, but we wish both phones had bigger batteries. We’d like them to last beyond a day before needing a charge. While the Pixel 3 has a bigger battery than the Pixel 2, the Pixel 3 XL actually has a slightly smaller battery than the Pixel 2 XL, though the new, more efficient processor should allow for longer battery life in the new phones. Either way, we expect to get about a full day’s worth of battery life — at most — with the batteries in the Pixel 3 and Pixel 3 XL.</p>",
            "<p>Pricing for the Pixel 3 is a bit high, starting at $800, while the 3 XL is $900 — both phones are more expensive than last year’s Pixels. If you want the 128GB storage capacity, you’ll have to put down an extra $100. While it does come with a few more capabilities and a slightly tweaked design, it doesn’t offer any dramatically new features (like a Face ID-esque unlocking system) that warrant the Pixel 3’s $150 jump in price over last year’s <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-review/\">Pixel 2</a>. We would’ve liked for the new smartphones to stay similarly priced to last year’s models.</p>",
            "<p>Even with the third iteration of the device, Google has yet to change the overall design of the Pixel. As with its predecessors, the Pixel 3 includes a matte finish and two-tone design with a fingerprint sensor in the middle, along with a camera lens in the top left. The only two major design changes are the notch (as mentioned before) and the fact that Google has gone with an all glass back — but we do like that it still feels like a matte finish, but isn’t as slippery as its predecessor. If it weren’t for the notch and new color variants, it’d be tough to tell the difference between the new Pixel phones and the ones that came before. They have price tags to match the top flagships, but the new Pixels don’t really look or feel like premium flagship phones.</p>",
            "<p>Even though we weren’t expecting it, we were definitely secretly hoping for the return of the headphone jack. Google made it clear with the Pixel 2 that it was completely doing away with it, shipping a USB-C-to 3.5mm adapter with the phone instead. But this time around, the Pixel 3 comes equipped with USB-C Pixel headphones that you can use, which also allows you to talk to Google Assistant.</p>"
        ]
    },
    {
        "title": "\n\t\tGoogle has officially stopped selling the original Google Pixel\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>The Google Pixel 2 and Pixel 2 XL may be the current stock Android kings, but not everyone has $650 or more to spend on a phone. Those who don’t could previously have purchased the last-generation <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-review/\">Google Pixel</a>, which is still a very nice phone in its own right. Now, however, that option is gone — Google has removed the device from its online store.</p>",
            "<p>Not only does the phone seem to be out of stock, but it’s been completely removed from the store. If you hit a link to the Google Pixel on the Google Store, you’ll be redirected to a generic <a href=\"https://store.google.com/category/phones?srp=/product/pixel_phone\" target=\"_blank\" rel=\"noopener\">landing page</a> for the Pixel lineup — which only shows the <a href=\"https://www.digitaltrends.com/mobile/google-pixel-2/\">Google Pixel 2</a> and related accessories. Google confirmed directly to Digital Trends that the Google Pixel and Pixel XL will no longer be available from the Google Store.</p>",
            "<p>It does somewhat make sense, even if it’s a little disappointing. Google probably wasn’t selling all that many Pixel units at this point, especially considering the fact that it only gave it a discount of around $100 when the Pixel 2 came out. Users that want a cheaper stock Android device can still turn to the likes of eBay, where the phone comes a lot cheaper. Some third-party retailers are also still selling the phone, though we’re not sure how much longer that will last. Currently, Amazon is selling both new and refurbished versions of the Google Pixel and Google Pixel XL</p>",
            "<p>Of course, there are plenty of rumors that the move is more to make room for a new generation of Pixel devices than anything else. We expect the Pixel 3 to launch sometime around October, which is when the first Pixel and the Pixel 2 launched. This time around, however, Google is rumored to be working on three Pixel devices, one of which will likely be a more midrange device aimed at those who want a stock Android phone from Google but don’t want to spend the ton of cash needed for the flagship device.</p>",
            "<p>When the Google Pixel was launched, it marked a change for Google, which wasn’t previously really a hardware manufacturer. Since then, the company has seriously begun embracing hardware, not just through phones, but also with the Pixelbook laptop, Pixel Buds, and more.</p>"
        ]
    },
    {
        "title": "\n\t\tPixel 3 Lite and Pixel 3 Lite XL: Everything you need to know\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Google Pixel 3</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-xl-review/\">Pixel 3 XL</a> may already be considered two of the best Android phones out there, but they’re not cheap, and it looks like Google may be preparing some lower-cost alternatives. Rumors say Google is working on the Pixel 3 Lite and Pixel 3 Lite XL, two budget options for those who want a Google smartphone experience, but don’t want to pony up the cash for <a href=\"https://www.digitaltrends.com/mobile/google-pixel-3-news/\">the Pixel 3 or Pixel 3 XL</a>.</p>",
            "<p>Here’s what we know about them so far.</p>",
            "<p>Should we expect the Pixel 3 Lite range to be much less powerful than the Pixel 3 range? That seems the most likely outcome — but how much of a downgrade could we expect?</p>",
            "<p>The latest leaks come from <a href=\"https://browser.geekbench.com/v4/cpu/11630546\">a Geekbench score</a> which claims to be for the Pixel 3 XL Lite, equipped with a Snapdragon 710 — largely in line with previous rumors that the larger Lite phone would come with this processor. It’s likely the small Pixel 3 Lite will be equipped with the Qualcomm Snapdragon 670 processor, which has so far been largely featured in phones targeted at Asian markets.</p>",
            "<p>RAM numbers are high even on midrange phones these days, and the same Geekbench results show the Pixel 3 XL Lite to come with 6GB of RAM. We expect there to be other configurations available, and wouldn’t be surprised to see both models start at 4GB. There’s no mention of storage space, but 64GB seems likely. Most other midrange phones would come with a MicroSD card slot to boost storage, but <a href=\"https://www.androidpolice.com/2018/12/09/google-pixel-3-lite-and-pixel-3-lite-xl-appear-in-new-leak/\">sources have noted</a> the apparent lack of such a slot.</p>",
            "<p>On the back, there’s a 12-megapixel camera, while the front of the device has an 8-megapixel front-facing camera. Powering it all is a 2,915mAh battery.</p>",
            "<p>With a name like Lite, you’d expect to pay a little less for these Pixel phones than the regular Pixel phones. The leaks so far indicate the phones will end up costing between $400 and $500, several hundred dollars less than the regular Pixel phones.</p>",
            "<p>When will they be released, and where? Google has potentially signed up with Verizon to launch the Pixel 3 Lite and Pixel 3 Lite XL sometime in the spring this year, according to sources speaking to <a href=\"https://www.androidpolice.com/2018/12/27/source-google-will-launch-the-pixel-3-and-3-xl-lite-on-verizon-in-spring-2019/\" target=\"_blank\" rel=\"noopener\">Android Police</a>. It was speculated early on the Lite Pixel phones would not be sold in the U.S., and would instead head to other markets including India, China, and Russia. A Verizon deal would obviously make this assumption false.</p>",
            "<p>Will the Lite Pixels look the same as the Pixel 3 and 3 XL? In this <a href=\"https://www.youtube.com/watch?v=VO9eW1SRQAM\">video</a> posted by <a href=\"https://www.youtube.com/channel/UCWJedqvdP2gB2f3qaJCO05g\">91Mobiles</a>, both the Pixel 3 Lite and Pixel 3 XL Lite are apparently shown in a full 360-degree render. It states the display sizes for both phones will be 5.5 inches and 6 inches, as well as some other details like the plastic body and return of the 3.5mm headphone jack. Interestingly, it seems the Pixel 3 Lite XL lacks its bigger brother’s divisive notch.</p>",
            "<p>The first indication of a Pixel 3 Lite was <a href=\"https://rozetked.me/articles/3751-eksklyuziv-pixel-3-lite-sargo-v-nashih-rukah-s-jack-3-5-i-snapdragon-670\" rel=\"noopener\">leaked online by Russian tech blogger Rozetked</a>, who posted a hands-on video of an unreleased Pixel 3. The Pixel 3 Lite sports a similar style to the Pixel 3, but only has a display resolution of 2220 x 1080. It also appears to have a headphone jack, unlike the other two Pixel 3 devices, and a slightly thicker polycarbonate build.</p>",
            "<p>When you buy a Pixel phone, you expect <a href=\"https://www.digitaltrends.com/mobile/best-camera-phones/\">a great camera</a>. so how about the Pixel 3 Lite? Rumors claim the Pixel 3 Lite has the same 12.2-megapixel camera sensor as its flagship siblings, and if it does, that’s a huge selling point for the phone. The photo samples you see here are apparently those taken with the Pixel 3 Lite.</p>",
            "<p>We’ll update this article as we hear more about this possible new midrange Pixel line.</p>",
            "<p><i>Updated on January 15, 2019: Benchmark scores for the Pixel 3 XL Lite have surfaced.<br>\n</i></p>"
        ]
    },
    {
        "title": "\n\t\tHow to watch the October 9 ‘Made by Google’ event\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>After months of rumors and leaks, Google is finally ready to unveil its latest and greatest creations, including the new Google Pixel 3 and Pixel 3 XL smartphones — and possibly a new Chrome OS 2-in-1, a Google Home hub, and more. Here’s <a href=\"https://www.digitaltrends.com/mobile/what-to-expect-from-google-october-event-2018/\">what we expect from Google at its October 9 New York event</a>.</p>",
            "<p>The event starts at 11 a.m. ET on October 9 — that’s 8 a.m. PT if you’re on the West Coast, or 3 p.m. GMT for our U.K.-based readers.</p>",
            "<p>Of course, you might be wondering how you can watch the Google event for yourself — thankfully, there are plenty of ways to do so. We’ve done the research so you don’t have to.</p>",
            "<p>Perhaps the easiest way to watch the event is straight from the Made by Google YouTube channel, which will livestream the event once it begins. Through YouTube, you can watch the event on any phone and any computer without the need for an extra app, which makes it one of the easier ways to watch Google unveil its new products.</p>",
            "<p>The YouTube stream is scheduled to start around 20 minutes before the event — though if you do log on at 11 a.m. ET on the dot, we don’t think you’ll miss much besides pre-event music and perhaps a few ads.</p>",
            "<p><a href=\"https://www.youtube.com/channel/UCIG1k8umaCIIrujZPzZPIMA\" target=\"_blank\" rel=\"noopener\">Stream the Made by Google event on YouTube.</a></p>",
            "<p>As Apple did for its last event, Google will also be livestreaming on Twitter — so if you prefer to use the Twitter app for livestreaming, then you’re in luck. Unlike the YouTube stream, the Twitter stream is scheduled to start at 11 a.m. There may be a benefit to watching on Twitter if you’re interested in seeing what others think of the new products — live tweets related to the event will appear below the livestream.</p>",
            "<p><a href=\"https://twitter.com/i/events/1046820267849179137\" target=\"_blank\" rel=\"noopener\">Stream the Made by Google event on Twitter.</a></p>",
            "<p>Whether or not you tune in to watch the Made by Google event, we’ll have all the latest news, updates, and insights for you. <a href=\"https://www.digitaltrends.com/topic/google-announcements/\">Head to our roundup to check out all of our Made by Google event-related coverage</a>.</p>"
        ]
    }
]