[
    {
        "title": "Samsung Galaxy S9\nreview",
        "author": [
            "Gareth Beavis"
        ],
        "text": [
            "<p><strong>Update: </strong><em>The Samsung Galaxy S9 is continuing to drop in price, but it's also getting older and will soon be superseded by the </em><a href=\"https://www.techradar.com/news/samsung-galaxy-s10\"><em>Samsung Galaxy S10</em></a><em>.</em></p>",
            "<p>The Samsung Galaxy S9 is one of the best phones available. It's a phone that leads the charge where the <a href=\"https://www.techradar.com/reviews/samsung-galaxy-s8-review\">Galaxy S8</a>, one of the best phones we've ever tested, left off - but it's not as much of an upgrade, even though it makes our list of the <a href=\"https://www.techradar.com/news/best-cameraphone\">best camera phones</a>.</p>",
            "<p>Well, that's at first glance, because there is a raft of updates that some looking to buy the Galaxy S9 would find appealing. Yes, the design is identical to the Galaxy S8, and in reality this really should have been the 'S' variant of that model if Samsung ever wanted to ape Apple's naming strategy.</p>",
            "<p>But there's also a new, high-power camera on the back that brings genuine innovation in the dual-aperture shutter, as well as a more robust frame and so, so much more power under the hood.</p>",
            "<p>The screen is brighter and the dual speakers make this more of a media marvel - and the Galaxy S9 fixes one major flaw with the S8 by making it easy to unlock the phone with your face or finger, which 2017's model failed at - and that's why we've named it as one of our <a href=\"https://www.techradar.com/news/best-phone\">best smartphones</a> around at the moment.</p>",
            "<p>If this sounds like we're talking up an uninspiring phone, that's partly true - but we wanted to make sure you knew the big changes on the S9 if you were confused on why it looks so similar to last year's model.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"Samsung Galaxy S9 review\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/dcezPLiHGvcT5xHhcrdzX6-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/dcezPLiHGvcT5xHhcrdzX6-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/dcezPLiHGvcT5xHhcrdzX6-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/dcezPLiHGvcT5xHhcrdzX6.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/dcezPLiHGvcT5xHhcrdzX6.jpg\"></p>",
            "<p>These plus points are also set against a backdrop of a high price; we’re not talking <a href=\"https://www.techradar.com/reviews/iphone-xs-review\">iPhone XS</a> levels here, but it’s still one of the more expensive options you can buy. The larger <a href=\"https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review\">Samsung Galaxy S9 Plus</a> with a 6.2-inch screen is even pricier.</p>",
            "<p>So if you’re looking to replace a 2016 phone, do all the new features really offer enough to make the Galaxy S9 a worthwhile upgrade, or is the cheaper Galaxy S8 still the best option?</p>",
            "<p>The Samsung Galaxy S9 release date was March 16 2018. The Galaxy S9 price at launch was £739, $719.99, or AU$1,199 SIM-free directly from Samsung, but it's much cheaper now.</p>",
            "<p>In the UK, the original price was a huge price jump over last year's handset, which cost £689 at launch. However, that price has now dropped, and if you shop around you can find the Galaxy S9 for around £475 in the UK (you can check out the latest and greatest <a href=\"https://www.techradar.com/deals/samsung-galaxy-s9-deals\">Galaxy S9 deals</a> here) and for around $600 in the US depending on where you shop, making it a much more attractive proposition.</p>",
            "<p>In terms of a UK cost on contract you can expect to pay between £32 and £50 per month for a decent slug of data, although with some contracts you’ll need to pay a little upfront too.</p>",
            "<p>There aren’t any storage variants of this phone though in the UK or US, with only the 64GB option on sale, but in some markets the Galaxy S9 is available in 128GB and 256GB builds.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"Samsung Galaxy S9 review\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/kL53PvnhTeAD5hGB7mDq6Y-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/kL53PvnhTeAD5hGB7mDq6Y-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/kL53PvnhTeAD5hGB7mDq6Y-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/kL53PvnhTeAD5hGB7mDq6Y.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/kL53PvnhTeAD5hGB7mDq6Y.jpg\"></p>",
            "<p>It took us a little while to come around to the idea of AR Emoji... and then not too long to get bored by them again.</p>",
            "<p>Let's be honest here: these are a clear response to Apple's Animoji, which gained a lot of attention when the iPhone X launched, and which make use of the TrueDepth camera on the front of the iPhone X (and now the iPhone XS, <a href=\"https://www.techradar.com/reviews/iphone-xs-max-review\">iPhone XS Max</a> and <a href=\"https://www.techradar.com/reviews/iphone-xr-review\">iPhone XR</a>), and the <a href=\"https://www.techradar.com/news/ios-12\">iOS 12</a> update has a similar Memoji trick.</p>",
            "<p>Samsung's offering feels like a watered-down version of this, albeit one with a bit more personality. To create your own little avatar you simply smile into the front-facing camera, and the Galaxy S9 creates your own digital version of you.</p>",
            "<p>Once it’s created, you can change your avi’s hair and skin color and choose an outfit – it's a shame there aren't more customization options here, as the outfits are a bit limited and the hair colors aren’t particularly nuanced. </p>",
            "<p>This may seem like a tiny thing, but if you can't make your AR Emoji look like you then you – and your friends – are going to struggle to engage with it.</p>",
            "<p>In our testing we found that we needed to create our avatar a few times, as there were occasional glitches like a weird face shape or the wrong-colored eyes. </p>",
            "<p>We also had to get used to the fact that it doesn't look like us all the time, although in some of the instantly-generated GIFs you can use for social media we suddenly saw that our AR Emoji mimicked some of our features well from different angles.</p>",
            "<p>Those GIFs are probably the best thing about this new feature – and they get tiresome relatively quickly. You send a few to friends on compatible apps (the AR Emoji GIFs are baked into the Galaxy S9's keyboard, but you can't add them in Twitter or Gmail, only in apps like WhatsApp at the moment), but the novelty wears off pretty quickly.</p>",
            "<p>The other thing you can do is record a video of yourself speaking as the AR Emoji... and this is where things start to unravel. The Galaxy S9 picks up most of your features, but also gives your avatar a little flickering mouth or eye at times when the camera loses you.</p>",
            "<p>It shows that, to make this feature work properly, brands need a more powerful camera, rather than just relying on software and the front-facing option.</p>",
            "<p>AR Emoji are fun for a little while, but on their own they're certainly not a reason to buy this phone.</p>",
            "<p class=\"mid__article\"></p>",
            "<p>We were thoroughly disappointed by Bixby on the Galaxy S8 last year, as it promised to be the ultimate digital assistant and, well, it wasn't.</p>",
            "<p>It simply couldn't do enough – it wasn’t able to work out what you wanted contextually, and it wasn’t able to start or control enough apps. We could forgive the gestation period for this feature if it wasn't for the fact that Google Assistant is already on the phone, and incredibly capable.</p>",
            "<p>However, Samsung has upgraded Bixby on the Galaxy S9, and kept the Bixby button on the side of the device to allow you to interact with your assistant. You use the button as on a walkie-talkie, pressing to talk to Bixby and releasing when you’ve delivered your command… but it's a bit slow to catch up.</p>",
            "<p>Bixby can be too literal – wanting to set a timer preset rather than just starting a countdown for example – and while you can ask it to take a picture and send it to a friend the whole process takes around 30 seconds – and that's assuming Bixby can find the friend to start with – in which time you’d rather just do it manually.</p>",
            "<p>The Galaxy S9 also keeps telling us that we can dictate using Bixby, but this was never 100% accurate – it was pretty darn good, considering that you're essentially talking to a baby robot, but we needed to edit our words before sending.</p>",
            "<p>Bixby Vision has come a long way though – and the fact that it's turned off by default is just beautiful. No longer do the little green fireflies automatically dance across your viewfinder when you're trying to take a picture of your car, dog, mother or laundry basket (to show her you've done it all) as the phone tries to work out what's being looked at.</p>",
            "<p>However, when you do turn on Vision the features are pretty useful. Bixby is much, much better at being able to work out what it's seeing than what it’s hearing, and can give accurate results on the web for things like comics, lamps and nature scenes. </p>",
            "<p>The translation tool is also very strong – it comes up with some weird answers here and there, but on the whole it's very easy to work out what you're looking at. Samsung is making a big deal about this feature, although in reality it's a bit niche... you'll need to be in a foreign country, with data, and completely unable to work out what you're looking at.</p>",
            "<p>So while it's good that Bixby has been upgraded, to at least bring some sense to having that button on the side of the phone, it's still a novelty rather than a must-have feature. </p>",
            "<p>Mapping the button to Google Assistant is still a far better way to get the most from your phone with your voice (although you’ll need to download a third party app to do it), despite it being more limited in scope... at least it manages the things it can do very well.</p>",
            "<p>It's a shame Samsung doesn't offer the option to switch the button to Google Assistant, as we enjoyed the Assistant button on the <a href=\"https://www.techradar.com/reviews/lg-g7-thinq-review\">LG G7 ThinQ</a>.</p>",
            "<p>Anyone who read our Galaxy S8 review last year would have realised quite quickly that the biometric unlocking features of that phone almost made it unusable. The fingerprint scanner was too hard to reach, the iris scanner too unreliable and the facial recognition just too poor.</p>",
            "<p>Samsung needed to do something, and it has, with all three features now working seamlessly and interchangeably. </p>",
            "<p>Intelligent Scan marries the iris scanner and facial recognition to make unlocking your phone with your face a far, far simpler task, and as mentioned the fingerprint scanner is much easier to hit.</p>",
            "<p>The speed of the Intelligent Scan feature is so much better than last year... where the iris scanner and facial recognition on the S8 were between 30% and 50% accurate, the two together on the Galaxy S9 yield success almost every time.</p>",
            "<p>In low light the iris scanner is still a bit slow to react, and not always pleased to let you in (in this case, Apple's Face ID absolutely destroys it for accuracy and ease of use), but it's so simple to just flick your finger to the scanner on the back that we never had an issue.</p>",
            "<p>That's a real benefit over the iPhone X and XS, keeping the fingerprint scanner.</p>",
            "<p>There are a couple of flaws with the biometric system. First, the 2D scan of the face the S9 makes to recognize you isn't as secure as other methods, like the fingerprint scanner or Apple's Face ID.</p>",
            "<p>That's not a huge problem for us – the fingerprint scanner is a better way of paying for things anyway, and really biometric unlocking is more about convenience than it is security. </p>",
            "<p>We weren't able to dupe the Samsung Galaxy S9 with a picture of our face, so if you lose your phone you can feel secure in the knowledge that the thief isn't getting in, which is what most of us really want.</p>",
            "<p>Second, and more frustratingly, you can’t really unlock the phone when it’s placed on a table – the field of vision for the scanner is limited, so unless you weirdly shove your head over it you won’t get in, whereas Apple’s Face ID offers a much wider viewing angle.</p>",
            "<p>The other key feature that Samsung is talking up on the Galaxy S9 is the improved speaker setup. If you're tired of hearing sound shoot out the bottom of your phone, you'll appreciate that the top earpiece is now able to fire out sound towards your face. </p>",
            "<p>These speakers have also been tuned to support Dolby Atmos sound, giving you a sense of space from the audio coming out from your phone.</p>",
            "<p>Given how thin this phone is, the overall volume and quality of sound coming out of it is impressive. If anything the volume can go a little too high, and we found ourselves turning it down on occasion, despite only watching videos on social media.</p>",
            "<p>The quality isn't the <em>best</em> on the market – there's definitely a little more punch and clarity from the iPhone X, where the Galaxy S9 is a little bit muddier – but the idea here isn't to replace a Bluetooth speaker, but rather provide a decent experience when listening to music or podcasts without earphones.</p>"
        ]
    },
    {
        "title": "Samsung Galaxy S9\nreview",
        "author": [
            "Gareth Beavis"
        ],
        "text": [
            "<p>It would be too easy to say the Samsung Galaxy S9 is just a carbon copy of the Galaxy S8... but it's very, very close.</p>",
            "<p>There are a few slight changes that make a big difference though, starting with the materials used to make this phone. The fact it's using Gorilla Glass 5 is a big step forward, as it means  the phone is even better able than its predecessor to withstand knocks and drops, removing the need for a case if you're not into encapsulating your new expensive phone.</p>",
            "<p>The aluminum used in the construction of the device is also more robust, so less twisting is possible should you accidentally feel the need to warp your phone.</p>",
            "<p>One thing we noticed during our first few weeks of using the phone was the lack of scuffing – if you're using a modern smartphone without a case these days you'll often find that it soon picks up a few nicks – further evidence of an upgrade on the materials used.</p>",
            "<p>But overall it's a very similar design to last year, and only turning the Galaxy S8 and S9 over to reveal their backs will reveal the main difference: the fingerprint sensor has been moved below the camera, rather than being located to the right of it, in a bid to make it more accessible.</p>",
            "<p>And, thankfully, it is more accessible. Where last year the placement of this sensor nearly ruined the Galaxy S8, the fact that it's now so easy to land a finger on it makes the Galaxy S9, well, as simple to unlock as a phone should be.</p>",
            "<p>Thanks to packing a 5.8-inch screen and very little bezel above and below the display, the Samsung Galaxy S9 is easy to manage one-handed while still offering a lot of screen to look at.</p>",
            "<p>Samsung continues to offer a headphone jack, which will be welcomed by the reams of people who haven't invested in a pair of Bluetooth headphones, or don't want to use a dongle adaptor with their favorite pair of wired cans. </p>",
            "<p>It's well placed on the bottom of the phone to the left, and easily lets the phone slip into the pocket with a pair of earbuds connected.</p>",
            "<p>Unfortunately, the Bixby button remains on the left-hand side of the phone, right in the middle. </p>",
            "<p>As you'll see later, Bixby serves a better purpose on this phone, but it's still not enough to warrant a dedicated key – and one that feels like a volume switch when sliding your finger down the side looking for it in the pocket.</p>",
            "<p>Holding the Samsung Galaxy S9, you'll definitely feel that you've got a phone that's worth a little more money. </p>",
            "<p>The design is still as attractive as ever, the glass shimmering nicely, the buttons offering a perfect travel and the balance in the hand feeling like just the right mix of strength and a lighter weight.</p>",
            "<p>The only thing we can really criticize (apart from the Bixby button's presence) is that it really sucks up fingerprints. The back of your phone will be a smudgy mess in no time – but that’s a natural result of it being made out of glass, and a quick wipe will restore its looks.</p>",
            "<p>Color choices are limited with it being available in Midnight Black, Lilac Purple, Coral Blue, Titanium Gray and Sunrise Gold. That last one is a relatively new addition for the US market, and it's worth noting you won't be able to buy every color in your country.</p>",
            "<p class=\"mid__article\"></p>",
            "<p>The Samsung Galaxy S9 screen has already been independently judged to the very best on the market, bringing with it the best in color reproduction, brightness, accuracy and overall sharpness.</p>",
            "<p>It's also been dubbed, by DisplayMate, which conducted the tests, as the least reflective display on the market, meaning you'll be able to see more of the on-screen action when you're in bright sunlight, or in a room with a strong light behind you.</p>",
            "<p>But those are official findings made in lab conditions – the bigger question is whether the 5.8-inch display Samsung has slapped on the Galaxy S9 is actually any good in real-life testing.</p>",
            "<p>The good news for those looking to buy this phone is yes, the screen offers phenomenal quality. The color reproduction, the brightness, the clarity of the screen are all faultless in our eyes, and actually Samsung has managed to make the Super AMOLED technology used for the display deliver images that are more true to life than ever.</p>",
            "<p>Previous Samsung phones have been overly colorful when it comes to color rendition, being known for images that have an almost cartoon-like character, but if anything we'd like a dash <em>more</em> color from the Galaxy S9.</p>",
            "<p>You can get this by heading into the settings and choosing a different color mode, and if you're willing to tweak some settings, you can alter the color and white balance of the screen yourself. </p>",
            "<p>It's a world away from what Apple does with its screens, not allowing the slightest alteration, but Samsung wants to make sure that, if you're willing, you can get your perfect color balance.</p>",
            "<p>However, while the display technology is good, the auto-brightness still has issues – and it feels like we say this far too often about Samsung phones. The device always errs on being too bright, and that's a battery-sucker.</p>",
            "<p>What's interesting on the Galaxy S9 is that phone actually learns your brightness preferences, noting when you boost or dim the screen in certain situations, and mimics those settings for you in similar conditions.</p>",
            "<p>We had to reset this to try and get a more useful brightness level, as we were artificially boosting it to look at certain elements of the display, but it's an advanced move from Samsung, and shows just how much the brand is trying to make its phones more useful without the need for settings tweakery.</p>",
            "<p>Users of some phones, such as the <a href=\"https://www.techradar.com/reviews/google-pixel-2-xl-review\">Google Pixel 2 XL</a>, have reported color shifts when viewing the screen at an angle, and while the Galaxy S9 does have a more blue tinge when moved around, it's far from terrible. </p>",
            "<p>That said, place it next to the <a href=\"https://www.techradar.com/reviews/iphone-xs-review\">iPhone XS</a> and you’ll see that Apple has tuned Samsung’s technology to be much better looking from an angle. The <a href=\"https://www.techradar.com/reviews/samsung-galaxy-note-9-review\">Samsung Galaxy Note 9</a> has also launched since Samsung's phone, and that has a screen that's both marginally better and a lot bigger.</p>",
            "<p>The low screen reflectance really does come to the fore in day-to-day use – we found it possible to watch an episode of a Netflix TV series with a bright window behind us. It wasn't the most pleasant experience, as the reflections were visible, but given it wasn't that long ago that we weren't able to use our smartphones in the sunlight, we've come an incredibly long way.</p>",
            "<p>The Samsung Galaxy S9 has also been certified for use with Mobile HDR Premium content – there's not a lot of that around at the moment, but Samsung has been careful to make sure its displays can handle the top standards on the market.</p>",
            "<p>That said, the S9’s display doesn’t support Dolby Vision, the brand’s advanced HDR format, which is a shame given that Dolby's Atmos audio platform is supported on the phone.</p>",
            "<p>The Edge display is back from Samsung, making use of the curved edges rolling into the side of the chassis. Using the Edge screen to set your favorite apps, key contacts or record a section of the screen as a GIF seem like really cool things to be able to do… but in reality, we just forget it’s there.</p>",
            "<p>The Samsung Galaxy S9 isn’t really that different to the S8 in terms of its interface. It’s running Android 8 Oreo out of the box, and it’s also signed up to Google’s Project Treble, meaning we’ll be seeing faster upgrades to the latest versions of Android in the future.</p>",
            "<p>Indeed, an update to <a href=\"https://www.techradar.com/news/android-pie-9-features-release-date-and-phones-list\">Android 9 Pie</a> is expected in early 2019. In fact, the roll out has already started in some regions as of mid-January.</p>",
            "<p>We’d argue that Samsung has one of the best implementations of an Android skin out there, with the settings, the notifications bar and the icon management on the home screen among the easiest to use.</p>",
            "<p>The Galaxy S9 apes the iPhone’s 3D Touch feature on the home screen, allowing you to long-press an app and have a selection of items pop up – be it playlists on Spotify, most-contacted friends on WhatsApp or the option to take a selfie with the camera – and jump straight to the one you want.</p>",
            "<p>Like the Edge screen on the side of the phone, where you can swipe your finger across and get access to quick shortcuts for apps, we just forget to use it so often., and it’s the same with the extra menu for the home screen apps.</p>",
            "<p>One thing we’re still perplexed about: why the Samsung Galaxy S9’s inbuilt keyboard is so bad. It’s not that it’s inaccurate (although it’s a long way from being perfect), but it learns but it learns wrong words, or capitalizes words randomly, then suggesting odd replacements when you correct it.</p>",
            "<p>Again It’s not a massive issue, but given that you need this keyboard to use AR Emoji GIFs properly we’d have expected Samsung to make it bulletproof on what could be one of the top-selling phones of 2018.</p>"
        ]
    },
    {
        "title": "Samsung Galaxy S9\nreview",
        "author": [
            "Gareth Beavis"
        ],
        "text": [
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"Samsung Galaxy S9 review\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/hfp4cwM6fQHdGadrKMiG4G-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/hfp4cwM6fQHdGadrKMiG4G-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/hfp4cwM6fQHdGadrKMiG4G-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/hfp4cwM6fQHdGadrKMiG4G.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/hfp4cwM6fQHdGadrKMiG4G.jpg\"></p>",
            "<p>According to the marketing materials, the single-sensor 12MP camera on the Samsung Galaxy S9 is the big change that’s going to inspire you to buy this phone.</p>",
            "<p>‘The Camera. Reimagined.’ would be a bold statement from any photography brand, let alone a smartphone maker, and in reality Samsung has been over-dramatic here.</p>",
            "<p>The key upgrade is the fact that the sensor can now switch between an aperture of  f/1.5 (for great low-light shots) and f/2.4 (for better brighter scenes), while improving the intelligence of the sensor so that it can analyse and improve your images more effectively.</p>",
            "<p>On top of this, Samsung has refined the photography modes on offer, allowing you to take myriad different styles of shot – and nearly all of them are useful and worth playing with.</p>",
            "<p>Let’s focus on the auto mode though, as that’s going to be the one that most Galaxy S9 users snap through. It’s excellent as ever, but possibly not that big of an upgrade over the Samsung Galaxy S8.</p>",
            "<p>In bright light, the pictures from the Galaxy S9 are without equal in terms of clarity; there’s a sharpness, brightness and overall quality that still stuns when you learn it’s come from a smartphone camera.</p>",
            "<p>The Galaxy S9 is also adept at shooting in low light, thanks to that lower aperture, which hasn’t been seen on a smartphone before. </p>",
            "<p>Yes, the images are a little on the muddy side, but when compared to low-light snaps from other top-end phones that were out when this launched (the iPhone X, for instance) the lack of the noise and the higher brightness is amazing.</p>",
            "<p>If we were to be picky, we’d say that some of the images we’ve taken lack a real pop of color – Samsung has seemingly decided that it wants its cameras to produce images that are more natural-looking, but this comes at the expense of vibrancy at times. </p>",
            "<p class=\"mid__article\"></p>",
            "<p>We found that just hitting the edit button and selecting the ‘auto’ enhancement created such an improved snap… why not have that all the time, Samsung?</p>",
            "<p>There’s also some definite shutter lag when moving quickly between scenes, as the autofocus and exposure take a moment to recalibrate before being ready to take a picture. </p>",
            "<p>On a few occasions we were trying to get a shot simply by taking loads of photos to see if one was in focus, but were delayed by the shutter lag.</p>",
            "<p>A bit of background light can also wash out the picture in auto mode, and even playing around with the pro settings didn’t make things much better – although we do have to doff our cap to the excellent abilities of said expert mode, as it’s not only comprehensive but also very easy to use.</p>",
            "<p>Those points aside, you’ll generally struggle to take a bad photo with the Galaxy S9. The clarity, even when the lens was zoomed, in some of the pictures we took, and the ability of the camera to pick out details in high-contrast scenes are impressive.</p>",
            "<p>We did have to take a shot a couple of times to get the right result on occasion, but we still managed to get a good snap in the end. The Galaxy S9’s ability to handle scenes with strong backlighting is also excellent, with bright sunlight not causing a subject the foreground to become a total silhouette.</p>",
            "<p>The selfie camera, coming in at 8MP, also handles low light well, although it doesn’t have the wider field of view some other smartphones offer, such as many top-end models from LG.</p>",
            "<p>This is compensated for by a panorama mode that allows you to swivel to get more people into the picture… it’s a little tough on the wrists, but it produces some decent effects.</p>",
            "<p>Samsung has also included a portrait mode that blurs the background for your Galaxy S9 selfies. It’s similar to what the TrueDepth camera can do on the <a href=\"https://www.techradar.com/reviews/iphone-xs-review\">iPhone XS</a>, and the effect isn’t that different, with some decent background blur, although you can’t take the ‘studio’ shots with the blacked out backing that Apple is shouting about at the moment.</p>",
            "<p>The other new feature is the super-slow-motion camera, which can capture 960 frames per second, turning a 0.2-second instant of movement into a six-second long slow-mo clip.</p>",
            "<p>In bright light, it’s exceptional… as long as you’re either holding the phone steady or are ready on the trigger. You can set the S9 to automatically sense movement, but this only works in bright light with the phone almost motionless; don’t expect this to work well in your hands. </p>",
            "<p>When it does work, it’s amazing, but too often we were stuck trying to find something interesting to shoot in slow-motion.</p>",
            "<p>The other option is to do it manually, which is much easier as the camera is constantly recording and so the action is recorded from the moment you want to start – there seems to be some caching going on so you don’t miss anything.</p>",
            "<p>But don’t think about trying to shoot slow-motion footage in low light – it gets very noisy and low quality, which is understandable given the amount of information that needs to be processed. </p>",
            "<p>You'll also notice that anything that flickers imperceptibly to the human eye - like stadium floodlights or TVs - will be picked up in a very strange manner.</p>",
            "<p>You can use the flash, but most scenes we wanted to film had a wider frame, and it was hard to illuminate them with a phone’s little LED.</p>",
            "<p>Overall, we had expected a little better from the Galaxy S9’s camera given the loud noises Samsung has been making about its performance, although the low-light capability does border on the astounding at times, and the fact that the camera is so powerful in all conditions means you’ll get some really great snaps.</p>",
            "<p>The color reproduction doesn’t impress us quite as much as something like the <a href=\"https://www.techradar.com/news/pixel-2\">Google Pixel 2</a> did at launch, however, and the iPhone X will sometimes offer a more well-rounded image quality – but overall, the Galaxy S9 has a simply awesome snapper for most scenarios, and playing with the settings really does reward.</p>",
            "<p>That said, other recent handsets have overshadowed it slightly, with the <a href=\"https://www.techradar.com/reviews/google-pixel-3-review\">Google Pixel 3</a> range, the <a href=\"https://www.techradar.com/reviews/huawei-mate-20-pro-review\">Huawei Mate 20 Pro</a> and the iPhone XS among others all topping it in our list of the <a href=\"https://www.techradar.com/news/best-cameraphone\">best camera phones</a>.</p>"
        ]
    },
    {
        "title": "Samsung Galaxy S9\nreview",
        "author": [
            "Gareth Beavis"
        ],
        "text": [
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"Samsung Galaxy S9 review\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/krWhENy8aQFqnj47MmGpPL-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/krWhENy8aQFqnj47MmGpPL-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/krWhENy8aQFqnj47MmGpPL-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/krWhENy8aQFqnj47MmGpPL.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/krWhENy8aQFqnj47MmGpPL.jpg\"></p>",
            "<p>We’re disappointed with the battery life in the Samsung Galaxy S9, as it’s not made the jump forward we expected.</p>",
            "<p>With the same 3,000mAh power pack on board as the Galaxy S8 and the same amount of pixels to drive, but with a more efficient processor, and with Samsung having had a year to refine the software, we were expecting big things from the Samsung Galaxy S9’s battery.</p>",
            "<p>What we got was something that’s a bit more ‘slippery’ than the Galaxy S8. Where we’d have around eight hours of battery life left when the indicator was showing 60% full, now we’re seeing the same numbers at 70%.</p>",
            "<p>The worry with Android phones is always that there’s a nefarious app playing around in the background, causing more power to be drained than necessary, but our constant checking showed that it was usually just the screen – which is brighter this year – drawing more power.</p>",
            "<p>What’s interesting here is that Samsung <em>has </em>clearly optimized things, as when we ran our standard video test (90 minutes of a Full HD video at maximum brightness) the Galaxy S9 only lost 17% of its battery.</p>",
            "<p class=\"mid__article\"></p>",
            "<p>That’s not the best we’ve seen on test (for comparison, the iPhone X lost just 10% using the same screen technology as Samsung), but it’s a marked improvement over the 23% the S8 lost last year… and the S9 has a brighter screen.</p>",
            "<p>The overnight test result was pretty standard – the battery lost 5% in an eight-hour period, which is bang-on average for a modern smartphone. Again, however, we’d have hoped for more from one of the top phones of the moment.</p>",
            "<p>Wireless charging is present once again, and Samsung remains one of the only brands to be compatible with both the Qi and PMA standards; in short, your Galaxy S9 will charge on any wireless pad.</p>",
            "<p>While fast charging is enabled via wireless as well, we didn’t note a particularly fast charge without wires – although that could be due to the fact that the Galaxy S9 took so long to ‘settle down’.</p>",
            "<p>We’ve been testing phones for a long, long time, and we always make sure to cycle the battery through a few charges before making any assumptions, as often it takes a few days to make sure all apps are optimized and patches downloaded, and for the phone generally just to shake itself out.</p>",
            "<p>This process took a lot longer than expected for the Galaxy S9, and after a week it was only just starting to settle… battery life gradually improved, but we’re still needing to boost the charge at least once to get through to the end of the day.</p>",
            "<p>Perhaps users will find this improves after a few weeks’ use… but based on what we’ve seen, the Galaxy S9 is only just a touch better than the <a href=\"https://www.techradar.com/reviews/iphone-8-review\">iPhone 8</a>, and weaker than last year’s Galaxy S8. For stronger battery life from a recent Samsung flagship, consider the <a href=\"https://www.techradar.com/reviews/samsung-galaxy-note-9-review\">Samsung Galaxy Note 9</a>.</p>"
        ]
    },
    {
        "title": "Samsung Galaxy S9\nreview",
        "author": [
            "Gareth Beavis"
        ],
        "text": [
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"Samsung Galaxy S9 review\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/dCCGw88uA2iiNuDEVGLk7A-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/dCCGw88uA2iiNuDEVGLk7A-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/dCCGw88uA2iiNuDEVGLk7A-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/dCCGw88uA2iiNuDEVGLk7A.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/dCCGw88uA2iiNuDEVGLk7A.jpg\"></p>",
            "<p>The Samsung Galaxy S9 is two things: first, it’s a very impressive smartphone, and one of the best in 2018. Second, it’s a disappointing upgrade over the Samsung Galaxy S8.</p>",
            "<p>The reason it can be both these things at once is that the Galaxy S8 was a brilliant phone, marred only by the biometric issues that made it hard to actually unlock the handset. In solving those issues Samsung has righted a big wrong from 2017, but beyond that there isn't really much that impresses.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"Samsung Galaxy S9 review\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/A9A9yEa2w4uswQAYKGJiq8-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/A9A9yEa2w4uswQAYKGJiq8-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/A9A9yEa2w4uswQAYKGJiq8-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/A9A9yEa2w4uswQAYKGJiq8.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/A9A9yEa2w4uswQAYKGJiq8.jpg\"></p>",
            "<p>And that's important, as the Galaxy S8 is still on sale for a lower price, thus making it a tempting alternative for those thinking of getting the new Samsung phone. </p>",
            "<p>With the Galaxy S9 offering the same design and screen as before, and only a few minor upgrades, Samsung is going to have a tough time convincing people they should go for the improved model.</p>",
            "<p>That said, those upgrades are mostly things that will actually benefit the user. The Galaxy S9 camera is exceptional in low light, which you'd expect given the innovative dual-aperture technology Samsung has used in this phone.</p>",
            "<p>The improved materials used in the construction offer a stronger phone, and while you won't feel that when picking it up, you'll be thankful for it a year or two down the line.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"Samsung Galaxy S9 review\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/9JZuefAXXz3RpWitm47XVA-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/9JZuefAXXz3RpWitm47XVA-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/9JZuefAXXz3RpWitm47XVA-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/9JZuefAXXz3RpWitm47XVA.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/9JZuefAXXz3RpWitm47XVA.jpg\"></p>",
            "<p>The relocation of the fingerprint scanner, combined with the far-more-accurate Intelligent Scan unlocking system, makes the Galaxy S9 eminently more usable than the Galaxy S8 – if you can't unlock your phone easily, it's pretty useless.</p>",
            "<p>AR Emoji has been given a big marketing push, but it's largely a novelty, and an uninspiring one at that. It needs more weighty hardware and software behind it to work effectively, so if you're enticed to buy the Galaxy S9 by this feature we'd advise against it.</p>",
            "<p>The extra speed on board is nice to see, but it's not really adding anything at this stage – what we did want to see was improved battery life, and we didn't get that.</p>",
            "<p>The camera is the big reason to go for the Samsung Galaxy S9, along with the uprated power and improved construction, but it's not a great leap forward. The camera flatters to deceive at times, with the color reproduction the main issue for us. </p>",
            "<p>It's annoying to see that a photo which only looks half-decent when you snap it can be instantly improved simply by adding an effect in post-processing – it's hard to work out why Samsung doesn't just do this automatically.</p>",
            "<p>The extra cost is going to be tough for some people to stomach, as you'll get a lot of the features here on the Galaxy S8, as long as you don't mind some finger gymnastics to get to the fingerprint scanner on the back and aren't bothered about having the best camera Samsung can create.</p>",
            "<p><em>Not convinced this phone is for you? Check out these instead:</em></p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/UDKrck3CmgirAaMw9ih7mf-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/UDKrck3CmgirAaMw9ih7mf-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/UDKrck3CmgirAaMw9ih7mf-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/UDKrck3CmgirAaMw9ih7mf.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/UDKrck3CmgirAaMw9ih7mf.jpg\"></p>",
            "<p>Bigger, newer and arguably better than the Samsung Galaxy S9, the Galaxy Note 9 is a similar phone in many ways but with a dual-lens camera, a stylus, a 6.4-inch rather than 5.8-inch screen, and a big 4,000mAh battery.</p>",
            "<p>It's a great productivity and media machine, but might be overkill for some users. It's also of course more expensive than the Galaxy S9, and from screen quality to design and power, it's not much of an upgrade in many of the key areas.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/B8UuQnfqmePnLgRkn3UEkj-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/B8UuQnfqmePnLgRkn3UEkj-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/B8UuQnfqmePnLgRkn3UEkj-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/B8UuQnfqmePnLgRkn3UEkj.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/B8UuQnfqmePnLgRkn3UEkj.jpg\"></p>",
            "<p class=\"mid__article\"></p>",
            "<p>Okay, so there aren't a huge number of people who switch between these two big brands’ handsets, but hear us out. The iPhone XS is a faster phone with a comparable battery life, and offers the kind of app stability that Android owners still lust after – that's a key thing.</p>",
            "<p>The camera is also very strong, but it's more expensive, and doesn't have a headphone jack. That said, along with the <a href=\"https://www.techradar.com/reviews/iphone-xs-max-review\">iPhone XS Max</a> it's the most impressive iPhone we've ever tested, so if you're thinking of making the jump then one of these would be the iPhone to jump to.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/8PBqc3qZGr8deMR7SXuaJE-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/8PBqc3qZGr8deMR7SXuaJE-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/8PBqc3qZGr8deMR7SXuaJE-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/8PBqc3qZGr8deMR7SXuaJE.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/8PBqc3qZGr8deMR7SXuaJE.jpg\"></p>",
            "<p>If, however, you're thinking of sticking with the Samsung Galaxy range and want the best out there, then the Galaxy S9 Plus is the way to go. It's a phone that has all the power of the S9, but adds in longer battery life and a better camera thanks to having dual sensors on the rear (which brings better quality photos, in our tests).</p>",
            "<p>It's more expensive, yes, but if you want something that just works well and offers a great screen experience, the S9 Plus could be called the S9 Turbo, such is the upgrade on a couple of the issues that irk us with the S9.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/tUsZb6SWDwTL5RNq6J2Ann-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/tUsZb6SWDwTL5RNq6J2Ann-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/tUsZb6SWDwTL5RNq6J2Ann-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/tUsZb6SWDwTL5RNq6J2Ann.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/tUsZb6SWDwTL5RNq6J2Ann.jpg\"></p>",
            "<p>When reviewing a new phone, we're often looking at the cheaper model from the previous year to work out if we'd recommend it over the latest handset – and in this case the Galaxy S8 is going to be the right choice for the many who want a cutting-edge Samsung phone without going to a plus-size model.</p>",
            "<p>The design and screen are pretty similar (the biometric issues mentioned above aside), and the camera isn't that far off in terms of quality. You're basically sacrificing low-light capabilities, AR Emoji and dual speakers for a lower cost – and that will be a worthwhile trade-off for many.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/Fpge8GvPK3V5tUiqWS7jrm-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/Fpge8GvPK3V5tUiqWS7jrm-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/Fpge8GvPK3V5tUiqWS7jrm-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/Fpge8GvPK3V5tUiqWS7jrm.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/Fpge8GvPK3V5tUiqWS7jrm.jpg\"></p>",
            "<p>If all these options are too expensive, maybe the OnePlus 6T is more your bag. It's got dual-cameras, face unlock and even an in-screen fingerprint scanner.</p>",
            "<p>It's also got a premium glass body and the latest flagship power under the hood, though like many new phones it's lacking a 3.5mm headphone port.</p>",
            "<p>The camera experience isn't as good as the S9 either and there's no wireless charging.</p>",
            "<p>However with a price tag which is much lower than its rivals, the handful of small trade-offs may well be worth it.</p>",
            "<p><em>First reviewed: March 2018</em></p>"
        ]
    },
    {
        "title": "Samsung Galaxy S9 on Black Friday is $200 off on Amazon",
        "author": [
            "Bill Thomas"
        ],
        "text": [
            "<p>If you’ve been waiting to get your hands on Samsung’s flagship phone, the <a href=\"https://www.techradar.com/reviews/samsung-galaxy-s9-review\">Samsung Galaxy S9</a>, but it’s always been just a bit out of your reach, today’s your lucky day.</p>",
            "<p>You can save a whopping $200 on Amazon in the US on the Samsung Galaxy S9, making it just <a href=\"https://www.amazon.com/Samsung-Galaxy-S9-Unlocked-Smartphone/dp/B079H6RLKQ/?th=1\" rel=\"nofollow\" target=\"_blank\">$519 for the 64GB model</a>. And that’s not all – all of the storage tiers are $200 cheaper for <a href=\"https://www.techradar.com/black-friday/black-friday-cyber-monday-2018-deals-in-usa\">Black Friday</a>. That means the <a href=\"https://www.amazon.com/Samsung-Galaxy-S9-Unlocked-Smartphone/dp/B07DFMJ6NF/?th=1\" rel=\"nofollow\" target=\"_blank\">128GB model is $569</a>, while the <a href=\"https://www.amazon.com/Samsung-Galaxy-S9-Unlocked-Smartphone/dp/B07DFLNCKH/?th=1\" rel=\"nofollow\" target=\"_blank\">256GB model sets you back just $639</a>. Those are great deals for one of this year’s best smartphones.</p>",
            "<p><!-- dbg:/fepssi//Samsung_Electronics/Samsung_Galaxy_S9 -->\n</p>",
            "<p>The Samsung Galaxy S9 is Samsung’s mainstream flagship, meant to compete with something like the <a href=\"https://www.techradar.com/reviews/iphone-xs-review\">iPhone XS</a> but at a notably lower price point. It features a lovely 5.8-inch Infinity Edge display, a powerful Snapdragon 845 SoC, and an IP68 rating so you don’t have to worry about getting it wet or dusty.</p>",
            "<p>It’s easily one of the best Android smartphones on market alongside its big brother, the <a href=\"https://www.techradar.com/reviews/samsung-galaxy-note-9-review\">Samsung Galaxy Note 9</a>.</p>",
            "<p>Here are the best Samsung Galaxy S9 prices on the internet right now, just in time for all those <a href=\"https://www.techradar.com/black-friday/black-friday-phone-deals-in-the-us\">Black Friday phone deals</a>.</p>",
            "<p class=\"mid__article\"></p>"
        ]
    },
    {
        "title": "The best Samsung Galaxy S9 prices and deals in January 2019",
        "author": [
            "Stephen Slaybaugh"
        ],
        "text": [
            "<p>Since the <a href=\"https://www.techradar.com/reviews/samsung-galaxy-s9-review\">Samsung Galaxy S9</a> launched, we've seen a few good deals pop up that lowered its price a nice amount. We saw the same thing with the Galaxy S8 the year before. Now, there are plenty of good deals on the Galaxy S9 at this time of year.</p>",
            "<p>With a starting price of $719 direct from <a href=\"https://www.samsung.com/us/smartphones/galaxy-s9/buy/s/Device/\" rel=\"nofollow\" target=\"_blank\">Samsung</a> and plenty of features and high-end specs, the Galaxy S9 is still a commendable phone. But, deals to that price make it all the sweeter. We've already got an assortment of deals to choose from.</p>",
            "<p><!-- dbg:/fepssi//Samsung/Samsung_Galaxy_S9 -->\n</p>",
            "<p>So, whether you want to try picking up the Galaxy S9 from a mobile carrier on a contract, snag it unlocked from a retailer, or just find the very best deal from either side, we've got the details you need.</p>",
            "<p>Below, you can get the lowdown on buying it from a carrier and you'll find the best prices for the Galaxy S9 unlocked. Whatever you choose, you can rest assured that you got a good deal on your new Galaxy S9.</p>",
            "<p class=\"mid__article\"></p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"Samsung Galaxy S9\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/ewFy7rG9fXwxRcTD3Ua7f5-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/ewFy7rG9fXwxRcTD3Ua7f5-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/ewFy7rG9fXwxRcTD3Ua7f5-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/ewFy7rG9fXwxRcTD3Ua7f5.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/ewFy7rG9fXwxRcTD3Ua7f5.jpg\"></p>",
            "<p><strong>Screen size: </strong>5.8-inches | <strong>Resolution: </strong>QHD+ | <strong>Rear camera: </strong>12MP | <strong>Weight: </strong>163g | <strong>OS: </strong>Android 8 Oreo | <strong>RAM: </strong>4GB | <strong>Storage: </strong>64GB | <strong>External storage: </strong>microSD up to 400GB | <strong>Battery: </strong>3000mAh</p>",
            "<p>So it's finally here, and our general impressions are predictably positive. The Samsung Galaxy S9 is really all about the camera, with most of the unveiling ceremony concentrating on the improvements that have been made to the front and rear snappers. It comes out of the box running off Android's latest Oreo operating system and a new chipset should make your using experience as swift as possible. We only wish it improved on the <a href=\"https://www.techradar.com/reviews/samsung-galaxy-s8-review\">Galaxy S8</a> more...</p>",
            "<p><strong>Read TechRadar's </strong><a href=\"https://www.techradar.com/reviews/samsung-galaxy-s9\"><strong>Samsung Galaxy S9 review</strong></a></p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/VgyagGS9HpAEPUQtUJBfrg-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/VgyagGS9HpAEPUQtUJBfrg-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/VgyagGS9HpAEPUQtUJBfrg-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/VgyagGS9HpAEPUQtUJBfrg.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/VgyagGS9HpAEPUQtUJBfrg.jpg\"></p>"
        ]
    },
    {
        "title": "Samsung Galaxy S9 Android Pie update begins rolling out",
        "author": [
            "Olivia Tambini"
        ],
        "text": [
            "<p>After weeks of beta testing, the long awaited <a href=\"https://www.techradar.com/news/android-pie-9-features-release-date-and-phones-list\">Android 9 Pie OS update</a> is ready for the <a href=\"https://www.techradar.com/reviews/samsung-galaxy-s9-review\">Samsung Galaxy S9</a>, meaning some users of the S9 and <a href=\"https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review\">Samsung S9 Plus</a> can now download the new operating system. </p>",
            "<p>Right now, the update is only available in the following countries: Germany, Switzerland, Italy, United Arab Emirates, Netherlands, and Turkey – however, it is in the process of being rolled out to the rest of the world, with the update expected to land globally in January 2019.</p>",
            "<p>So, if you're in the UK, US, or Australia, you shouldn't have too long to wait to get your hands on the update for your Galaxy S9 or S9+ – although exact timings are yet to be confirmed.</p>",
            "<p>The update for Android Pie should bring a number of upgrades to your Galaxy S9/S9+, including an improved user interface, enhancements to the Samsung keyboard, and adaptive brightness, among others. </p>",
            "<p>Don't have the Samsung S9? Not to worry, the Android Pie update is probably coming to your Android-powered phone as well. Here is the full schedule of updates for the different models:</p>",
            "<p class=\"mid__article\"></p>",
            "<p>Via <a href=\"https://androidcommunity.com/samsung-galaxy-s9-android-9-pie-os-upgrade-now-official-20181226/\" target=\"_blank\">Android Community</a></p>"
        ]
    },
    {
        "title": "Samsung Galaxy S9 Plus review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p><strong>Update: </strong><em>The Samsung Galaxy S9 Plus now has the likes of the Galaxy Note 9 and iPhone XS to compete with, but it remains a top phone and is now available at a slightly lower price. However, the </em><a href=\"https://www.techradar.com/news/samsung-galaxy-s10-plus-release-date-price-news-and-leaks\"><em>Samsung Galaxy S10 Plus</em></a><em> is fast approaching.</em></p>",
            "<p>Other than the newer <a href=\"https://www.techradar.com/reviews/samsung-galaxy-note-9-review\">Samsung Galaxy Note 9</a>, the Galaxy S9 Plus is Samsung's most advanced big phone thanks to its oversized screen and superb cameras – even if it all looks identical to last year’s <a href=\"https://www.techradar.com/reviews/samsung-galaxy-s8-plus-review\"><u>S8 Plus</u></a>. It's also Samsung's best phone. In fact, almost a year after launch it remains at the top of our <a href=\"https://www.techradar.com/news/best-phone\">best phones list</a>.</p>",
            "<p>Without dramatic changes to the design, it’s only an iterative update to the S8 Plus – but it’s an iterative update to an Android phone that sat near the top of our best phones list for around a year. That’s important to remember.</p>",
            "<p>We’ve tested the Galaxy S9 Plus for months now, and its low-light photos and big screen are the two most obvious highlights. It’s still Samsung’s grandiose 6.2-inch curved ‘Infinity’ display that will sell you on this more expensive phone over the 5.8-inch <a href=\"https://www.techradar.com/reviews/samsung-galaxy-s9\"><u>Galaxy S9</u></a>, but both handsets have an improved 12MP camera that boasts a f/1.5 maximum aperture.</p>",
            "<p>This is the first camera phone with such a wide aperture, giving the S9 and S9 Plus low-light and noise-defeating powers that, in many situations, are more advanced than those of even the <a href=\"https://www.techradar.com/reviews/google-pixel-2-review\"><u>Google Pixel 2</u></a>, our previous best phone camera, and new <a href=\"https://www.techradar.com/reviews/lg-g7-thinq\">LG G7 ThinQ</a> with its AI camera.</p>",
            "<p>That said, the newer <a href=\"https://www.techradar.com/reviews/google-pixel-3-review\">Google Pixel 3</a>, <a href=\"https://www.techradar.com/reviews/huawei-mate-20-pro-review\">Huawei Mate 20 Pro</a> and <a href=\"https://www.techradar.com/reviews/iphone-xs-review\">iPhone XS</a> now have it beat in our <a href=\"https://www.techradar.com/news/best-cameraphone\">best camera phone ranking</a>.</p>",
            "<p>The S9 Plus benefits from a rear dual-lens camera, too, giving it the same telephoto capabilities as the previous year’s <a href=\"https://www.techradar.com/reviews/samsung-galaxy-note-8-review\"><u>Note 8</u></a> (the S9 has one lens on the back). Its primary lens can also capture super-slow-motion video at 960 frames per second if you’re serious about video and, if you’re not, uses its 8MP front-facing camera to paint your face with AR Emoji props and masks. It's Samsung's spin on Apple's Animoji, but don't get too excited about it. It's rather unimpressive, unlike the rest of the phone.</p>",
            "<p>Samsung has listened to the negative feedback regarding last year’s handsets, and has wisely moved its offset rear fingerprint sensor to a center-aligned position. It’s a more natural location, although you may not even need it thanks to the face unlock and iris scanning onboard and working at the same time. Addressing another shortcoming of the S8 Plus, Samsung finally gives its flagship phones stereo speakers for superior sound.</p>",
            "<p>If you’re thinking a sudden emphasis on stereo speakers, face unlock, AR Emoji and vertically stacked 12MP dual cameras sounds as if these are Samsung’s take on <a href=\"https://www.techradar.com/reviews/iphone-x-review\"><u>iPhone X</u></a> features, you're right. </p>",
            "<p>The S9 Plus tries to match everything Apple can do, but at a larger screen size (at least until the <a href=\"https://www.techradar.com/reviews/iphone-xs-max-review\">iPhone XS Max</a> arrived) and with a 3.5mm headphone jack – and it also bests the <a href=\"https://www.techradar.com/reviews/google-pixel-2-xl-review\"><u>Google Pixel 2 XL</u></a>’s low-light photography in some scenarios. The night mode of the <a href=\"https://www.techradar.com/reviews/huawei-p20-pro-review\">Huawei P20 Pro</a> beats it in some low-light scenarios, but not all.</p>",
            "<p>What’s interesting is that Apple’s and Google’s handsets aren’t the fiercest competition for the S9 Plus – it’s Samsung’s own phones. The now-cheaper Galaxy S8 Plus is an incremental downgrade, ideal for anyone put off by the high S9 Plus price, while the Galaxy Note 9 is ideal if you have a penchant for the S Pen and a slightly bigger screen.</p>",
            "<p>Still, the Note 9 couldn't quite unseat the S9 Plus as our favorite phone, so if you don't need a stylus you should definitely keep reading.</p>",
            "<p>The official Samsung Galaxy S9 Plus release date was Friday, March 16 2018, two weeks after pre-orders opened on February 25 (UK and Europe), and March 2 (in the US).</p>",
            "<p>Its price was more expensive at launch than the S8 Plus in the US and UK. In the US, it costs $839.99 for the S9 Plus unlocked through Samsung's official website. That's only $10 more expensive than the S8 Plus at launch, but it’s now $120 more expensive than the normal-sized S9. The gap is widening between the two sizes.</p>",
            "<p>Of course, US carriers like Verizon, AT&amp;T, T-Mobile and Sprint break this full price into digestible monthly fees, though Verizon and AT&amp;T charge $100 more in the long run. But just about all American carriers offer $350 for recent phone trade-ins.</p>",
            "<p>In the UK, the Galaxy S9 Plus costs £869. That's a big price hike over the S8 Plus, which cost £779 at launch - you can check out the best <a href=\"https://www.techradar.com/deals/samsung-galaxy-s9-plus-deals\">Galaxy S9 Plus deals</a> here. That's £90 more in one year. Ouch. In Australia it costs AU$1,349.</p>",
            "<p>Those are launch prices though and if you shop around you can now get it cheaper. In the UK we've seen it from around £620 for example, while in the US you can pick it up from roughly $700.</p>",
            "<p class=\"mid__article\"></p>",
            "<p>The Galaxy S9 Plus is the most stylish-looking smartphone you can buy thanks to Samsung continuing its design ethos of melding two glass panels with a metal frame. It doesn’t look very different from the S8 Plus, but that doesn’t matter unless you’re upgrading every year and demand annual newness.</p>",
            "<p>Samsung has made small, but meaningful, changes on the back of its new phones. You’ll find the fingerprint sensor on the rear again, but now it’s aligned in the center, below the camera. The S8 Plus had a much-maligned offset scanner adjacent to the camera, and it was hard to blindly unlock your phone without smudging the camera lens. This is an improvement, although we found the fingerprint sensor pad smaller than the ones on most other Android phones.</p>",
            "<p>You can choose one of five colors, including this year's standout Lilac Purple. Other S9 color options at launch included Midnight Black and Coral Blue in the US, UK, and Europe; there’s also a Titanium Gray hue available in other countries, and the new <a href=\"https://www.techradar.com/news/samsung-galaxy-s9-is-ready-to-shimmer-in-sunrise-gold\">Sunrise Gold color</a> just launched in the US.</p>",
            "<p>Our Midnight Black review unit has been a mess with fingerprints, even though we wiped it down between photos. It’s another reason to invest in a stylish <a href=\"https://www.techradar.com/news/best-samsung-galaxy-s9-case\">Samsung Galaxy S9 Plus case</a>.</p>",
            "<p>And that’s it design-wise – you won’t readily notice anything else that’s new on the outside of the S9 Plus. The dimensions have changed by a few millimeters to reduce the top and bottom bezels, making the phone a tiny bit shorter than the S8 Plus, but it’s still a really big phone.</p>",
            "<p>You’re still going to have to stretch your fingers to touch the corners of the screen furthest from your grip – navigating Google Maps on the go, for example, can be a cumbersome affair – so if you’ve been hesitant to buy into big-screen phones your best option is the smaller Galaxy S9. This is a big phone meant for big mitts.</p>",
            "<p>Unlike many of its rivals, Samsung is standing by both the 3.5mm headphone jack and the microSD card slot. It’s also giving us a second year of the Bixby button on the left side of the phone to call up its digital assistant. No, you still can’t remap this button to your liking without third-party software and, yes, you’ll still hit it thinking it’s the nearby volume-down key.</p>",
            "<p>Samsung’s 6.2-inch display on the Galaxy S9 Plus is as expansive as it is impressive. It’s unchanged from the company’s previous Infinity Display – but that's held up to be a fantastic screen, so that’s okay with us, too.</p>",
            "<p>Its tall 18.5:9 aspect ratio has set the standard for all-screen smartphones. It can display a Quad HD+ resolution, yet it still looks outstanding at the default Full HD 1080p. It’s the combination of the futuristic-looking curved edges, vibrant colors, and high contrast ratio that make it pop.</p>",
            "<p>We also appreciate the fact that Samsung has created a screen that fills 90% of the front of the S9 Plus. There’s very little bezel here, and no notch whatsoever, which makes it feel like you’re holding one large, beautiful light beam in your hand.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/5DkwjMKk2kXGjuVoiYqEJd-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/5DkwjMKk2kXGjuVoiYqEJd-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/5DkwjMKk2kXGjuVoiYqEJd-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/5DkwjMKk2kXGjuVoiYqEJd.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/5DkwjMKk2kXGjuVoiYqEJd.jpg\"></p>",
            "<p>That beautiful beam of light is prone to occasional false touches, which we experienced due to a combination of the curved screen and our firm grasp of such a big phone. It’s no fun watching text messages disappear only because our pinky finger glanced the backspace key (which happens to be right near the edge) while we tried to clutch this massive 6.2-inch display.</p>",
            "<p>There’s no in-screen fingerprint sensor. That highlight may be saved for the Galaxy S10, but if you can't wait that long some other handsets such as the <a href=\"https://www.techradar.com/reviews/oneplus-6t-review\">OnePlus 6T</a> already have one.</p>"
        ]
    },
    {
        "title": "Samsung Galaxy S9 Plus review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p>Like it or not, Samsung’s answer to Apple’s Animoji is here on the Galaxy S9 Plus with the debut of AR Emoji. This uses the front 8MP camera to analyze a 2D image of you and then maps more than 100 different facial features to a 3D avatar.</p>",
            "<p>Samsung’s take on AR masks do mirror facial expressions onto a customizable avatar, but do so rather stiffly using its single camera and software-based algorithms. AR Emoji movement can’t compare to Apple’s iPhone X TrueDepth camera array.</p>",
            "<p>The good news is that it’s easy to send AR Emoji messages to friends. Samsung has chosen to record your expressions (whether a custom message or a pre-made one) in the universal GIF format. Friends/former friends who own non-Samsung handsets will be able to enjoy/loathe your constant AR tomfoolery.</p>",
            "<p>The feedback from friends? Our AR personas failed to look like us no matter how many times we ran through the creation process, and we found AR Emojis to be the least convincing reason to buy the Galaxy S9 Plus – the novelty quickly wears off. </p>",
            "<p>You will find more variety to Samsung’s AR Emoji menu the deeper you look, though. In addition to being able to change the gender, skin color, and hairstyle of your human avatar, you can cycle through creative AR stickers, in case you want to go full-on bunny rabbit or wear a more gangster outfit complete with sunglasses, chains, hats and bandanas. This is Samsung’s take on what Snapchat can do, and it’s at least a little more creative.</p>",
            "<p>The S9 Plus launches with Bixby Voice and Bixby Vision built-in, an improvement over last year’s Galaxy phones that saw Samsung’s AI feature defanged for several months.</p>",
            "<p>What’s here from day one is a sometimes-convincing virtual assistant meant to rival Siri and Google Assistant. It can actually do a bit more by following through on commands – asking it to “Open Twitter and tweet ‘This is what it’s like to be the only one in the @futureplc NYC office on a snow day #SamsungGalaxyS9’” let me dictate my tweet without requiring me to open the app or type.</p>",
            "<p class=\"mid__article\"></p>",
            "<p>Apple and Google’s AI can’t follow through like this. However, both can understand me better than Bixby, and that’s a big deal. You see, Bixby kept thinking I said ‘Future peel see’ when I was dictating that tweet, and when asking it to “Send an email to Gareth Beavis with the subject: ‘How’s your Galaxy S9 review coming?’” it got everything right but ended the subject with ‘question Mark.’ Bixby is like a smart student who routinely fails to listen.</p>",
            "<p>Bixby Vision breaks ground with features like live translation. You can decode a foreign language sign or menu by pointing your camera at it – all without snapping a photo and waiting for it to translate. It’s good news for travelers, though you’ll need data to power this internet-connected feature and its Google Translate backend is far from reliable. It’s helpful in a pinch, but we found asking for the English menu so much easier.</p>",
            "<p>Bixby Vision will also continue to name and detail landmarks through location-aware smarts and <em>attempt</em> to identify food – and it now has the helpful (or shame-inducing) power to inform you of the amount of calories in that food. But its ability to correctly name foods is more of a joke than a reliable tool when it guesses that a lollipop is a corndog.</p>",
            "<p>The 8MP front-facing camera is put to use if you’d like a makeover. Bixby Vision has a new makeup mode, overlaying various blushes, mascara, and lipsticks via partnerships with the CoverGirl and Sephora cosmetics brands. It’s an augmented reality feature designed to “guide you through the purchase flow,” notes Samsung. It seems like more of a neat tech demo for your new phone, and not a convincing use of the ‘AI’ buzzword.</p>",
            "<p>New to the S9 Plus is the fact that the face unlock and iris scanner biometrics now work at the same time to unlock the phone. This is Samsung’s answer to Apple’s Face ID technology.</p>",
            "<p>It works most of the time. Whenever our eyeballs and mug were looking down at the phone it opened very quickly, except when we were walking in bright sunlight – and, that’s just the sort of situation where you’ll want to recheck Google Maps or quickly reply to a message to say “I’m on my way.”</p>",
            "<p>We’ve had similar issues with Face ID on the <a href=\"https://www.techradar.com/reviews/iphone-x-review\"><u>iPhone X</u></a> and experience more here. Even a 95%  success rate out of 100 unlock attempts in a normal day means it’ll fail five times every day, and that’s annoying. Samsung’s face unlock technology has also been spoofed in the past, so enabling it could leave you vulnerable even if it’s not exactly easy to crack.</p>",
            "<p>None of these ‘futuristic’ options are as seamless as unlocking your phone through a  good old-fashioned front fingerprint sensor – technology that both companies retired from their phones last year. At least Samsung includes a rear fingerprint sensor as an alternative unlock method.</p>",
            "<p>Here’s something funny we picked up on while testing the S9 Plus: Samsung now lets you optionally hide notification content until the scanners recognize your eyes or face. That’s great for privacy, but as soon as it does recognize you it’ll bypass the lockscreen, and you’ll have to revert to pulling down the notification shade. Apple had a very similar issue when Touch ID Gen 2 performed too well and lockscreen notifications disappeared before anyone got to read them.</p>"
        ]
    },
    {
        "title": "Samsung Galaxy S9 Plus review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p>You can’t really see it, but the Galaxy S9 Plus, along with the Galaxy S9, has stereo speakers, a first for a Samsung flagship and, frankly, a long-overdue addition for the world’s smartphone leader.</p>",
            "<p>Samsung-owned AKG Acoustics has finely tuned the brand-new top earpiece speaker and the returning bottom-firing speaker so that they’re 40% louder than the single speaker on the S8 Plus. And support for Dolby Atmos brings simulated 360-degree sound to the new smartphone. </p>",
            "<p>These two S9 Plus speakers are plenty loud, and sound almost as crisp as the iPhone X speakers in our audio tests. Apple has been outfitting its phones with stereo speakers since the iPhone 7, so we’re just pleased to see Samsung catch up.</p>",
            "<p>The best part about having stereo speakers in the Galaxy S9 Plus? You won’t accidentally mute all sound from the bottom-firing speaker when holding the phone in landscape mode. That’s been a constant issue with past Samsung smartphones.</p>",
            "<p class=\"mid__article\"></p>",
            "<p>The Galaxy S9 Plus is one of the fastest Android phone we’ve tested thanks to the fact that it uses the Qualcomm Snapdragon 845 chipset (in the US and China to support both CDMA  and GSM carriers) or Samsung’s own Exynos 9810 (globally for GSM carriers). </p>",
            "<p>Both 10nm chips are among the latest and greatest in smartphones right now, and they’re coupled with 6GB of RAM, compared to the 4GB in the S9. You’ll have more headroom to multitask on the 6.2-inch screen, enjoy flawless 3D gaming, and run virtualized applications on Samsung Dex.</p>",
            "<p>We saw a 30% speed boost over the S8 Plus and Note 8 performance in benchmarking apps that push the chip cores to their limit. And more importantly, in real-world experience we didn’t see a hint of slowdown. That can change over time with any phone (as applications become more robust), but Samsung outfitted the S9 Plus to be future-proof.</p>",
            "<p>That said, the newer <a href=\"https://www.techradar.com/reviews/iphone-xs-review\">iPhone XS</a> and <a href=\"https://www.techradar.com/reviews/huawei-mate-20-pro-review\">Huawei Mate 20 Pro</a> have it beat for raw power, but if you want a Samsung phone this is still the best - even the <a href=\"https://www.techradar.com/reviews/samsung-galaxy-note-9-review\">Samsung Galaxy Note 9</a> only really matches rather than topping it.</p>",
            "<p>Don’t worry about the overbearing software either. The Galaxy S9 streamlines menus as part of a fairly bloat-free Android 8 Oreo software skin, now known as Samsung Experience (it’s not called TouchWhiz anymore and not nearly as big of a turn off next to stock Android).</p>",
            "<p>Android 9 Pie should arrive imminently too, so the software will be up to date through most of 2019 even if the hardware isn't quite.</p>",
            "<p>We like pretty much everything about Samsung’s version of Android except its default keyboard, which routinely suggests wrong or randomly capitalized words. iOS has this issue, too… maybe this is another way Samsung is trying to emulate Apple in 2018.</p>",
            "<p>You’re getting either 64GB (US) or 128GB (everywhere else) of internal storage in the S9 Plus, and a spot for a microSD card so you can add up to 400GB of additional space. With LG and Apple now upgrading their devices to 256GB (for a higher price), this is the one area in which Samsung has held back, especially in the US. A microSD card becomes a must if you’re looking to shoot an ample amount of 4K video.</p>"
        ]
    },
    {
        "title": "Samsung Galaxy S9 Plus review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p>Samsung is ready for all of your nightmarish low-light photo scenarios with the Galaxy S9 Plus camera and its new f/1.5 aperture – a world’s first for a smartphone camera.</p>",
            "<p>Its magic is Dual-Aperture technology, which switches between an f/1.5 aperture (pulls in more light for darker scenes) to an f/2.4 aperture (reduces the amount of light captured to keep photos from becoming overexposed). Samsung says its mimicking how the human eye adjusts to light.</p>",
            "<p>The S9 Plus is now able to soak in 28% more light with 30% less noise compared to the S8 Plus. It also has the benefit of Samsung adding DRAM to its image sensor stack, allowing photos to be made up of a composite of 12 frames instead of 3 frames. Samsung has made significant camera hardware changes, as opposed to LG’s pure software AI approach with the new <a href=\"https://www.techradar.com/reviews/lg-v30s-thinkq\"><u>LG V30S ThinkQ</u></a>, and the results speak for themselves.</p>",
            "<p>All of this groundbreaking camera trickery means it looks as if someone turned on more lights in your dimly lit pub and moody restaurant photos. In fact, you’re going to see the brightest photos  yet from a smartphone using the Galaxy S9 Plus, and very little of the noise we’re all used to seeing when phone makers artificially amp up the brightness.</p>",
            "<p>There are sacrifices at f/1.5, however. Photos can look over-processed, with smoothed or waxy skin and an overall lack of texture, at night. It’s also easier to spot glaring motion blur, even if your subjects are hardly moving. Photos are brighter than ones we shot on the iPhone X and Google Pixel 2 XL, but Samsung’s camera does like to omit texture in the name of brightness. It really comes down to a photo style preference.</p>",
            "<p><strong>Rear-facing camera samples</strong></p>",
            "<p>The cameras are different between the Galaxy S9 and Galaxy S9 Plus. Samsung’s larger phone inherits the Note 8’s dual-lens camera feature, which gives it a telephoto lens for optically zoomed-in photos without distortion. This second lens also enables bokeh-rich ‘Live Focus’ portrait photos that never seem to be flawless, but are on par with the background blurring effects the Google Pixel 2 and iPhone X are capable of.</p>",
            "<p class=\"mid__article\"></p>",
            "<p><strong>Front-facing camera<br></strong>The front-facing camera hasn’t changed from the Galaxy S8 Plus to the S9 Plus, using an 8MP sensor with the autofocus capability that’s so far been unique to Samsung’s phones. Pictures out of this selfie camera are bright, but too high in saturation. Samsung’s tendency to make colors punchy works for everything else, including landscape shots using the rear camera, but it can make skin tones appear slightly more red than the iPhone X’s more natural hues.</p>",
            "<p><strong>The best camera app on a phone<br></strong>What Samsung does best is create a robust, yet simple-to-operate camera app that’s far better than anything Apple or Google have come up with (LG is a close second). Mode switching is an easy left-to-right swipe almost anywhere on the 6.2-inch viewfinder (the names of the modes appear at the top, making using of the tall screen). Toggling the front and back cameras is an intuitive swipe up or down on the screen, while triggering the selfie camera timer is an effortless open-hand gesture. Maybe the best feature is using the fastest way to launch its camera app: just double-press the physical sleep/wake button and you’re ready to snap your next shot.</p>",
            "<p><strong>4K60fps video and Super Slow Mo video<br></strong>Samsung has added an option for recording 4K resolution video at 60 frames per second, with a reasonable limit of five minutes. It’s sharp, though this mode lacks optical image stabilization and doesn’t support tracking autofocus. The rest of the resolutions, from 4K 30fps on down, do have OIS and the footage looks fluid, same as last year. Samsung also gives you the option of recording normal-speed video in the new HEVC format to save space.</p>",
            "<p>The biggest Galaxy S9 video highlight, however, is its Super Slow Mo video capabilities. We were able to capture slick-looking super-slow-motion video at 960fps, albeit in a noticeably lower 720p HD resolution. It’s grainy if the light isn’t ideal (and sometimes even if it is ideal, as it's slow enough to ruin office space slow motion video by picking up flickering fluorescent light). But the slow-motion effects are absolutely mesmerizing, matching what we’ve seen from the Xperia XZ1 and XZ1 Compact. The 240fps normal slow-mo video has been bumped up to 1080p Full HD, too.</p>",
            "<p>Samsung told us that slow motion has been the most popular video mode outside of automatic, and here’s one more reason to continue wanting to use it: the S9 Plus has the ability to start recording slow-motion video when it detects motion. Timing the press of the on-screen shutter button is always a pain when recording slow-motion video, and this helps alleviate that problem. It’s not perfect if the motion isn’t obvious enough when passing in front of the on-screen motion-detection box, but it’s brilliant when it all works out.</p>",
            "<p>We’ve tested the Samsung Galaxy S9 battery, and it’s a lot like the rest of the phone: it matches what we saw from the Galaxy S8 Plus a year earlier. That translates into all-day battery life.</p>",
            "<p>It has a 3,500mAh-capacity battery – the same as last year’s phone – and it’s still bigger than the 3,000mAh- and 3,300mAh-equipped Galaxy S9 and Note 8, though the Galaxy Note 9 has it beat. We were hoping to eke out a few more hours courtesy of the new more efficient chipsets that power the S9 and S9 Plus, but that hasn’t happened.</p>",
            "<p>Samsung, once again, isn’t pushing the boundaries of its battery capacity, perhaps understandably given its missteps with the explosion-prone Galaxy Note 7. However, it has slightly improved charging times, according to our tests.</p>",
            "<p>In our lab test, running a looped HD video for 90 minutes, the battery sank from 100% to 87%, the exact 13% decrease we saw from last year's Plus-sized Samsung phone. However, it has slightly improved charging times, according to our tests. </p>",
            "<p>Fast Charging the S9 Plus with the included charger for just 15 minutes brings it from 0% to 19%, and 30 minutes gets it to 38%; at 45 minutes, the phone gets up to a comfortable 58%. In the end, it takes one hour and 41 minutes to reach 100%, the same as the Galaxy S8 Plus. But from a dead battery, it charges faster at those crucial lower levels.</p>",
            "<p>Samsung also supports fast wireless charging, and sells a bunch of wireless charging pads. Its Qi wireless charging method still isn’t as quick as wired charging speeds, but it’s faster than you can wireless-charge an iPhone X.</p>"
        ]
    },
    {
        "title": "Samsung Galaxy S9 Plus review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p>The Galaxy S9 Plus is the best of what Samsung has to offer at a really big size. Its 6.2-inch curved screen is spacious and elegant-looking, even if it appears as if nothing has changed about it.</p>",
            "<p>The S9 Plus features that have been tweaked are important. The fingerprint sensor is now in an ideal, center-aligned spot on the back, the speakers finally give us overdue stereo sound on a Samsung flagship and, most importantly, the low-light-focused camera snaps bright photos in the dark instead of saddling us with a bunch of dimly lit throwaways. We also got a kick out of the super-slow-motion camera. It’s a best camera phone contender, for sure.</p>",
            "<p>The Galaxy S9 Plus also checks all the other boxes for an iterative upgrade: its new chips provide faster performance, it has more RAM, and its virtual assistant is smarter, although still flawed. Color us with a non-surprised face in AR Emoji.</p>",
            "<p>We actually didn’t care for AR Emoji in any way, shape or face-transform. Let’s all pretend it doesn’t exist. It’s a fun demo to show friends at best, and Samsung’s unsuccessful attempt to match Apple’s trending (but also fairly meaningless) technology at worst.</p>",
            "<p>There are three big obstacles to owning the Galaxy S9 Plus. First, it’s a big phone meant for big hands. If you’re not into that, go with the normal-sized S9 for its one-hand-friendly operation, even if you like the extra screen space, RAM, and battery life. Second, it’s more costly than the S9. It’s a lot to pay for 0.4 inches of extra screen space and more power. Third, the Galaxy Note 9 is now out, offering an even larger alternative.</p>",
            "<p>But overall, if you want a really big phone right now, you’re not going to find one better than the S9 Plus. It’s our favorite phone for people with big hands and big wallets.</p>",
            "<p><em>First reviewed: March 2018</em></p>",
            "<p><em>Not convinced this phone is for you? Check out these instead:</em></p>",
            "<p><em>Watch our verdict above!</em></p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/ectBmWU3njvsQTcfe2t6vj-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/ectBmWU3njvsQTcfe2t6vj-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/ectBmWU3njvsQTcfe2t6vj-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/ectBmWU3njvsQTcfe2t6vj.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/ectBmWU3njvsQTcfe2t6vj.jpg\"></p>",
            "<p>Apple’s latest phone is its most tempting bait in years for anyone who has been thinking about switching from Android to iOS 12. </p>",
            "<p>While this isn't the massive overhaul that the iPhone X was, Apple has further improved things for the S model, adding more power and improvements to the camera. Unlike the original X this style is now available in two sizes too, with the massive <a href=\"https://www.techradar.com/reviews/iphone-xs-max-review\">iPhone XS Max</a> being another alternative to the S9 Plus.</p>",
            "<p>Some of the features are old news for Samsung owners, and the Galaxy S9 and S9 Plus still eke out a design win with their curved displays. And while Apple has iMessages and a far more cohesive app ecosystem, Samsung has the better price.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/xPJNGoGjkbi9aYMAP2unuY-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/xPJNGoGjkbi9aYMAP2unuY-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/xPJNGoGjkbi9aYMAP2unuY-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/xPJNGoGjkbi9aYMAP2unuY.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/xPJNGoGjkbi9aYMAP2unuY.jpg\"></p>",
            "<p>Can you handle a smartphone with a 6.2-inch screen and a bump in price? The Galaxy S9 Plus is clearly has the edge over the S9 thanks to its bigger screen, dual-lens camera, more RAM and additional battery life. You also get 128GB of internal storage instead of 64GB everywhere but the US. </p>",
            "<p>That said, if you hate big phones you should immediately turn your attention to the S9 with its more reasonable 5.8-inch display. No amount of extra power will make you love the Plus version if you despise having to use two hands to operate a smartphone.</p>",
            "<p class=\"mid__article\"></p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/PDF2aikFmaZkgiRkQxzs7a-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/PDF2aikFmaZkgiRkQxzs7a-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/PDF2aikFmaZkgiRkQxzs7a-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/PDF2aikFmaZkgiRkQxzs7a.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/PDF2aikFmaZkgiRkQxzs7a.jpg\"></p>",
            "<p>You won’t be able to tell the difference between the Galaxy S8 Plus and Galaxy S9 Plus from the front. They look identical. So if you’re hunting for a better price, you should still consider the S8 Plus. It won’t get you the best low-light photos, dual-lens camera, stereo speakers or extra chip and RAM performance, but it’s an iterative downgrade for considerable savings.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/cAVJ3Uz8hzz5iUrH4DAho-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/cAVJ3Uz8hzz5iUrH4DAho-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/cAVJ3Uz8hzz5iUrH4DAho-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/cAVJ3Uz8hzz5iUrH4DAho.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/cAVJ3Uz8hzz5iUrH4DAho.jpg\"></p>",
            "<p>This is the match-up you’ve been waiting for given that both Android smartphones have powerful cameras. The Samsung captures better low-light photos, but the Pixel 3 XL is more consistent, delivering often sharper, brighter photos. </p>",
            "<p>Overall it's the better camera phone - just - but the Samsung Galaxy S9 Plus has it beat in other areas, such as the design and overall feature-set.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/UDKrck3CmgirAaMw9ih7mf-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/UDKrck3CmgirAaMw9ih7mf-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/UDKrck3CmgirAaMw9ih7mf-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/UDKrck3CmgirAaMw9ih7mf.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/UDKrck3CmgirAaMw9ih7mf.jpg\"></p>",
            "<p>If you're after an even larger Samsung flagship then the Samsung Galaxy Note 9 with its 6.4-inch screen is the obvious choice.</p>",
            "<p>As well as marginally more screen you get Samsung's S Pen stylus and a bigger battery, but for many users this phone might be too big. It's also not much of an upgrade on the S9 Plus in most ways, despite costing a fair bit more.</p>"
        ]
    }
]