[
    {
        "title": "Essential Lurches Back From the Grave to Offer Up $150 Headphone Dongle",
        "author": "Victoria Song",
        "text": [
            "<p>Halloween has passed, but Essential hath risen from near death to deliver unto us a $150 dongle. Audiophiles who also happen to own an Essential phone, now is the time to rejoice—if you’re actually out there.<br></p>",
            "<p>The dongle, available now in the U.S. and Canada, is called the <a href=\"https://www.essential.com/audio?utm_source=social&amp;utm_medium=social_internal&amp;utm_campaign=audioadpterhd&amp;utm_content=learn_more\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.essential.com/audio?utm_source=social&amp;utm_medium=social_internal&amp;utm_campaign=audioadpterhd&amp;utm_content=learn_more', {metric25:1})\">Audio Adapter HD</a> and attaches magnetically to the back of the PH-1, and uses MQA rendering to deliver better-quality music. Oh, and a three-month trial subscription to Tidal. Tidal is the only streaming service that actually supports high-fidelity MQA rendering, so when you think about it, yeah it scans that would be Essential’s partner of choice.</p>",
            "<p>But Essential itself is not doing very well, and there’s a lot of reasons why it seems it has one foot in the metaphorical grave. From the start, the <a href=\"https://www.essential.com/blog/why-I-started-essential\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.essential.com/blog/why-I-started-essential', {metric25:1})\">smartphone that was supposed to change it all</a> was plagued by <a href=\"https://gizmodo.com/essentials-shipping-issues-have-gone-from-bad-to-train-1798625030\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/essentials-shipping-issues-have-gone-from-bad-to-train-1798625030', {metric25:1})\">delays</a>. Botched orders and buggy launch-day software cemented its status as one of tech’s most bizarre sagas. Even after <a href=\"https://gizmodo.com/how-much-would-you-actually-pay-for-an-essential-phone-1828473807\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/how-much-would-you-actually-pay-for-an-essential-phone-1828473807', {metric25:1})\">lowering the price</a> of its <a href=\"https://gizmodo.com/the-essential-phone-is-too-expensive-to-have-a-camera-t-1798408448\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-essential-phone-is-too-expensive-to-have-a-camera-t-1798408448', {metric25:1})\">PH-1</a> phone, Essential never really recovered from its initial growing pains (<a href=\"https://gizmodo.com/the-essential-phone-finally-makes-sense-1823185128\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-essential-phone-finally-makes-sense-1823185128', {metric25:1})\">though we do find the phone to be a pretty great buy now</a>). The recent sexual misconduct controversy swirling around co-founder <a href=\"https://gizmodo.com/google-ceo-doesnt-deny-reported-90-million-payout-to-a-1830007498\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-ceo-doesnt-deny-reported-90-million-payout-to-a-1830007498', {metric25:1})\">Andy Rubin</a>, its <a href=\"https://gizmodo.com/essential-never-lived-up-to-its-name-and-now-its-repor-1826310798\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/essential-never-lived-up-to-its-name-and-now-its-repor-1826310798', {metric25:1})\">canceled plans for a second phone, and rumors that the company is up for sale</a> haven’t necessarily helped either.</p>",
            "<p>Even the dongle has had its own mishaps. Initially, it was announced in <a href=\"https://www.theverge.com/circuitbreaker/2017/9/14/16309196/essential-phone-headphone-jack-module-announced\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.theverge.com/circuitbreaker/2017/9/14/16309196/essential-phone-headphone-jack-module-announced', {metric25:1})\">September 2017</a> and supposed to start shipping this summer. Obviously, that did not happen. Still, the $150 dongle ($150!!!) for a phone that reportedly sold <a href=\"https://mobile.twitter.com/fjeronimo/status/963054359000113152\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://mobile.twitter.com/fjeronimo/status/963054359000113152', {metric25:1})\">fewer than 90,000 units</a> may not be Essential’s last gasp. After scrapping its second-gen phone, Essential is reportedly working on an <a href=\"https://gizmodo.com/essentials-next-phone-will-be-a-wildly-different-ai-po-1829652226\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/essentials-next-phone-will-be-a-wildly-different-ai-po-1829652226', {metric25:1})\">AI-powered companion device</a> for smartphones. Whether it sees the light of day... who can say. But hey, at the very least Essential kept its promise with the dongle.</p>"
        ]
    },
    {
        "title": "The Essential Phone Finally Makes Sense",
        "author": "Sam Rutherford",
        "text": [
            "<p class=\"has-video media-large video-embed align--bleed\"><span class=\"flex-video widescreen\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=mcp-3485496&amp;sponsored=false&amp;post_id=1823185128&amp;platform=web&amp;postPosition=0&amp;cloudinaryImageOverride=tu4l4cq2l6tptfkhorry&amp;cloudinaryImageOverrideFormat=JPG\" data-recommend-id=\"mcp://3485496\" height=\"450\" id=\"mcp-3485496\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"800\" frameborder=\"0\"></iframe></span></p>",
            "<p>The Essential Phone was supposed to be the one. Envisioned by Andy Rubin, the father of Android itself, and expertly crafted from a luxurious combo of ceramic, titanium, and Gorilla Glass, the PH-1 had the kind of pedigree you rarely see from a startup, let alone one that was trying to put out its first phone. But when you look back, aided by the gift of hindsight, it’s clear there was no way Essential could have ever delivered on the hype, especially after a launch plagued by repeated delays, difficulty delivering orders, and unfinished software. And with a price of $700 at launch, when I said the PH-1 was<a href=\"https://gizmodo.com/the-essential-phone-is-too-expensive-to-have-a-camera-t-1798408448\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-essential-phone-is-too-expensive-to-have-a-camera-t-1798408448', {metric25:1})\"> too expensive to have a camera that bad</a>, that wasn’t an opinion, it was fact.</p>",
            "<p>But now, six months later, things have changed. After multiple price drops have brought it down to $500 and ample time to update its software, the PH-1 is, essentially, a different phone now. <br></p>",
            "<p>In the time following its launch, our PH-1 review unit spent much of its time sitting in a drawer. In the fall, Essential was quickly forgotten due to phones like the <a href=\"https://gizmodo.com/i-hate-how-much-i-love-the-iphone-x-1820086867\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/i-hate-how-much-i-love-the-iphone-x-1820086867', {metric25:1})\">iPhone X</a>, <a href=\"https://gizmodo.com/pixel-2-review-google-sticks-to-what-it-does-best-1819557944\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/pixel-2-review-google-sticks-to-what-it-does-best-1819557944', {metric25:1})\">Google’s second Pixel</a>, and the <a href=\"https://gizmodo.com/samsung-galaxy-note-8-review-bigger-badder-but-i-sti-1799759566#_ga=2.158557823.412381971.1519679128-1282447779.1518012133\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/samsung-galaxy-note-8-review-bigger-badder-but-i-sti-1799759566#_ga=2.158557823.412381971.1519679128-1282447779.1518012133', {metric25:1})\">return of the original big-ass phablet</a> after a two year hiatus. The PH-1 wasn’t really in the same class as those other flagships, to the point that using it as a comparison device didn’t make much sense. But when I pulled it out about a week ago, I couldn’t help but think that the Essential still looks like a dime.<br></p>",
            "<p>Even when viewed side by side with the iPhone X, the PH-1 makes Apple’s ridiculously priced phone look clunky. There’s no awkward camera hump protruding from its back or even a logo to take away from its clean, elegant lines. And in front, the cutout for the PH-1 8-MP selfie cam is both more stylish and less distracting than the iPhone X’s bloated notch—all while delivering a higher screen-to-body ratio than Apple’s handset too. There’s no doubt Essential nailed the design, and I appreciate it more now than I did before.<br></p>",
            "<p>Inside, the PH-1's UI is also spotless, running an unadulterated version of stock Android, which unfortunately remains on Android 7.1 instead of Android 8 Oreo. But the real test is in the phone’s camera app. At launch, on top of delivering soft images with a noticeable lack of detail, the phone often struggled to focus or even snap pics back-to-back in a timely manner. However, over the course of several repeated camera updates, Essential has made some marked improvements. Shutter response is faster, though you’ll still run into a bit of lag every now and then, and focusing speeds are quicker too.</p>",
            "<p>But the most important change is an overall improvement to image quality. After digging up a shot I took with the PH-1 at launch, I went and grabbed the exact same shot now that the phone has had six months of tinkering done to its camera. Even just a passing glance shows how much better the phone has gotten, but when you zoom into 100 percent, it’s obvious. Everything looks sharper and more detailed. Now you can see the texture on the concrete wall, and even colors look more vibrant. And the PH-1 doesn’t look good just when compared to itself either.</p>",
            "<p>In bright light, the PH-1 held its own against a photo captured by a OnePlus 5T. Sure, there are small differences in exposure and white balance, but if you look close, you might even say the OP5T’s pic looks a little soft compared the PH-1. Finally, Essential is putting out pics the can stand up to equally priced competition. However, I do have to point out, this only holds true in well-lit conditions. In low-light, the PH-1 still labors. When I snapped a pic of a nearby plush in my living room with the lights turned down, I was shocked to see how different each phone’s low light pic looked.</p>",
            "<p>And all of this brings us back to pricing. While the phone still has it flaws, at $500, a lot of its quirks, such as its lack of a microSD card slot, wireless charging or any sort of water-resistance, are much more forgivable. So has Essential totally redeemed itself? Definitely, or at least as much as it could in the face of the hyperbolic promises it originally had about revolutionizing the industry.</p>",
            "<p>It’s not perfect, but it now it finally feels like Essential has something to build on. With a gorgeous body that is somehow more impressive than before, a tidy UI, improved software, and a price that makes sense, the PH-1 has carved out its niche. And even though we can’t quite figure out what’s going on with its new color options, <a href=\"https://gizmodo.com/i-cant-tell-what-color-this-phone-is-and-honestly-its-d-1823075408\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/i-cant-tell-what-color-this-phone-is-and-honestly-its-d-1823075408', {metric25:1})\">those look good too</a>.</p>"
        ]
    },
    {
        "title": "Essential's Next Phone Will Be a Wildly Different, AI-Powered Companion: Report",
        "author": "Sam Rutherford",
        "text": [
            "<p>Making smartphones is hard, and despite having one of the best pedigrees in the business, Andy Rubin’s company stumbled out of the gate when it launched the Essential PH-1 last year. At first, the <a href=\"https://gizmodo.com/the-essential-phone-is-too-expensive-to-have-a-camera-t-1798408448\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-essential-phone-is-too-expensive-to-have-a-camera-t-1798408448', {metric25:1})\">Essential Phone’s camera wasn’t great</a> and it’s software wasn’t quite as smooth as we’d like, but thanks to continued support and a some price drops, the PH-1 turned into one of the <a href=\"https://gizmodo.com/the-essential-phone-finally-makes-sense-1823185128\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-essential-phone-finally-makes-sense-1823185128', {metric25:1})\">best smartphone bargains of 2018</a>. </p>",
            "<p>So, now that’s Essential’s growing pains are out of the way, the company seems ripe for a successful sophomore followup—right? Not so fast, because according to a <a href=\"https://www.bloomberg.com/news/articles/2018-10-10/android-creator-is-said-to-build-ai-phone-that-texts-for-you\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.bloomberg.com/news/articles/2018-10-10/android-creator-is-said-to-build-ai-phone-that-texts-for-you', {metric25:1})\">report from Bloomberg</a>, Essential’s next phone could be anything but conventional. It’s being described as an AI-powered device with a design that “sounds a bit like the sci-fi movie <em>Her</em>.” </p>",
            "<p>Bloomberg claims the device will feature a small screen and require users to interact with it primarily using voice controls, while AI-powered software inside handles things like booking appointments and responding to texts and emails automatically without additional input from the user.</p>",
            "<p>On top of that, the device is reportedly being designed as a companion gadget that works together with a traditional smartphone instead trying to serve as a full-on replacement for most people. However, this seems like a potentially ruinous move. The whole point of a smartphone is to serve as the sole gadget you need carry around, and trying to convince people to add another brick to their everyday carry could be a very tough sell. </p>",
            "<p>That said, the idea is intriguing. One of the great dreams of technology, and AI in particular, is to help streamline peoples’ lives so they can spend less time responding to constant (and often unnecessary) pings from coworkers, solicitors, and other people jamming up your communication. However, with things like <a href=\"https://gizmodo.com/i-broke-google-duplex-but-its-still-impressive-1827131546\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/i-broke-google-duplex-but-its-still-impressive-1827131546', {metric25:1})\">Duplex</a>, constantly improving <a href=\"https://gizmodo.com/gmail-now-writes-emails-for-you-1825862741#_ga=2.204956304.1462803321.1539177830-946238463.1536275408\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/gmail-now-writes-emails-for-you-1825862741#_ga=2.204956304.1462803321.1539177830-946238463.1536275408', {metric25:1})\">auto-fill and auto-reply</a>, the newly announced <a href=\"https://twitter.com/Google/status/1049692260361752576?s=19\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://twitter.com/Google/status/1049692260361752576?s=19', {metric25:1})\">Call Screen feature</a>, and the Google Assistant, Google is the clear leader in AI tech. Without the same levels of resources and funding at their disposal, it’s hard to imagine Rubin and Essential will be able to leapfrog the whole industry.</p>",
            "<p>Additionally, it seems that the development Essential’s new AI companion device caused the company to push development of its previously promised smart home hub to the wayside. That’s a shame, because with products like the new <a href=\"https://gizmodo.com/amazon-is-going-to-drown-us-in-alexa-crap-1829202572\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/amazon-is-going-to-drown-us-in-alexa-crap-1829202572', {metric25:1})\">Echo Show</a>, the <a href=\"https://gizmodo.com/google-has-a-smart-display-now-and-it-s-called-home-hub-1829619683\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-has-a-smart-display-now-and-it-s-called-home-hub-1829619683', {metric25:1})\">Google Home Hub</a>, <a href=\"https://gizmodo.com/google-and-lenovos-smart-display-trounces-amazons-in-ev-1827886084#_ga=2.121878155.1431561409.1539145282-r4h5ima09\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-and-lenovos-smart-display-trounces-amazons-in-ev-1827886084#_ga=2.121878155.1431561409.1539145282-r4h5ima09', {metric25:1})\">Lenovo’s Smart Display</a>, Rubin’s early road map for Essential appeared to be on the right track. </p>",
            "<p>Personally, I was really looking forward to a second-gen Essential Phone, because it would be nice—especially in the U.S.—if there were more options for phones aside from the Apple, Samsung, and Google handsets that most people gravitate towards. But Rubin’s idea could be just wild enough to work. Hopefully this product doesn’t get canceled before it can see the light of day. </p>",
            "<p>[<a href=\"https://www.bloomberg.com/news/articles/2018-10-10/android-creator-is-said-to-build-ai-phone-that-texts-for-you\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.bloomberg.com/news/articles/2018-10-10/android-creator-is-said-to-build-ai-phone-that-texts-for-you', {metric25:1})\">Bloomberg</a>]</p>"
        ]
    },
    {
        "title": "8 Things You Should Be Automating on Your Smartphone",
        "author": "David Nield",
        "text": [
            "<p>We live in an age of super-smart technology built to make our lives easier, so don’t struggle with the menial chores of the day when your phone could be doing the job for you. Here are some of the best automations you can set up on your phone, freeing you from the task and giving you more time to do something else more interesting instead.</p>",
            "<p>Whether you’re hitting the road or just find replying to your friends too much effort, you can save your fingers a little bit of typing by automating your text messages—or at least the SMS replies you need to send out.</p>",
            "<p>When it comes to iOS, you need to activate Do Not Disturb (of which more later) to turn your text auto-responder on. From Settings, choose <strong>Do Not Disturb</strong> and scroll down to the <strong>Auto-Reply</strong> options: You can pick which contacts get an auto-reply and what the message actually says. This then kicks in whenever Do Not Disturb is automatically or manually enabled on your device.</p>",
            "<p>Text auto-respond is part of the driving mode in Android too, but you still need to tap to confirm the SMS gets sent. For a truly automated process, get the freemium <a href=\"https://play.google.com/store/apps/details?id=com.lemi.smsautoreplytextmessagefree\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://play.google.com/store/apps/details?id=com.lemi.smsautoreplytextmessagefree', {metric25:1})\">Auto Reply Text Message</a> app installed. It works just like an out-of-office message on your email, and you can set up different profiles too (one response for meetings, one for vacations, one for driving, and so on).</p>",
            "<p>Backing up your photos and videos is an essential job to get done if you want your precious digital memories to last even if your phone gets lost or destroyed, and thankfully it’s now easier than ever—it doesn’t take long to set up your phone to be beaming pictures and videos back to the cloud whenever you’re on a wifi network.</p>",
            "<p>Google Photos is available on <a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.photos\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://play.google.com/store/apps/details?id=com.google.android.apps.photos', {metric25:1})\">Android</a> and <a href=\"https://itunes.apple.com/us/app/google-photos/id962194608?mt=8\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://itunes.apple.com/us/app/google-photos/id962194608?mt=8', {metric25:1})\">iOS</a>: You get 15GB free (across all Google services), with more costing <a href=\"https://one.google.com/about%5D\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://one.google.com/about]', {metric25:1})\">from $2 a month</a>. If you don’t mind your photos being resized down to 16MP and your videos down to 1080p, or you own a Pixel phone, you can have unlimited storage for free. Install the app then check <strong>Settings</strong> then <strong>Backup &amp; sync</strong> to make sure everything is being copied to the cloud.</p>",
            "<p>Apple’s option is iCloud Photo Library, which gives you 5GB of space in the cloud for free and charges you <a href=\"https://support.apple.com/en-us/HT201238\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://support.apple.com/en-us/HT201238', {metric25:1})\">$1 a month and up</a> for more. From Settings on your iOS device, tap your Apple ID name, then <strong>iCloud</strong>, then <strong>Photos</strong> to turn automatic backups on. You’ve got several other options here too, including Dropbox and OneDrive.</p>",
            "<p>You might be surprised at how much time typing takes up in your day. Set up automations for your phone’s keyboard and you can type out phrases you use a lot—like your home address or apologies for running late—with just a few characters.</p>",
            "<p>On iOS, what you need to do is open up Settings then choose <strong>General</strong>, <strong>Keyboard</strong>, and <strong>Text Replacement</strong>. The screen that then appears before you lets you add new keyboard macros (two examples are included for you)—tap the <strong>Plus</strong> icon then enter a phrase and a shortcut. Use the shortcut when typing, and the phrase appears as an option in the predictive text list.</p>",
            "<p>For those of you on Android, head to Settings then choose <strong>System</strong>, <strong>Languages &amp; input</strong>, <strong>Virtual keyboard</strong>, <strong>Gboard</strong>, <strong>Dictionary</strong>, and finally <strong>Personal dictionary</strong>. Select your language then the Plus button to add a phrase and a shortcut. The next time you’re typing, tap out the shortcut then tap the phrase.</p>",
            "<p>The problem with trying to remember to put your phone into quiet mode is that you inevitably forget more often than not, which leads to your smartphone’s embarrassing ringtone cutting through the silence at your next office meeting or church service. It’s a far better idea to let your phone organize this on a schedule.</p>",
            "<p>On iOS, you can open up Settings then pick <strong>Do Not Disturb</strong> and <strong>Scheduled</strong> to set your quiet times—unfortunately you can only set up one block of time per day here. If you long-press on the Do Not Disturb button in <a href=\"https://gizmodo.com/every-single-setting-in-ios-control-center-and-how-each-1824308937\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/every-single-setting-in-ios-control-center-and-how-each-1824308937', {metric25:1})\">Control Center</a>, you can also set the quiet mode to last for an hour, until the evening, or until you leave your current location.</p>",
            "<p>On Android, choose <strong>Sound</strong> then <strong>Do not disturb</strong> from Settings. Pick <strong>Turn on automatically</strong> to set the times when Do Not Disturb is activated without any manual input from you—you can set these periods based on times in the day or events in your Google Calendar, and pick multiple blocks in every 24 hours if needed.</p>",
            "<p>If you like to drift off to sleep to some tunes or a couple of podcasts then you can have your phone automatically stop playback after a certain amount of time has elapsed. Some apps, like the podcast player Pocket Casts, already have a sleep timer built in (although Spotify doesn’t, as yet...).</p>",
            "<p>If you’re using an iOS device you can get the Clock app to do the job. Switch to the <strong>Timer</strong> tab, select your desired duration, and then tap <strong>When Timer Ends</strong>—choose <strong>Stop Playing</strong> from the bottom of the list, and when the timer runs out, any audio that was playing on your phone is silenced.</p>",
            "<p>It’s a shame that Android’s default Clock app doesn’t have the same function, but you can plug the gap with a third-party app. There’s a decent number of sleep timer apps to pick from on the Google Play Store, so have a browse and see which one you like best, but we appreciate the simplicity and efficiency of <a href=\"https://play.google.com/store/apps/details?id=com.smholsen.sleeptimerallmedia\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://play.google.com/store/apps/details?id=com.smholsen.sleeptimerallmedia', {metric25:1})\">Sleep Timer</a>.</p>",
            "<p>If you’re on Android, you can make use of <a href=\"https://ifttt.com\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://ifttt.com', {metric25:1})\">IFTTT</a> (If This Then That) to perform all kinds of automated tricks based on phone events or your phone’s location. The service connects all kinds of apps and platforms together, and is free to use.</p>",
            "<p>In the interests of security, battery life, and peace of mind, for example, you might want to <a href=\"https://ifttt.com/applets/302237p-turn-off-wifi-on-your-android-when-you-leave-home-to-save-power\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://ifttt.com/applets/302237p-turn-off-wifi-on-your-android-when-you-leave-home-to-save-power', {metric25:1})\">turn off wifi</a> and <a href=\"https://ifttt.com/applets/164966p-mute-your-android-phone-when-you-arrive-at-work\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://ifttt.com/applets/164966p-mute-your-android-phone-when-you-arrive-at-work', {metric25:1})\">mute your phone</a> when IFTTT detects it has left home or arrived at work. When you get back in the evening, IFTTT is able to <a href=\"https://ifttt.com/applets/FapTeHd5-automatically-unmute-your-android-when-you-get-back-home\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://ifttt.com/applets/FapTeHd5-automatically-unmute-your-android-when-you-get-back-home', {metric25:1})\">unmute your handset</a> and <a href=\"https://ifttt.com/applets/302238p-automatically-turn-your-android-device-s-wifi-on-when-you-get-home\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://ifttt.com/applets/302238p-automatically-turn-your-android-device-s-wifi-on-when-you-get-home', {metric25:1})\">turn wifi back on</a> automatically.</p>",
            "<p>That’s just a taste of what IFTTT can do: It lets you log notifications or texts in a spreadsheet, turn on your smart lights at the same time as your alarm, automatically display directions to an event in your calendar, start playing music when a Bluetooth device is detected, post to social media, and much more.</p>",
            "<p>Get <a href=\"https://itunes.apple.com/us/app/shortcuts/id915249334?mt=8\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://itunes.apple.com/us/app/shortcuts/id915249334?mt=8', {metric25:1})\">Shortcuts</a> by Apple (formerly Workflow) installed on your iOS device and you can automate a bunch of tasks—or, more specifically, combine a host of actions that get carried out with a single tap or Siri command.</p>",
            "<p>In this particular case we’re highlighting the shortcut that lets you share your estimated time of arrival with someone else. The steps to add are, from the top, <strong>Street Address</strong> (enter your home address here), <strong>Get Travel Time</strong>, and <strong>Send Message</strong>—in the last block tap the <strong>Travel Time</strong> button to insert your ETA into the text. Pick contacts for the <strong>Recipients</strong> field and you’re done.</p>",
            "<p>Tap the <strong>Gallery</strong> button in Shortcuts to see some of the other ways the app can automate your life: You can tweet out the song you’re listening to, build grids of Instagram photos, send the contents of the clipboard to Dropbox, turn Live Photos into GIFs, browse the latest news stories, and so on and so on.</p>",
            "<p>If you’re really serious about this automation business, and you own an Android phone (iOS doesn’t really offer the necessary deep hooks for third-party apps), then <a href=\"https://play.google.com/store/apps/details?id=net.dinglisch.android.taskerm\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://play.google.com/store/apps/details?id=net.dinglisch.android.taskerm', {metric25:1})\">Tasker</a> has been the gold standard for automation apps for a long time now. It’s not the easiest app to use (though it’s improving), but you can’t argue with its capabilities.</p>",
            "<p>Tasker can interface with all kinds of system apps and system settings on your phone, whether you need to turn on the flashlight, control media playback, toggle airplane mode, send a text, check the battery level, or open a map. Automated tasks can be launched with a tap or based on a time, an event, or a location.</p>",
            "<p>You can automatically check into Foursquare when you arrive somewhere, for instance, or automatically text your wifi code to any incoming SMS with the word “wifi” in it. Check out the <a href=\"https://forum.joaoapps.com/index.php?resources/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://forum.joaoapps.com/index.php?resources/', {metric25:1})\">official projects list</a> for more examples of what Tasker can do. </p>"
        ]
    },
    {
        "title": "The Red Hydrogen One Is a Phone Made for an Alternate Reality",
        "author": "Sam Rutherford",
        "text": [
            "<p>Jim Jannard is an interesting guy. After starting a one-man business selling motorcycle parts, he decided to pivot into goggles and eyewear. Fast forward about 25 years, and Oakley had become one of the biggest sunglass brands in the world. Then in 2007, after selling Oakley for $2.1 billion, Jannard turned to his other company, and that same year, Red shipped its first 4K<a href=\"https://www.red.com/shot-on-red\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.red.com/shot-on-red', {metric25:1})\"> cinema-grade digital camera</a>. Both companies are highly successful ventures by any definition, so for his third pivot, Jannard thought he would set his sights even higher and make a smartphone unlike anything else on the market. But this time, I think Jim may have gone a little too far because instead of making something you might want to buy, the Red Hydrogen One, with its ambitious 3D display, feels like a phone that teleported from a different dimension.</p>",
            "<p>Crafted from a scalloped aluminum frame and Kevlar panels (a titanium-clad model coming soon), the Hydrogen One looks like a tank and feels even heavier. It has ribbed grooves running down its back and sides that you can grate cheese on, and in back there’s a red jewel surrounded by engraved metal that reads Red Media Machine. All this combines to deliver a kind of rarefied durability, and it’s the first time in a long while I feel like there’s a phone that will never need a case to stay safe. In short, the Hydrogen One is the complete antithesis to the modern glass sandwich smartphone.</p>",
            "<p>But the outlandishness doesn’t stop there, because in addition to a USB-C port for data and charging, the Hydrogen One features a (gasp) headphone jack and a microSD card tray that you can pull out with your fingernail, rather than relying on one of those tiny tray ejector pins that instantly disappears the second you get a new phone. And on its sides, in addition to separate buttons for volume up and down, there’s a lock button on the right with a built-in fingerprint reader and a dedicated camera button—very fitting for a phone made by Red.</p>",
            "<p>All of this is just preamble to the Hydrogen One’s highlight feature: its 4View display. So what does 4View stand for? I’m not totally sure and Red’s website doesn’t exactly spell it out either. But what 4View supposedly delivers is pretty out there. 4View is what Red claims to be the “world’s first holographic screen,” and its components include all the hottest buzzwords. It’s powered by nanotechnology via a unique Lightfield screen which promises immersive 3D images without the need for glasses. (For those that want to know more about how 4View actually works, check out this interview with one of the creators of the tech <a href=\"https://www.slashgear.com/red-hydrogen-one-phone-display-light-by-leia-interview-23551068/amp/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.slashgear.com/red-hydrogen-one-phone-display-light-by-leia-interview-23551068/amp/', {metric25:1})\">here</a>.)</p>",
            "<p>Sadly, those fancy words and added depth don’t come across in normal pictures or videos, which means it’s something that can only be experienced in person. And to me, the Hydrogen One’s display is really just a slightly better version of what you’d get on a new Nintendo 3DS. And it’s true, even without glasses, images do seem to leap off the screen and hover in mid-air, but it’s not the sort of revolutionary display I was expecting to see after over a <a href=\"https://gizmodo.com/reds-holographic-media-machine-feels-like-an-april-fool-1796679725\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/reds-holographic-media-machine-feels-like-an-april-fool-1796679725', {metric25:1})\">year</a> of <a href=\"https://gizmodo.com/red-s-first-smartphone-still-looks-like-a-fake-star-tre-1802683503\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/red-s-first-smartphone-still-looks-like-a-fake-star-tre-1802683503', {metric25:1})\">hype</a>.</p>",
            "<p class=\"has-video media-large video-embed align--bleed\"><span class=\"flex-video widescreen\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=mcp-3591106&amp;sponsored=false&amp;post_id=1830015204&amp;platform=web&amp;postPosition=0&amp;cloudinaryImageOverride=qhm2kmrdwwqqztme3gth&amp;cloudinaryImageOverrideFormat=JPG\" data-recommend-id=\"mcp://3591106\" height=\"450\" id=\"mcp-3591106\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"800\" frameborder=\"0\"></iframe></span><span class=\"video-embed__caption\">Watch a bunch of GMG staffers try the Red Hydrogen’s 4View display for the first time.</span></p>",
            "<p>In my opinion, still images using the technology look better than videos, with photos featuring things with hard lines like a sculpture or tree doing the best job of making 4View really pop. But there are still a lot of issues. While in normal 2D mode, the Hydrogen One’s 5.7 4View display is relatively high-res at 2560 x 1440. But when you turn 3D on, you can immediately see that the screen’s resolution is significantly reduced to the point where you can see individual pixels. On top of that, nothing ever looks that sharp, and there’s always a faint rainbow color cast lurking in the background that makes things look more dreamy than real. But I might just be a little jaded, so to get a better sense of what others might think, check out our video to see fellow GMG staffers and their first experience with 4View (check out the video above).</p>",
            "<p>Red knows its 4View display alone wasn’t going to be enough to sell this phone because outside of other Hydrogen One owners sharing pics with each other via the Holopix app or a few other tools, there’s a limited bucket of 3D content to check out. The Hydrogen Network app offers 20 or so movie snippets that you can watch, while the Red Leia Loft app tacks on support for games like but that’s about it. (Oh, AT&amp;T is also giving people who buy a Hydrogen One from them free 4View versions of <em>Ready Player One</em> and <em>Fantastic Beasts</em>). So to help flesh out available 4View content, Red made sure that the Hydrogen One can not only show 3D, it can capture 3D too.</p>",
            "<p>Using the dual cameras in front and back, the Hydrogen can shoot both 3D stills and video, though there are limitations. For the front-facing cams, you can only shoot 3D in portrait orientation, which isn’t actually a big deal. But in back, you are limited to just landscape shots, which is more annoying. Some issues might stem from the tech still being early in its development cycle, such as 4View video recording turning off in the middle of a clip because the phone thinks it’s too bright outside. But even if you can ignore those problems, the Hydrogen’s One’s standard image quality doesn’t impress.</p>",
            "<p>In almost ideal conditions at a well-lit bakery, the Hydrogen One’s camera produced a shot that looked dull, lifeless, and just generally worse than what I got from a Pixel 3. Next, when I shot a picture of some pumpkins, the Hydrogen One struggled with dynamic range, as seen in its blown-out highlights and underexposed details in the shadows. And at night, things got really bad, with the Hydrogen One producing seriously blurry and noisy images repeatedly in multiple locations. Even the phone’s camera app features an awkward UI. To capture 3D pics, you need to hit the 2D button to switch between shooting modes, and to switch into video mode, you need to hit the camera button. It doesn’t really make a lot of sense, and it’s definitely not intuitive. There’s also seemingly no option to show grid lines to help with composition, and while I do appreciate that Red included the ability to display a histogram, that might be the nicest thing I can say about the phone’s camera.</p>",
            "<p>I suppose that after seeing first-time phone makers like <a href=\"https://gizmodo.com/the-essential-phone-is-too-expensive-to-have-a-camera-t-1798408448\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-essential-phone-is-too-expensive-to-have-a-camera-t-1798408448', {metric25:1})\">Essential</a> and <a href=\"https://gizmodo.com/razers-powerhouse-phone-for-gamers-is-delightfully-diff-1820817305\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/razers-powerhouse-phone-for-gamers-is-delightfully-diff-1820817305', {metric25:1})\">Razer</a> struggle to nail image quality out of the gate, I shouldn’t be surprised. But given Red’s heritage, I was expecting a much better showing.</p>",
            "<p>Theoretically, all this could be solved through the Hydrogen One’s modular add-on system, which promises to someday let the phone connect to the company’s super expensive cameras, or attach a standalone sensor and third-party lenses from camera makers including Nikon, Canon, Sony, Leica, and others. But those mods don’t exist yet, and there’s no telling when they’ll arrive.</p>",
            "<p>Where things start to get truly ugly though is that for a phone that costs $1,300, its specs are outdated from day one. It’s got a Snapdragon 835 chip from last year, and while 6GB of RAM and 128GB of storage are nice, it’s still running Android 8.1, and Red says Android 9 won’t arrive until sometime in 2019. (Currently, its security patch dates back to July, so hopefully, Red addresses that before it goes on sale November 2.) Its LCD display also isn’t very colorful and doesn’t sport the contrast ratios you’d get from a more modern OLED panel. Even the Hydrogen One’s massive 4,500 mAh hour battery is held back by inefficient components, because with a run time of 11:51, Red’s phone lasts an hour or two less than an iPhone XS Max (13:07) or a Galaxy Note 9 (14:11), and is only marginally better than a Pixel 3 XL (11:24).</p>",
            "<p>Ultimately, the Hydrogen One is a very beefy handset with dated internals, no water-resistance or wireless charging, a splashy screen that’s only a bit better than a Nintendo 3DS, and overall image quality that puts Red’s own name to shame. If that doesn’t sound like a phone conjured up in an alternate reality, I don’t know what does. And while there’s still a chance Red can redeem the Hydrogen One and its tech in the future, it’s going to be a long time until a lot of people not named Jim Jannard will really want to own this phone.</p>",
            "<p>Android 8.1 • Qualcomm Snapdragon 835 • 6GB of RAM • 128GB of storage • microSD card slot • 2560 x 1440 5.7-inch LCD display • dual 8-MP front cams • dual 12-MP rear cams • Bluetooth 5.0 • USB-C • 3.5mm jack • 4,500 mAh battery 6.48 x 3.37 x 0.39 inches• 9.27 ounces• available from AT&amp;T and Verizon • aluminum version comes in black and gray, titanium model coming soon</p>"
        ]
    },
    {
        "title": "How Much Would You Actually Pay For an Essential Phone?",
        "author": "Sam Rutherford",
        "text": [
            "<p>When the Essential Phone first came out, <a href=\"https://gizmodo.com/the-essential-phone-is-too-expensive-to-have-a-camera-t-1798408448\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-essential-phone-is-too-expensive-to-have-a-camera-t-1798408448', {metric25:1})\">I didn’t like it very much.</a> But my main objection wasn’t its build or features—no, it was basically that for $700, its camera simply wasn’t in the same league as the <a href=\"https://gizmodo.com/samsung-galaxy-s8-review-the-prettiest-phone-wins-1794526975\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/samsung-galaxy-s8-review-the-prettiest-phone-wins-1794526975', {metric25:1})\">Galaxy S8</a>, the <a href=\"https://gizmodo.com/iphone-7-review-ready-or-not-this-is-the-future-1786898943\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/iphone-7-review-ready-or-not-this-is-the-future-1786898943', {metric25:1})\">iPhone 7</a>, or any other expensive flagship.</p>",
            "<p>Thankfully though, post-launch, Essential didn’t just give up on the PH-1. Instead, the team followed up and improved things like image quality and camera shutter lag. After a few months of updates and some price drops, <a href=\"https://gizmodo.com/the-essential-phone-finally-makes-sense-1823185128\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-essential-phone-finally-makes-sense-1823185128', {metric25:1})\">the Essential Phone made a  strong comeback</a>. Suddenly, at $450, the PH-1 could be considered a solid rival to handsets like the <a href=\"https://gizmodo.com/the-oneplus-5t-is-very-a-damn-good-phone-for-a-reasonab-1820596179#_ga=2.28617148.1282026341.1534765453-820698127.1522425547\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-oneplus-5t-is-very-a-damn-good-phone-for-a-reasonab-1820596179#_ga=2.28617148.1282026341.1534765453-820698127.1522425547', {metric25:1})\">OnePlus 5T</a> or some of Motorola’s mid-range phones, and depending on the competitor, it featured a noticeably lower price. </p>",
            "<p>Then, earlier this week, the Essential Phone was discounted down to a shocking $224, a ludicrously cheap price so low that we’ve only seen it briefly during <a href=\"https://twitter.com/essential/status/1018918941232525312\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://twitter.com/essential/status/1018918941232525312', {metric25:1})\">Amazon’s most recent Prime day</a> back in July. At $224, the PH-1 easily outclasses any budget handset you can buy right now, which is why it’s no surprise that the supply of super-cheap Essential Phones has already sold out. </p>",
            "<p>Still, the Essential Phone is currently <a rel=\"nofollow\" data-amazonasin=\"B078SQ7GWK\" data-amazonsubtag=\"[t|link[p|1828473807[a|B078SQ7GWK[au|5876237249237183654[b|gizmodo[lt|text\" onclick=\"window.ga('send', 'event', 'Commerce', 'gizmodo - How Much Would You Actually Pay For an Essential Phone?', 'B078SQ7GWK');window.ga('unique.send', 'event', 'Commerce', 'gizmodo - How Much Would You Actually Pay For an Essential Phone?', 'B078SQ7GWK');\" data-amazontag=\"gizmodoamzn-20\" href=\"https://www.amazon.com/Essential-Phone-Black-Edge-Edge/dp/B078SQ7GWK?th=1&amp;mnsid=mbnx3-20ascsubtag=UUacUdUnU69036YYwYd&amp;tag=gizmodoamzn-20&amp;ascsubtag=12223a712e71e956cf58062b66b3ff8e7cda98ab\">listed on Amazon for just $335</a>, which is way less than the phone is actually worth. If it hadn’t been for Essential’s <a href=\"https://gizmodo.com/essentials-shipping-issues-have-gone-from-bad-to-train-1798625030\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/essentials-shipping-issues-have-gone-from-bad-to-train-1798625030', {metric25:1})\">struggles at launch</a>, the PH-1 totally could have justified a $600 asking price. To make the deal even sweeter, Essential is still pumping out updates for its phone, with the PH-1 being one of the first, if not the first non-Pixel phone to get the upgrade to <a href=\"https://gizmodo.com/android-p-is-now-officially-android-9-pie-1828133506\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/android-p-is-now-officially-android-9-pie-1828133506', {metric25:1})\">Android 9 Pie</a>. Meanwhile, Samsung’s latest phone—the <a href=\"https://gizmodo.com/samsungs-galaxy-note-9-is-the-best-big-phone-1828348138#_ga=2.115146574.875595541.1534766403-r4h5ima09\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/samsungs-galaxy-note-9-is-the-best-big-phone-1828348138#_ga=2.115146574.875595541.1534766403-r4h5ima09', {metric25:1})\">$1,000 Galaxy Note 9</a>—launched running Android 8, and if Samsung’s previous update cadence is any indication, it will be at least three months until the device has access to Android 9. </p>",
            "<p>At this point, the price cuts on the Essential Phone have gone way past sensible, and while I know the phrase is overused, for this little money, for $335, the PH-1 really is a steal. It’s got great specs for the price, a spectacularly good build, solid battery life, and after all this, its camera is totally fine now, too. There’s also the PH-1's cool factor, because as the first phone to feature a notch, it deserves its own little spot in annals of smartphone history. </p>",
            "<p>Sure, the Essential Phone itself still has a few issues, such as its missing headphone jack, but sadly, but that’s kind of the norm nowadays. And as for the Essential Phone not having water-resistance or wireless charging, those are features you’d be hard-pressed to find on any other phone in this price range. Really, the Essential Phone’s only legitimate knock is that the whole <a href=\"https://gizmodo.com/essential-never-lived-up-to-its-name-and-now-its-repor-1826310798#_ga=2.29842623.1282026341.1534765453-820698127.1522425547\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/essential-never-lived-up-to-its-name-and-now-its-repor-1826310798#_ga=2.29842623.1282026341.1534765453-820698127.1522425547', {metric25:1})\">company might go under or get bought out</a>, at which time, further software support or updates could quickly dry up. This is no small concern. We haven’t heard much about Essential’s fate since May, when Bloomberg reported that it had already “canceled development” of what would presumably be the Essential Phone 2. But once again, for $335, you could still do so much worse.</p>",
            "<p>So now I ask you, how low would the Essential PH-1 have to go before you’d be willing to buy one—if ever? I might buy one and just keep it in the box, as a reminder of what a wild ride it’s been. </p>"
        ]
    }
]