[
    {
        "title": "HTC's U12+ Looks Like an Awkward, Budget Hybrid of an iPhone X and a Pixel 2",
        "author": "Sam Rutherford",
        "text": [
            "<p>Earlier this summer when I took a look at <a href=\"https://gizmodo.com/i-really-hope-htc-doesnt-go-out-like-this-1827380446\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/i-really-hope-htc-doesnt-go-out-like-this-1827380446', {metric25:1})\">HTC’s most recent flagship phone</a>, I was terribly conflicted. On one hand, I was a big fan of the <a href=\"https://gizmodo.com/i-really-hope-htc-doesnt-go-out-like-this-1827380446\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/i-really-hope-htc-doesnt-go-out-like-this-1827380446', {metric25:1})\">U12+’s</a> clear glass back (haven’t you heard, <a href=\"https://gizmodo.com/its-time-to-bring-back-translucent-gadgets-1828367198\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/its-time-to-bring-back-translucent-gadgets-1828367198', {metric25:1})\">translucent gadgets are cool again</a>), while its dual cameras on the back  are probably the most underappreciated cameras in the smartphone world. Unfortunately, those features weren’t enough to completely redeem below average battery life and really annoying touch sensitive buttons on its side. </p>",
            "<p>But now, HTC is trying to redeem its premium handset with the new U12 Life, which is a budget/midrange take on the  U12+. Except in a lot of ways, the two are less related than I initially thought, which may be the best thing about it.</p>",
            "<p>But if you’re just looking at the U12 Life’s design, HTC seems to have strayed into some funky design ideas that has left the U12 Life looking like the confused loffspring of an <a href=\"https://gizmodo.com/i-hate-how-much-i-love-the-iphone-x-1820086867\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/i-hate-how-much-i-love-the-iphone-x-1820086867', {metric25:1})\">iPhone X</a> and a <a href=\"https://gizmodo.com/pixel-2-review-google-sticks-to-what-it-does-best-1819557944\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/pixel-2-review-google-sticks-to-what-it-does-best-1819557944', {metric25:1})\">Pixel 2 XL</a>. In front, there are no notches or fingerprint sensors in sight, while in back, you get a pill-shaped dual camera module on top of a partially striped two-toned finish that covers up the phone’s acrylic glass chassis. At this point, I’m not entirely sure if this is supposed to be a simple mishmash of derivative designs, or a snide piece of commentary on modern smartphones aesthetics. </p>",
            "<p>Thankfully, the U12 Life’s screen is largely the same, measuring 6-inches across, though resolution has taken a dip down to 2160 x 1080. And on the inside, you’re looking at more conservative components  with the U12 Life sporting a Qualcomm Snapdragon 636 processor, 4GB/6GB of RAM, 64GB/128GB of storage, an SD card slot, and both a USB-C port and a headphone jack on bottom, the latter of which the U12+ never had.</p>",
            "<p>And in another strange turn of events, the midrange U12 Life’s 3,600 mAh battery is actually slightly larger than the 3,500 mAh power pack in the U12+, which when combined with its less powerful processor and lower resolution display, should go a long way towards addressing the lackluster longevity I saw on the U12+. </p>",
            "<p>HTC has even seen the error of its ways and equipped the U12 life with standard physical buttons for power and volume. And if the 16-MP plus 5-MP cameras in back are anywhere close to as good as what was on the U12+, the U12 Life might actually be a solid affordable alternative to all the cheap new phones Nokia, <a href=\"https://gizmodo.com/honor-s-mid-range-phone-is-trying-to-save-us-from-the-1822838663\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/honor-s-mid-range-phone-is-trying-to-save-us-from-the-1822838663', {metric25:1})\">Huawei,</a> and <a href=\"https://gizmodo.com/motorola-s-making-the-cheap-smartphone-even-harder-to-r-1826916725\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/motorola-s-making-the-cheap-smartphone-even-harder-to-r-1826916725', {metric25:1})\">Motorola</a> have been pushing out. </p>",
            "<p>Sadly, for us here in the U.S., we may never get a chance to live the U12 Life, as the phone is currently only slated for release in Europe and Asia, with UK pricing starting at 279 pounds (about $360) and availability sometime in Q4 2018. </p>"
        ]
    },
    {
        "title": "I Really Hope HTC Doesn't Go Out Like This",
        "author": "Sam Rutherford",
        "text": [
            "<p>After <a href=\"https://www.reuters.com/article/us-htc-sales/htcs-june-sales-slump-68-percent-biggest-drop-in-over-two-years-idUSKBN1JW1G3?feedType=RSS&amp;feedName=technologyNews\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.reuters.com/article/us-htc-sales/htcs-june-sales-slump-68-percent-biggest-drop-in-over-two-years-idUSKBN1JW1G3?feedType=RSS&amp;feedName=technologyNews', {metric25:1})\">years of declining sales</a>, <a href=\"https://gizmodo.com/google-just-bought-a-whole-lot-of-phone-from-htc-1818595082\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-just-bought-a-whole-lot-of-phone-from-htc-1818595082', {metric25:1})\">unloading $1 billion worth of patents and personnel to Google</a>, and <a href=\"https://www.reuters.com/article/us-taiwan-htc-jobs/struggling-smartphone-maker-htc-to-slash-1500-jobs-in-taiwan-idUSKBN1JS167\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.reuters.com/article/us-taiwan-htc-jobs/struggling-smartphone-maker-htc-to-slash-1500-jobs-in-taiwan-idUSKBN1JS167', {metric25:1})\">just recently slashing 25 percent of its global workforce</a>, when it comes to HTC, I got one big question: So what’s left? Sure, HTC may have been able insulate its promising <a href=\"https://gizmodo.com/vive-pro-review-way-more-beautiful-way-better-way-too-1824268076\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/vive-pro-review-way-more-beautiful-way-better-way-too-1824268076', {metric25:1})\">Vive</a> VR business by spinning that department <a href=\"https://www.engadget.com/2016/06/29/htc-is-spinning-off-vive-into-a-separate-company/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.engadget.com/2016/06/29/htc-is-spinning-off-vive-into-a-separate-company/', {metric25:1})\">off into a separate company</a>. But as for HTC itself, if all the company has left in the tank is its <a href=\"https://techcrunch.com/2018/05/15/yes-htc-is-working-on-a-blockchain-phone/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://techcrunch.com/2018/05/15/yes-htc-is-working-on-a-blockchain-phone/', {metric25:1})\">upcoming crypto phone</a> and this, the new U12+, things aren’t looking good. </p>",
            "<p>Initially, when <a href=\"https://gizmodo.com/htcs-u12-continues-to-set-itself-apart-with-a-squeeze-1826241870\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/htcs-u12-continues-to-set-itself-apart-with-a-squeeze-1826241870', {metric25:1})\">I heard about the U12+</a>, I was optimistic. HTC’s previous flagship phone was one of the biggest sleepers of 2017 thanks to its unique design, the huge 3930 mAh battery in the larger U11+, and a camera that was just as good, if not sometimes better than those found on Samsung’s and Apple’s handsets. And for 2018, it seemed like HTC was going to lean into its innovative side-mounted pressure sensors so you could control even more features with a simple squeeze of your hand.</p>",
            "<p>And it some respects, that focus totally paid off, because now in addition to simply squeezing the phone to summon the Google Assistant or whatever else you want, you can also double tap the sides of the phone to go back, squeeze and hold to call up any app of your choosing, or simply grip the phone to prevent it from dimming or rotating the screen without your approval.</p>",
            "<p>On top of that, you can even customize what squeezing the phone does contextually within individual apps, so when using the camera app for example, you can squeeze the phone to snap a picture, or squeeze and hold to switch between the phone’s front and rear facing cameras. And because almost all of these functions can be tweaked and adjusted to your liking, the U12+ feels like it has an endless possibilities for  customization. It’s a phone tweaker’s dream. </p>",
            "<p>Unfortunately, what HTC forgot to do was increase the sensitivity of the U12+’s pressure sensors, because even when set to their lowest level, actually getting the phone to recognize a squeeze is uncomfortable, and if you squeeze the phone a lot, it might even be a little painful. The phone’s metal sides don’t have any give, so  in order for the handset to recognize your  squeeze, you essentially have to bruise your fingers.</p>",
            "<p>But perhaps the U12+’s biggest offense is what HTC did to the phone’s lock and volume “buttons.” That’s because they aren’t actually buttons at all, they’re little bits of raised metal with even more built-in touch sensors. And unlike the Touch ID home “buttons” found on older iPhones, HTC hasn’t really attempted to use high-quality haptics to fool your fingers into thinking they are real. Sure, the “buttons” vibrate when you press them, but they still feel dead, and like the rest of the phone’s squeeze controls, you have to press them harder than you think you should when you want them to work. </p>",
            "<p>I really don’t get it, and when you consider the phone’s curvy, almost fluid-like glass back, I think it’s a tragedy that HTC didn’t go all the way and axe the U12+’s buttons entirely in favor of full on touch controls. In a world where phone makers are already trying to eliminate everything on a phone that’s not a screen or camera, that would actually be a bold step into our inevitable all-touch future. </p>",
            "<p>Meanwhile, on the inside, the phone’s Qualcomm Snapdragon 845 chip, 6GB of RAM, 64GB of storage and microSD card slot delivers the kind of performance you’d expect from an $800 phone. However, its battery does not. For some reason, after putting a huge 3,950 mAh battery in the U11+, which featured a screen with the same 6-inch dimensions and 2880 x 1440 resolution as the U12+, HTC curiously opted to go with a smaller 3500 mAh this time instead. That means on our rundown test, the U12+ lasted just 8 hours and 1 minute, the shortest time we’ve seen on any phone in 2018, regardless of price, and between three and four hours (or more) shorter than many of its flagship competitors including the Galaxy S9+(12:27) , the Huawei P20 Pro (11:36), or OnePlus 6 (13:03).</p>",
            "<p>However, one of the U12+’s redeeming features is its cameras, which have been doubled to include dual 8-MP cams up the front and dual 12-MP cams in back. That means you can shoot portrait mode photos regardless of which side of the phone you’re using, which is nice, but what’s even more impressive is that once again, HTC has managed to keep pace with its mainstream competitors. In daylight, not only did the U12+ capture a challenging shot of a flower in the fading light of a sunset with more accurate white balance, it also refrained from pushing color saturation and sharpness too far like you see in a comparison pic shot by a Galaxy S9+.</p>",
            "<p>And in low-light, while the U12+’s pic does look slightly grainier than the S9+’s pic, it doesn’t have any of the greenish cast on the yellow warning track at the bottom of the shot, there’s better detail on the pavers in the road, and clean, bright colors throughout. The S9+’s only other advantage is very slightly better range as seen by more details in the rafters at the top of the building.</p>",
            "<p>So in the end, what we’re left with is an incredibly frustrating phone. Aside from its slick transparent glass back, it looks almost exactly the same as last year’s device, and yet, its cameras are even better. Unfortunately, the U12+ has taken a step back in battery life, and while its enhanced pressure sensors  offer even more control and customizability, the performance and execution of HTC’s touch and squeeze functions just isn’t there.</p>",
            "<p>But what worries me even more is that with HTC in such trouble financially, it’s possible that the U12+ could be the last flagship phone HTC ever makes. And for a company that’s created a number of all-time great handsets like the <a href=\"https://gizmodo.com/t-mobile-g1-google-android-phone-review-5062977\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/t-mobile-g1-google-android-phone-review-5062977', {metric25:1})\">T-Mobile G1</a> (or the HTC Dream as its known outside the U.S.), which was the first phone sold that ran Android, or the legendary <a href=\"https://gizmodo.com/htc-one-review-the-beauty-is-a-beast-updated-5990716\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/htc-one-review-the-beauty-is-a-beast-updated-5990716', {metric25:1})\">HTC One M7</a>, which may have been the best phone of its generation, the death of HTC is a pretty depressing thought. And despite its flaws, the U12+ shows that HTC didn’t sell all of its best ideas to Google. There’s still potential left in what remains of HTC, but if things don’t start improving soon, all of HTC’s greatest hits may remain strictly in the past.</p>",
            "<p>Android 8.0 • 6-inch 2880 x 1440 LCD display • Qualcomm Snapdragon 845 processor • 6GB of RAM • 64GB or 128GB of storage • microSD card slot • stereo speakers • dual 8-MP front cameras • dual 12-MP rear cameras • IP-68 water resistance • USB 3.1 Type-C port • no headphone jack • 6.17 x 2.91 x 0.34-inches • 6.63 ounces</p>"
        ]
    },
    {
        "title": "HTC's U12+ Continues to Set Itself Apart With a Squeeze",
        "author": "Sam Rutherford",
        "text": [
            "<p>While other phone makers are busy <a href=\"https://gizmodo.com/after-just-6-months-the-phone-notch-is-already-deeply-1823469447\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/after-just-6-months-the-phone-notch-is-already-deeply-1823469447', {metric25:1})\">trying to incorporate notches</a> onto their latest devices, HTC is doubling down on some smartphone innovation that you can actually feel. </p>",
            "<p>That’s because on the new U12+, HTC is blowing out the phone’s squeeze functionality it  pioneered on the U11 last year with a bunch of new features. So now in Edge Sense 2, along with being able to squeeze the phone to summon an app, you can double tap the sides of the device to turn on one-handed mode, or if you want, set the double tap to function as the back button so you can skip the traditional Android nav keys at the bottom of the screen. </p>",
            "<p>But that ain’t all, because you can also press and hold the U12+’s sides to disable automatic screen rotation or auto brightness, or simply squeeze the phone to summon the Google Assistant or Alexa (whichever you prefer). But the best part about the U12+’s squeeze abilities is it appears all of these functions are customizable, so if you don’t like what a squeeze or hold does out of box, you can change it to suit your needs. Edge Sense 2 is even smart enough to know which hand you’re holding the phone with, so lefties don’t get shafted like they do on a lot of consumer electronics. </p>",
            "<p>Funky squeeze controls aside, the U12+ is also taking the 12-MP camera from last year’s U11, which was one of the most underappreciated smartphone cameras of 2017, and going nuts by adding two additional cameras (one in front and one in back), bringing the U12+’s total camera count to four. </p>",
            "<p>On both sides, that second cam gives you portrait-style depth of field effects, while in back, the U12+’s dual-cam arrangement also offers things like better HDR and a 2x optical zoom with a handy one-touch auto zoom. </p>",
            "<p>As for  specs, the U12+’s components look pretty solid, with HTC including a Snapdragon 845 chip, 6GB of RAM, 64GB or 128GB of storage,  6-inch 2880 x 1440 LCD display, microSD card slot, IP68 water-resistance, rear fingerprint sensor, and a decent-sized 3,500 mAh battery. </p>",
            "<p>The only thing I think the U12+ is missing is a headphone jack. Though, you do still get HTC’s Boomsound stereo speakers, which in the past have been the best among the best speakers you could get on a phone. You also get a pair of wired USB-C earbuds with active noise cancellation, and Qualcomm’s aptX audio technology which promises support for 24-bit audio over Bluetooth.</p>",
            "<p>That said, I’m still worried about the U12+’s price, because starting at $800 for the 64GB model, or $850 for the 128GB version, I’m not sure this phone will be enough to turn around <a href=\"https://www.androidauthority.com/htc-earnings-q1-2018-862881/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidauthority.com/htc-earnings-q1-2018-862881/', {metric25:1})\">HTC’s cratering sales</a>. Here’s hoping that after getting the chance to do a full review, the U12+ proves me wrong, because it’d be nice to see a phone that’s not obsessed with chasing trends to get a little love. </p>"
        ]
    },
    {
        "title": "Here Are All the Interesting Smartphones Announced at IFA 2018",
        "author": "Sam Rutherford",
        "text": [
            "<p>Held in Berlin, Germany, IFA is a huge mashup of appliances, audio equipment, computers, and sausages, and unlike CES, it’s open to the public. Think Coachella for gadget nerds if you will, but with way better beer. And it’s here that a lot of big  Asian and European companies get to show their wares, many of which will never see an official stateside release. So we wanted to take a little time to  go over all the big phone debuts that happened at IFA 2018.</p>",
            "<p>Wait, ZTE is alive again? Yup, well at least in Europe, because sadly this handset isn’t slated to hit the U.S. And even after taking a year off between its last flagship device, the new Axon 9 Pro doesn’t look half bad. Like the Axon 7 (ZTE never made an Axon 8), the Axon 9 Pro sports stereo speakers and an AMOLED screen, except this time the size of its display has jumped up from 5.5-inches to 6.21-inches. Meanwhile on the inside, its components have been refreshed with a Qualcomm Snapdragon 845 CPU, 6GB of RAM, 128GB of storage, dual rear cameras, and a sizable 4,000 mAh battery. </p>",
            "<p>Unfortunately, ZTE has axed the headphone jack, while in front there’s a love-it-or-hate-it notch, and at least to start, it seems the Axon 9 Pro will be saddled with Android 8.1 out of the box. The phone’s overall design is a bit plain as well, but with a listed price 649 euros (about $760), which is 220 euros less than a new Galaxy S9, I think there will still be more than a handful of people willing to sacrifice style for price.</p>",
            "<p>We’ve covered LG’s <a href=\"https://gizmodo.com/lgs-g7-thinq-is-too-clever-for-its-own-good-1825818482\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/lgs-g7-thinq-is-too-clever-for-its-own-good-1825818482', {metric25:1})\">most recent flagship at length</a>, but for the G7 One, LG took a more modest approach by retaining the standard G7's sleek glass and aluminum design, while giving the phone slightly older components like a Snapdragon 835, just 4GB of RAM and 32GB of storage and only one camera in back instead of two. But one thing you won’t get on the G7 One is LG’s typical skin for Google’s ubiquitous smartphone OS, because as the name implies, this thing runs Android One.</p>",
            "<p>That means its OS is pure stock, and future software updates will be managed and sent out by Google, not LG, so you won’t be left waiting months for new features. This change alone might be enough of a reason for people to give LG another chance. And while LG hasn’t released official availability info, the company says the G7 One will have an “exceptional price,” which if true, might make this handset an enticing midrange alternative to the <a href=\"https://gizmodo.com/oneplus-6-review-the-best-android-phone-that-wont-dest-1826158898\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/oneplus-6-review-the-best-android-phone-that-wont-dest-1826158898', {metric25:1})\">OnePlus 6</a>. </p>",
            "<p>HTC seems like it’s in a death spiral, but that doesn’t seem to have stopped the company from making new phones, and at IFA 2018, HTC announced the <a href=\"https://gizmodo.com/htcs-u12-looks-like-an-awkward-budget-hybrid-of-an-ip-1828695303#_ga=2.22753787.1399223224.1535373659-r4h5ima09\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/htcs-u12-looks-like-an-awkward-budget-hybrid-of-an-ip-1828695303#_ga=2.22753787.1399223224.1535373659-r4h5ima09', {metric25:1})\">U12 Life</a>. Like its more expensive sibling, the <a href=\"https://gizmodo.com/i-really-hope-htc-doesnt-go-out-like-this-1827380446\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/i-really-hope-htc-doesnt-go-out-like-this-1827380446', {metric25:1})\">U12+</a>, the Life sports a 6-inch screen and an acrylic glass body. But that’s kind of where the similarities end, because  thanks to some fancy two-toned paint, weaker specs, and a starting price of 279 pounds (about $360), the U12 Life seems like its all about that budget appeal.</p>",
            "<p>That said, HTC isn’t exactly punting with the U12 Life as it actually has a bigger battery than the U12+, and a headphone jack. It’s a weird world we live in where often times, the cheaper phone has an important feature the more expensive version lacks.</p>",
            "<p>Earlier this spring, Sony Mobile made a big comeback with some of the best phones the company has made in years in the <a href=\"https://gizmodo.com/the-xperia-xz2-is-the-best-phone-sony-has-made-in-years-1827049055\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-xperia-xz2-is-the-best-phone-sony-has-made-in-years-1827049055', {metric25:1})\">XZ2</a> and the <a href=\"https://gizmodo.com/finally-a-perfect-phone-for-small-hands-1827851267\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/finally-a-perfect-phone-for-small-hands-1827851267', {metric25:1})\">XZ2</a> Compact. But then, Sony couldn’t help itself from flooding the market with too many handsets, so about a month ago, it released the XZ2 Premium, and now, we’re already seeing the XZ3. </p>",
            "<p>And from all appearances, the XZ3 is basically an XZ2 with a larger 6-inch 2880 x 1440 OLED screen instead of the 5.7-inch 2160 x 1080 LCD display on the XZ2. The XZ3's battery has also gotten a little bigger to support that extra screen real estate, but everything else is pretty much the same right down to the phone’s design, CPU, RAM, and storage. Sony has even kept the dynamic haptic engine from XZ2, which I really like because it feels like someone put a <a href=\"https://en.wikipedia.org/wiki/Rumble_Pak\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://en.wikipedia.org/wiki/Rumble_Pak', {metric25:1})\">Rumble Pak</a> in a phone that works on both games and videos. That said, I’m not entirely sure moving to OLED justifies releasing an all new phone, but if the XZ3 performs like the XZ2, we’re probably looking at a pretty sweet device. </p>",
            "<p>Phones with physical keyboards aren’t really my thing, but I’m glad at least one company is still out there banging that drum. And as a follow up to the <a href=\"https://gizmodo.com/the-blackberry-key2-makes-me-wish-physical-keyboards-we-1827156967\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-blackberry-key2-makes-me-wish-physical-keyboards-we-1827156967', {metric25:1})\">Key2</a>, at IFA Blackberry announced the new Key2 LE.  </p>",
            "<p>Ostensibly, the LE stands for Limited Edition, but at the same time, LE could also stand for Lowered Expectations. Now that isn’t necessarily a bad thing, because starting at $400, you still get that lovely tactile keyboard, but with a revamped edgier body and the choice of three hot colors: atomic, slate, and champagne. The Key2 LE’s performance won’t be quite as fast as the phone has moved down from a Snapdragon 660 to a Snadragon 636 while RAM and storage are set at 4GB and 32GB respectively. But if all you really care about is having a phone with real keys you can press, the $400 Key2 LE is certainly a cheaper method of getting there. </p>",
            "<p>And to round out IFA, Huawei’s more affordable subbrand Honor launched the Honor Play, which unlike the phones above, is going after mobile gamers on a budget with a 329 Euro phone (about $380) featuring a Kirin 970 processor and Huawei’s GPU Turbo tech to help keeps frame rates up even when the action gets heated. For under $400, 4GB of RAM, 64GB of storage and a 3750 mAh are pretty nice too, and like its more expensive cousins from Huawei, you’ll also get built-in AI smarts to help tune photos taken with the Play’s 16-MP/2-MP dual rear cameras. Sadly though, this seems like another phone that may not see a U.S. release, but it’s too early to say for sure yet. </p>",
            "<p>But Honor wasn’t done with the Play, because before closing out its IFA press event, the company teased the Honor Magic 2, which features a stunning bezel-free display and a popup camera module like the one on a Oppo Find X, but with one big difference. Instead of the Magic 2 using motors to reveal the camera when you open the camera app, you need to slide open the phone yourself. It’s kind of a low-tech solution for the high-tech problem of how to get rid of notches, but I appreciate the simplicity and the throwback to the <a href=\"https://gizmodo.com/nokias-latest-retro-revival-is-making-me-crave-bananas-1823306408#_ga=2.56825962.1399223224.1535373659-r4h5ima09\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/nokias-latest-retro-revival-is-making-me-crave-bananas-1823306408#_ga=2.56825962.1399223224.1535373659-r4h5ima09', {metric25:1})\">slider phones of old</a>. </p>",
            "<p>And if that wasn’t enough, it seems the Magic 2 also has yet another voice assistant called Yoyo, which I’m not sure the world really needs, but hopefully we’ll find out what makes this one special later this year. </p>",
            "<p>OK, so this phone wasn’t technically announced at IFA, but it seems that after seeing Honor president George Zhao tease the Honor Magic 2 in Berlin, Xiaomi president Lin Bin posted this pic <a href=\"https://m.weibo.cn/status/4278842510683997\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://m.weibo.cn/status/4278842510683997', {metric25:1})\">on Weibo</a> of the upcoming Xiaomi Mi Mix 3 which sports a very similar looking sliding camera. Unfortunately, Bin didn’t give us another other details to talk about, but based on previous models, I’d expect a full reveal of the Mi Mix 3 to take place later this fall. </p>"
        ]
    }
]