[
    {
        "title": "\n\t\tHuawei punishes two employees for an iPhone Twitter mistake\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Huawei has reportedly punished two employees for an infamous tweet posted on its official New Year’s Twitter account, which was apparently posted from an iPhone. The now deleted tweet, a fairly straightforward “Happy #2019” message, was followed with the tell-tale “Twitter for iPhone” signature that follows all tweets sent from Apple devices. Twitter users quickly picked up on the gaffe and signal-boosted the mistake to their followers, prompting Huawei to delete the message.</p>",
            "<p>While this may be an amusing mistake from our standpoint, Huawei isn’t seeing the funny side of the mishap. According to <a href=\"https://www.reuters.com/article/us-huawei-iphone/chinese-phone-maker-huawei-punishes-employees-for-iphone-tweet-blunder-idUSKCN1OY0B2\">an internal memo seen by Reuters</a>, Huawei has take disciplinary action against the two employees responsible for the incident, demoting both of them by a single rank, and reducing their monthly salaries by 5,000 yuan (roughly $728). Furthermore, the pay rank of one of the two — supposedly Huawei’s digital marketing director — has also been frozen for 12 months, locking them out of any pay raises for that period.</p>",
            "<p>That seems like a fairly hefty punishment, but Huawei is clearly taking the mistake seriously. According to that same memo, a corporate senior vice-president and board director, Chen Lifang, claimed “the incident caused damage to the Huawei brand.” With Apple’s iPhone being one of the major competitors to Huawei’s <a href=\"https://www.digitaltrends.com/mobile/huawei-p20-and-p20-pro-news/\">P-series</a> and <a href=\"https://www.digitaltrends.com/mobile/huawei-mate20-news/\">Mate-series flagships</a>, it’s not hard to see why they would take such a hard line.</p>",
            "<p>The mistake supposedly occurred when Sapient, the company responsible for Huawei’s social media presence, experienced a VPN outage on the night of January 1. Use of a VPN within China is necessary to access Twitter, and rather than wait for the VPN to come back up, one employee rose to the occasion, and used an iPhone with a roaming SIM to post the message. It’s unfortunate that this otherwise quick thinking had bad consequences for the team.</p>",
            "<p>It’s certainly not the first time this sort of Twitter mishap has occurred. <a href=\"https://www.bbc.co.uk/news/technology-46426937\">Samsung Nigeria</a> was forced to remove over 300 tweets due to the same iPhone message, and many celebrity endorsements of phones have been undermined by their tweeting from the wrong phone. Huawei’s lack of humor on this surprises us to some degree though — it has shown no hesitation when making jokes at Apple’s expense during, say, <a href=\"https://www.digitaltrends.com/mobile/huawei-trolls-apple-iphone-xs-launch-news/\">the iPhone XS launch</a>.</p>"
        ]
    },
    {
        "title": "\n\t\tHuawei Mate 20 Pro vs. P20 Pro: Which 2018 Huawei flagship is best for you?\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>It doesn’t seem that long ago that the Huawei P20 Pro burst onto the scene with its stunning twilight finish, upping the ante for smartphone cameras everywhere with a triple lens setup. Yet here we are barely six months later with a new Huawei flagship sailing into view. The Huawei Mate 20 Pro is certainly bigger, but is it better than its predecessor?</p>",
            "<p>At first glance, these phones share a lot of similarities, but we’re about to dig a bit deeper to uncover all the differences and help you choose between them.</p>",
            "<p>The newer Huawei Mate 20 Pro has Huawei’s latest <a href=\"https://www.digitaltrends.com/mobile/huawei-kirin-980-news/\">Kirin 980 processor</a> inside. Huawei claims that it’s 20 percent faster and 40 percent more efficient than the Kirin 970 which graces the P20 Pro. Both phones are available with 128GB of storage and 6GB of RAM or 256GB of storage and 8GB of RAM. Only the Mate 20 Pro allows for storage expansion via a card, but it won’t take any Micro SD card, you will have to spring for one of Huawei’s proprietary NM Cards.</p>",
            "<p>Not only does the Mate 20 Pro have a bigger battery, it also supports much faster charging at up to 40W, giving you 70 percent battery life in just 30 minutes, compared to just over 50 percent for the P20 Pro. Just to seal the deal, the Mate 20 Pro also supports Qi wireless charging which the P20 Pro lacks.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro </strong></p>",
            "<p>Both of these phones have notches at the top of the displays, but the P20 Pro’s is smaller. They also both have bezels at the bottom, though the P20 Pro is starting to show its age with that lozenge-shaped fingerprint sensor, while the Mate 20 Pro has an in-display fingerprint sensor. The sides of the Mate 20 Pro are also more curved. On the back, you will find Huawei’s gorgeous paint job — we especially love the twilight finish — but the P20 Pro’s triple lens camera module definitely looks better than the big square module on the back of the Mate 20 Pro.</p>",
            "<p>Something Huawei has improved is the water resistance, with the Mate 20 Pro scoring an IP68 rating compared to the P20 Pro’s IP67 rating. Both can handle a short dunk without damage, but the Mate 20 Pro can handle slightly deeper water. Neither is going to handle falls well, so you’ll want to look at some <a href=\"https://www.digitaltrends.com/mobile/best-huawei-p20-pro-cases/\">good cases</a>.</p>",
            "<p>We’re going to give the Mate 20 Pro the nod here, but we do think the P20 Pro looks better from the back.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro </strong></p>",
            "<p>You’ll find top-quality AMOLED screens in both of these phones. The P20 Pro has a 6.1-inch display with a 2,240 x 1,080-pixel resolution which translates to 408 pixels-per-inch (ppi). The Mate 20 Pro has a slightly bigger 6.4-inch display with a 3,120 x 1,440-pixel resolution for a pixel density of 538 ppi. The taller display in the Mate 20 Pro isn’t just bigger, it’s also sharper and so it wins this round.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>Huawei has stuck with a triple lens setup on the Mate 20 Pro, just like the P20 Pro, but there are some differences. The Mate 20 Pro has a main lens rated at 40 megapixels with an f/1.8 aperture, with an ultra wide-angle lens with 20 megapixels and an f/2.2 aperture, and a telephoto 8-megapixel lens with an f/2.4 aperture. On paper, the P20 Pro set up looks familiar with 40-megapixel, 20-megapixel, and 8-megapixel lenses, but the <a href=\"https://www.digitaltrends.com/mobile/huawei-mate-20-monochrome-lens-replaced-by-filter/\">monochrome lens we loved so much</a> in the P20 Pro is gone. Huawei has essentially swapped the monochrome lens for a super wide-angle lens and the Mate 20 Pro camera is likely to be more versatile as a result.</p>",
            "<p>Both phones have a 24-megapixel front-facing camera for stunning selfies, but only the Mate 20 Pro offers proper facial scanning and 3D Live Emoji.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>While the P20 Pro launched with Android 8.1 Oreo, Huawei has started to roll out the Android 9.0 Pie update. The Huawei Mate 20 Pro launches with <a href=\"https://www.digitaltrends.com/mobile/android-9-pie-review/\">Android 9.0 Pie</a> on board. Both feature Huawei’s EMUI on top which adds various customization options and extra features. The software experience on these phones is going to be identical and we expect them to continue to get updates for a similar period of time, so there’s no dividing them here.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>Although most of the <a href=\"https://www.digitaltrends.com/mobile/huawei-ai-kirin-970-npu/\">special artificial intelligence features</a> are available on both phones, powered by the dedicated neural processing unit, the newer Mate 20 Pro chip should prove faster and more capable. The Mate 20 Pro also supports much faster charging and a special reverse wireless charging ability that enables it to act as a wireless charger for another phone, though we’re not sure you will want to donate your extra battery life very often. Factor in the FaceID-like, front-facing camera capabilities and the Mate 20 Pro is the clear winner here.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>The P20 Pro was never officially released in the U.S. and it would have cost you close to $1,000 to import one when it was first released, but that price has dropped considerably and you can pick one up now for between $700 and $800. By contrast, the new Huawei Mate 20 Pro is going on sale at 1,049 euros, which is a staggering $1,220. There is a chance Huawei will release it stateside in the new year, probably for closer to $1,000, but we can’t say for sure.</p>",
            "<p>It’s more powerful, boasts a bigger screen, faster charging, and a more versatile camera, but the Huawei Mate 20 Pro is also considerably more expensive. The Huawei P20 Pro is still a strong flagship that outperforms many big competitors, so if you’re choosing between these two right now, we wouldn’t blame you for snagging it and saving the difference. If you already have a P20 Pro, the Mate 20 Pro isn’t enough of a jump to merit an upgrade, but it is definitely the better phone.</p>"
        ]
    },
    {
        "title": "\n\t\tIlluminate the dark: Pixel 3’s Night Sight vs. Mate 20 Pro’s Night Mode\t",
        "author": [
            "\n\t\t\t\t\t\tJulian Chokkattu\t\t\t\t\t"
        ],
        "text": [
            "<p>Smartphone cameras continue to excel, but one area that could use more improvement is low-light photography. In 2018, Google and Huawei offered solutions using artificial intelligence. The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Google Pixel 3</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">Huawei Mate 20 Pro</a> will knock your socks off at how well they can capture photographs in poorly-lit conditions. We’re putting them head-to-head to see which photos we like more.</p>",
            "<p>Huawei’s technology is called Night Mode, and it’s a separate setting in the Mate 20 Pro’s camera app (it’s also available on a few <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">other Huawei</a> and <a href=\"https://www.digitaltrends.com/mobile/honor-magic-2-news/\">Honor devices</a>, though the best results come from the Mate 20 Pro flagship phone). It works with the help of Huawei’s Artificial Intelligence Stabilization (AIS) system, which debuted on the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">P20 Pro smartphone</a>. The camera app takes a long exposure photo — meaning you’ll need to stay still after tapping the shutter button for four to six seconds (more or less) — and software will stitch the best photos together for one well-exposed photo. No tripod needed.</p>",
            "<p>Google’s feature is called Night Sight, and it works not just on the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-xl-review/\">Pixel 3</a>, but the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-review/\">Pixel 2</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-review/\">Pixel 1</a> as well (though the best results are available through the latest phone). It also uses a long exposure to capture photos in low light (it’s a separate mode in the camera app too). Google uses A.I. to detect things such as if the phone is on a tripod, if there’s any handshake, any motion in a scene, and scene brightness. Depending on the answers, it will capture “15 frames of 1/15 second (or less) each, or six frames of one second each, or anything in between.” Google also uses an Auto White Balancing algorithm in Night Sight, which means you’ll see improved color temperature in photos. You can read more in Google’s <a href=\"https://ai.googleblog.com/2018/11/night-sight-seeing-in-dark-on-pixel.html\">white paper explaining out Night Sight</a> works.</p>",
            "<p>We’re only going to be comparing Night Mode photos with Night Sight photos, so first here’s an example of what a photo looks like without using Night Sight or Night Mode.</p>",
            "<p>Compare Google’s Night Sight and Huawei’s Night Mode, and it’s easy to see the differences. The final photos are brighter, offer more accurate colors, and have better dynamic range. In this particular test, we prefer the Pixel 3’s Night Sight photo the most, as it delivers a much brighter image, with sharper details throughout. It’s the photo we want to share.</p>",
            "<p>You can check out our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">Huawei Mate 20 Pro review</a> and <a href=\"https://www.digitaltrends.com/mobile/google-pixel-night-sight/\">our dive into our Night Sight</a> comparison articleart see more.</p>",
            "<p>Our first example is in Washington Square Park in New York City, showcasing street lamps as well as a pathway through trees.</p>",
            "<p>The Pixel 3’s Night Sight manages to preserve a little more detail in most areas of the photo, because it’s also brighter. Look at the trash can in the center-right side of the photo — you can see more details here. That being said, we much prefer the color accuracy on the Huawei Mate 20 Pro. Everything looks far more natural, unlike the Pixel 3 photo which cranks the saturation a little too high. The green leaves next to the streetlight in the center is a good example of how the Pixel 3 over-saturates the photo.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>We like the Pixel 3’s photo of the Washington Square Arch here more than the Huawei Mate 20 Pro. The white balance is more accurate in the Pixel photo (although some users may prefer the warmer tones of the Mate 20 image), and zoom in closer and you’ll see details are far sharper. Huawei does win points for exposing the background buildings a lot better, but it’s not enough to take the win.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>While we like both photos here, the Mate 20 Pro takes the win. Just look around the main subject, and you’ll notice everything is well exposed. The Pixel 3’s photo shrouds the surroundings in more darkness. Zoom in, and the Mate 20 Pro offers a little more contrast and detail.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>There was a good deal of handshake when we captured both of these photos, and neither of them are perfectly sharp — zoom in on both and they’re fuzzy. But the Pixel 3’s Night Sight photo is much brighter overall and offers more detail than the Mate 20 Pro. The more detailed lines on the bike’s headlight is evidence of this. The Mate 20 Pro, however, does have less noise. Still, the slightly sharper and brighter Pixel 3 photo is the winner.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>It’s difficult taking sharp pictures of dogs when they are constantly moving, so imagine taking a Night Sight or Night Mode photo where you have to stay still for a few seconds. The dog’s head in this photo moved once while capturing the long exposure for both these photos, which is why neither are particularly sharp. But the Pixel 3 a much better job of maintaining focus and reducing blur. It also has an ever so slightly sharper image, though with more grain. While we do think the Mate 20 Pro does a good job with colors, especially in the background — it’s not as saturated as the Pixel 3 — it does seem to struggle not just with the motion of the dog, but with focus as well. The fence in the background looks sharper than the dog.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>We like both of these photos because they illuminated an incredibly dark scene and delivered usable photos. But the Huawei Mate 20 Pro took the better image, because it’s brighter overall — look at the tree bark on the right side for far more details than offered by the Pixel 3 — but it’s also slightly sharper. It’s excellent.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>The Pixel 3 does have an ace up its sleeve: Night Sight works on the front-facing camera. That’s unlike Night Mode on the Mate 20 Pro, which only works on the rear camera. That means you can take selfies with Night Sight, and it opens up a whole lot more possibilities. The surrounding area for these photos isn’t too dark, so Night Sight didn’t offer a lot of changes over the standard Pixel 3 photo, however it does deliver improvements over the Mate 20 Pro’s standard photo. There’s more detail on the face of both subjects — just look at their hair, you can pick out individual strands on the Pixel 3 photo. The color temperature is also better, with the subjects having more natural-looking tones than the Mate 20 Pro.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>While a case can be made that the Mate 20 Pro’s Night Mode can make certain daylight photos better as well, we’ve found results to be mixed. It exposes the whole photo here so there aren’t a lot of dark spots, but it loses a lot of contrast along the way, as well as color. The Pixel 3’s Night Sight photo doesn’t often do much in daylight, looking almost exactly like the original. It’s still the better photo here, though, as it’s sharper, and the deeper colors make it a photo we want to share.</p>",
            "<p><strong>Winner: Google Pixel 3</strong></p>",
            "<p>The addition of A.I.-boosted features like Night Sight and Night Mode dramatically increases a camera’s versatility, and they’ve become essential features on the Pixel 3 and Mate 20 Pro that we use every day. While the Pixel 3 took the most wins in this comparison (including the example photo at the top), Huawei’s Mate 20 Pro came quite close to coming out on top. We’re excited to see the improvements Huawei and Google will bring to these software features in 2019.</p>"
        ]
    },
    {
        "title": "\n\t\tThe Huawei Mate 20 Lite is A.I.-powered, attractive, and affordable\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Huawei is working hard to bring its premium A.I.-driven technology to everyone, regardless of price range. That seems to be the idea behind the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-lite-review/\">Huawei Mate 20 Lite</a>, which launched at <a href=\"https://www.digitaltrends.com/ifa/\">IFA 2018</a>. It’s the first of the new Mate 20 range to be released, and it bodes well for the release of the <a href=\"https://www.digitaltrends.com/mobile/huawei-mate20-news/\">Mate 20 and Mate 20 Pro</a>.</p>",
            "<p>With a powerful new Kirin 710 processor, four camera lenses, and a huge 6.3-inch display, the <a href=\"https://consumer.huawei.com/uk/phones/mate20-lite/\">Huawei Mate 20 Lite</a> could be one of the phones to bring artificial intelligence into everyday life. Unfortunately, there are no plans to bring it to U.S. shores. Here’s everything you need to know about the Huawei Mate 20 Lite.</p>",
            "<p>Despite being a midrange device, the Mate 20 Lite is made from premium materials. There’s glass on the front and back, sandwiching a metal frame. It’s a similar design to previous Huawei devices — but we haven’t grown sick of it yet. It comes in glossy black, sapphire blue, and platinum gold.</p>",
            "<p>It’s bad news for notch-haters though, as the Mate 20 Lite definitely has a notch. However, it should be easy to forgive and forget when it’s embedded in a massive 6.3-inch IPS LCD display, running a crisp 2,340 x 1,080 resolution in a super-long 19.5:9 aspect ratio.</p>",
            "<p>The Mate 20 Lite is a strictly midrange device, but that doesn’t mean it doesn’t have some bite to back up its bark.</p>",
            "<p>This is the first time we’ve seen the revised Kirin 710, and while we don’t expect it to match Huawei’s Kirin 970 (or brand new <a href=\"https://www.digitaltrends.com/mobile/huawei-kirin-980-news/\">Kirin 980 processor</a>), we have high hopes for performance based on Huawei’s fine pedigree. 4GB of RAM should mean the phone keeps on ticking regardless of what you throw at it. 64GB of internal storage and a MicroSD card slot should give most users more than enough room to breath — and there’s a 3.5mm headphone jack, too.</p>",
            "<p>Huawei’s new <a href=\"https://www.digitaltrends.com/mobile/huawei-honor-gpu-turbo-news/\">GPU Turbo</a> is included in this phone, as well as an A.I.-powered Game Suite mode that prioritizes game performance. Despite the lower-powered processor, this combination will hopefully see solid performance from the Mate 20 Lite.</p>",
            "<p>There’s a massive 3,750mAh battery backing up those specs, and a battery of that size should keep the Mate 20 Lite powered for a good amount of time. We saw great battery performance from the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-10-pro-review/\">Mate 10 Pro</a> and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">P20 Pro</a>, and we expect that the Mate 20 Lite will keep up this tradition. Huawei’s 18W fast-charging tech will also be included, so it won’t keep you waiting for long when the battery does need refilling.</p>",
            "<p>A.I. is at the center of almost every consumer-based technological advance, and Huawei is making a big push to be at the forefront of that tech — and the Mate 20 Lite is apparently leading the Chinese company’s next big charge.</p>",
            "<p>Huawei’s aim is for the Mate 20 Lite’s A.I. to seamlessly merge into your life. A.I. Noise Cancellation cuts out background noise during phone calls, ensuring high quality phone calls. A.I. Smart  Gallery uses A.I. to recognize and sort your pictures into automatic albums. The A.I. Shopping Assistant is perhaps the most interesting new feature, and it takes the hassle out of online shopping by using A.I. to find the products you want. Mate 20 Lite users will be able to long-press an image of any product in order to pull up an A.I.-created list of stores that stock that item.</p>",
            "<p>Outside of the A.I. assistance, you’ll find Huawei’s usual EMUI 8.2 skin laid over Android 8.0 Oreo, along with Huawei’s face unlocking feature.</p>",
            "<p>The Mate 20 Pro comes with not two, not three — but four A.I.-powered camera lenses. There’s no P20 Pro-style triplecamera though — it’s two on the front, and two on the back.</p>",
            "<p>You’ll find a 20-megapixel lens working with a 2-megapixel lens on the back of the phone, providing a professional-looking bokeh blur effect. The rear-facing cameras have also been injected with A.I. capabilities, and they’re capable of recognizing over 500 scenarios across 22 categories — including Portrait, Blue Sky, Snow, Ancient Building, and more. The A.I. then alters the camera settings to match the scenario it sees, hopefully giving you the best possible snap every time. The A.I. also offers composition tips during your shooting, providing suggestions on framing and gradually teaching users photography basics.</p>",
            "<p>The front-facing selfie lenses are even more impressive. There’s a 24-megapixel lens running alongside a 2-megapixel lens here, and they work together to provide bokeh “portrait mode” selfies, as well as boosting your selfie game with HDR Pro and Studio Lighting support. Like the rear-facing camera, they’re capable of changing settings to match what they’re looking at — but it’s a reduced number of over 200 scenarios across 8 categories. Though that’s probably more than enough for all but the most prolific of selfie snappers.</p>",
            "<p>Huawei is also diving into the <a href=\"https://www.digitaltrends.com/apple/animoji-ios-11/\">Animoji</a>/<a href=\"https://www.digitaltrends.com/mobile/how-to-use-ar-emoji/\">AR Emoji</a> game with its own version of personalized emojis, called 3D QMoji. These are easily exportable as gifs or videos, meaning they’re super-easy to share on social media.</p>",
            "<p>Keen video users will also be able to record in slow motion, at a speed of 480 frames per second. That’s not as impressive as the 960 fps super-slow motion on the Galaxy S9 and Xperia XZ2 Premium, but it’s still impressive for a midrange device.</p>",
            "<p>The Huawei Mate 20 Lite will be available to purchase in the U.K. from Vodafone, EE, and Carphone Warehouse from October. Prices will start at 380 British pounds. Unfortunately, there’s been no word of a U.S. release, so if you’re U.S.-based and want to get your hands on the new Mate 20 Lite, you’re probably going to have to import it.</p>"
        ]
    },
    {
        "title": "\n\t\tHuawei Mate 20 Pro vs. Mate 20 vs. Mate 20 X vs. Mate 20 Lite\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>With the reveal of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-review/\">Mate 20</a>, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">Mate 20 Pro</a>, and <a href=\"https://www.digitaltrends.com/gaming/huawei-says-mate-20-x-better-than-switch/\">Mate 20 X</a>, Huawei’s new Mate 20 series is now complete, and the three new phones join the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-lite-review/\">Mate 20 Lite</a>. All four phones are powerful, A.I.-driven phones with prices to suit a range of budgets, and screen sizes for almost everyone’s tastes.</p>",
            "<p>But with four Mate 20 phones up for consideration, which phone is best for you? Should you splurge all of your money on the Mate 20 Pro, save some green with the Mate 20 Lite, or go for one of the two middle options? We took a look to find out.</p>",
            "<p>The Mate 20 Lite is an early casualty of this battle, since it’s equipped with the least powerful processor here — the Kirin 710. The remaining three phones are equipped with Huawei’s new, super-powerful <a href=\"https://consumer.huawei.com/en/campaign/kirin980/\">Kirin 980</a> processor, and have access to 128GB of onboard storage, and up to 6GB of RAM, making them similarly powerful. However, the Mate 20 X comes with an innovative cooling system that uses graphene and a vapor chamber to keep the phone cool. This should mean the Mate 20 X’s processor can handle more demanding tasks without having to slow down, giving it an edge in performance.</p>",
            "<p>Each of these phones also has a beefy battery, and they are all likely able to provide multiple days of battery life on a single charge. The Mate 20 X’s 5,000mAh battery is the biggest by far, dwarfing the large 4,200mAh battery in the Mate 20 Pro. Only the Mate 20 Pro comes with Qi wireless charging, but the Mate 20, Pro, and X get Huawei’s SuperCharge fast charging. Huawei claims the Mate 20 Pro can recharge up to 70 percent in 30 minutes — and the Mate 20 and X aren’t far behind this speed.</p>",
            "<p>While each phone does well in this category, we’re giving this to the well-cooled Mate 20 X with its huge battery.</p>",
            "<p><strong>Winner: Huawei Mate 20 X<br>\n</strong></p>",
            "<p>While we may have our qualms about whether the Mate 20 series is as good looking as the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">P20 Pro</a>, these phones certainly have their charm. Being the cheapest, the Mate 20 Lite is probably the least attractive, with a <a href=\"https://www.digitaltrends.com/mobile/why-are-android-phone-makers-embracing-the-notch/\">traditionally chunky notch</a>. That said, it’s a relative observation and it’s still an attractive design with a glass back. The Mate 20 Pro also has a huge notch where the 3D face-sensing tech lives, but it’s also the only phone with an AMOLED display that curves into the all-glass body. The Mate 20 and Mate 20 X have the best notch — the tiny Dewdrop design — and also have premium glass builds. That said, the Mate 20 X is utterly massive and almost impossible to wield one-handed.</p>",
            "<p>There is a clearer winner in durability. Each phone uses a potentially fragile glass build, but only the Mate 20 Pro comes with significant water-resistance with an IP68-rating. The Mate 20 has a splash-resistant IP54 rating, while the Mate 20 X has an even lower IP53 rating. The Mate 20 Lite is the worst off, with no water-resistance at all.</p>",
            "<p>It’s hard to rule a winner in design, and though we prefer the dewdrop notch of the Mate 20 and X, the Mate 20 Pro’s water-resistance is enough — for us — to bring it back to win this round.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro<br>\n</strong></p>",
            "<p>There is a wide range of big displays here, from 6.3 inches to a massive 7.2 inches. But size isn’t everything, and it’s the Mate 20 Pro’s AMOLED display that is the best looking. The LCD displays on the Mate 20, and Lite are great, but they pale into insignificance next to the deep inky blacks and vibrant colors on the Mate 20 Pro. The 20 X might also have an AMOLED display, but the Mate 20 Pro is also the only phone with a 1440p resolution — the rest top out at 1080p — and it curves into the body. While it’s rudely interrupted by the large notch, it’s still easily the brightest, crispest, and most beautiful display here.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro<br>\n</strong></p>",
            "<p>The Mate 20 Lite was always going to be the weakest option here, and though its twinned 20-megapixel and 2-megapixel camera lenses do a good job, it’s not up to the standard of the triple-lens set-ups on the other three phones. The Mate 20 comes with a 16-megapixel ultra wide-angle lens, a 12-megapixel wide-angle lens, and an 8-megapixel 2x telephoto zoom lens. We’re expecting this camera to take some amazing photos — but not as amazing as the 40-megapixel wide-angle lens, 20-megapixel ultra wide-angle lens, and 8-megapixel 3x telephoto zoom lens in the Mate 20 Pro and Mate 20 X.</p>",
            "<p>The Mate 20 Pro and X are equally matched in other areas, too, with the same 24-megapixel selfie lens, the same A.I.-tweaked settings and modes — including some amazing video modes that change your view in real time. They are even equal in pure video terms too, with both being able to take 4K video at 30 frames per second, and super-slow motion at 960 fps.</p>",
            "<p>The Mate 20 Pro and X are equal on paper and until we’ve tested to see if they differ in real terms, we can’t separate them.</p>",
            "<p><strong>Winners: Mate 20 Pro and Mate 20 X<br>\n</strong></p>",
            "<p><a href=\"https://www.digitaltrends.com/mobile/what-is-stock-android/\">Stock Android</a> fans beware: You will find Huawei’s Emotion UI (<a href=\"https://emui.huawei.com/\">EMUI</a>) skin laid over Android on each of these phones. The Mate 20 Lite is an early casualty though, as it’s running <a href=\"https://www.digitaltrends.com/mobile/android-o-news/\">Android 8.1 Oreo</a> — and there hasn’t been word that it will get <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">an update to Android 9.0 Pie</a> yet. Each of the other phones comes with the latest <a href=\"https://www.digitaltrends.com/mobile/huawei-emui-9-interview/\">EMUI 9</a> laid over <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a>. It’s a surprise to see this OS on Huawei’s phones so fast — a heavily customized skin like EMUI often takes months to update, so we didn’t expect to see a Huawei phone running Pie for a while longer. It’s a nice surprise, and it bodes very well for later updates to the Mate 20, Pro, and X. Expect <a href=\"https://www.digitaltrends.com/mobile/possible-android-q-names/\">Android Q</a>, and possibly Android R on those phones.</p>",
            "<p><strong>Winners: Huawei Mate 20, Mate 20 Pro, and Mate 20 X<br>\n</strong></p>",
            "<p>You’ll find Huawei’s super-powered gaming mode, <a href=\"https://www.digitaltrends.com/mobile/huawei-honor-gpu-turbo-news/\">GPU Turbo</a>, on each of these phones, and there is advanced A.I. built into each of them as well, which will recognize scenes in your camera, manage your resources while gaming, and power the <a href=\"https://www.digitaltrends.com/mobile/mate-20-lite-news/\">Qmoji Animoji-style AR emoji feature</a>. The A.I. goes even further in the Mate 20, Pro, and X though, with A.I. handling the real-time filters laid over video, and real-time object identification. Those three phones also have access to Huawei’s new gesture navigation.</p>",
            "<p>But it’s the Mate 20 Pro that packs the most special features. It’s the only phone to come with an <a href=\"https://www.digitaltrends.com/gadget-reviews/vivo-fingerprint-sensor-review/\">in-display fingerprint scanner</a>, and there is also advanced facial recognition on the level of Apple’s <a href=\"https://www.digitaltrends.com/mobile/apple-face-id-head-start/\">FaceID</a>, and the ability to reverse wireless charge. Drop a wirelessly charging device on top of the Mate 20 Pro and the Huawei phone will charge the other device. It’s bonkers and we love it.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro<br>\n</strong></p>",
            "<p>None of these phones has been officially released in the U.S. yet, but you can pick one up from an importer as long as you don’t mind paying import tax. They also won’t work with Verizon or Sprint, so keep that in mind if you’re locked in with either.</p>",
            "<p>The Mate 20 Pro costs 1,049 euros (around $1,220), and the Mate 20 starts from 799 euros (roughly $930). Both phones are currently available for pre-order. The Mate 20 X costs 899 euros (roughly $1,050) and will be available for pre-order from October 26. The Mate 20 Lite is the cheapest at just 380 British pounds (roughly $500) and is currently available for purchase.</p>",
            "<p>It would have been embarrassing for Huawei if the phone it had pegged as the most advanced didn’t win this battle, and thankfully Huawei’s most advanced flagship phone ever has come out on top, thanks largely to its incredible camera, AMOLED display, in-display fingerprint scanner, and advanced facial recognition tech. If money is no impediment, then the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">Mate 20 Pro</a> is definitely the phone to get.</p>",
            "<p>But the others still have their places. The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-lite-review/\">Mate 20 Lite</a> is an excellent $500 phone (though it’s up against the mighty <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6-review/\">OnePlus 6</a> in that price range), the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-review/\">Mate 20</a> is still an exceptional flagship device which serves as the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Galaxy S9</a> to the Mate 20 Pro’s <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Galaxy Note 9</a>. The <a href=\"https://www.digitaltrends.com/gaming/huawei-says-mate-20-x-better-than-switch/\">Mate 20 X</a> is an odd phone to pin down, but it’s clearly the phone to get if you want the largest possible screen you can lay your hands on, or a powerful mobile gaming device like no other.</p>",
            "<p>Whichever you pick will be highly personal though and you will be happy either way. But we would pick the <a href=\"https://www.digitaltrends.com/mobile/huawei-mate-20-pro-vs-samsung-galaxy-note-9/\">Mate 20 Pro</a> every day.</p>"
        ]
    },
    {
        "title": "\n\t\tHuawei Mate 20 Pro vs. Huawei Mate 10 Pro: How much better is the new flagship?\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>Huawei has finally unveiled the all-new Huawei Mate 20 series, including the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">flagship Mate 20 Pro</a>. The new device boasts top-tier specs, an excellent design, and a number of exciting new technologies — including an in-display fingerprint sensor.</p>",
            "<p>But the Huawei Mate 20 Pro has big shoes to fill. Last year’s Mate 10 Pro was also much-loved, boasting excellent specs and a great design. Can the new Mate in town take out the older Mate 10 Pro? We put the two phones head-to-head to find out.</p>",
            "<p>As you might expect, the Huawei Mate 20 Pro is clearly a better performer than the older Huawei Mate 10 Pro — thanks largely to an upgraded processor. While the Mate 10 Pro features Huawei’s own Kirin 970 processor, the Mate 20 Pro steps things up with a <a href=\"https://www.digitaltrends.com/mobile/huawei-kirin-980-news/\">newer-generation Kirin 980</a>, which is around 20 percent faster and 40 percent more power efficient than the older chip. That’s not to say that the Kirin 970 isn’t a great chipset — it is — but the Kirin 980 is clearly a better performer. In the Mate 10 Pro, the processor is coupled with either 4GB or 6GB of RAM, along with either 64GB or 128GB of storage, while the Mate 20 Pro sticks with 6GB of RAM and 128GB of storage.</p>",
            "<p>The battery inside the Mate 10 Pro was already a great performer, coming in at 4,000mAh — but the Mate 20 Pro takes it up a notch to 4,200mAh. Now, that doesn’t necessarily mean that the phone will last longer on a charge, especially considering the larger, higher-resolution display. Still, it does bode well for a long battery life. Batteries can be charged a few different ways depending on the phone. On the Mate 20 Pro, you’ll enjoy wireless charging support, as well as Huawei’s own “Super Charge 2.0,” which is a 40W charging system that should charge the phone to 70 percent in just 30 minutes. The Mate 10 Pro doesn’t have wireless charging, and offers the original Huawei Super Charge, which will charge to around 55 percent in 30 minutes.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>The Huawei Mate 20 Pro features a modern design thanks to its edge-to-edge display and all-glass build. It does have a notch, which may not please all Android fans, but it’s not an overly deep or pronounced notch — like the one on the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-xl-review/\">Google Pixel 3 XL</a> — meaning that it’ll be easy to forget about. The display on the device comes in at 6.4 inches.</p>",
            "<p>The Mate 10 Pro may not look quite as modern as the newer phone, but it’s still not a bad-looking device. There’s a small forehead and chin on the phone, but they’re easy to ignore.</p>",
            "<p>When it comes to durability, the phones are very similar. Both phones feature a glass build, despite the Mate 10 Pro not offering wireless charging. The main difference, of course, is the water resistance — the Mate 10 Pro has a rating of IP67, while the Mate 20 Pro steps things up to IP68.</p>",
            "<p>The Mate 20 Pro features a more modern design and is slightly more durable. It’s the clear winner.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>When it comes to display, it’s another easy win for the newer phone. Both the Huawei Mate 10 Pro and the Mate 20 Pro feature AMOLED displays. However, while the display on the Mate 10 Pro comes in at 6 inches with a resolution of 2,160 x 1,080 pixels for a pixel density of 402 pixels-per-inch, the Mate 20 Pro is a serious upgrade with s 6.4-inch display, 3,120 x 1,440 resolution, and 538 pixels-per-inch pixel density. That makes the Mate 20 Pro’s display one of the best on the market.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>The Huawei Mate 10 Pro had one of the best smartphone cameras available at its time of release, boasting a dual-sensor setup with one 12-megapixel sensor and one 20-megapixel monochrome sensor, both with an aperture of f/1.6. Other features include optical image stabilization, laser autofocus, and more. We found that in the real world, the camera was pretty spectacular too — photos were crisp and detailed, while colors were nice and vibrant.</p>",
            "<p>The Mate 20 Pro, of course, aims to improve on this. The new device features three sensors instead of two, including one 40-megapixel main sensor with an f/1.8 aperture, one 20-megapixel wide-angle sensor with an aperture of f/2.2, and one 8-megapixel telephoto lens with an aperture of f/2.4. On the front, you’ll find a 24-megapixel sensor. The Mate 20 Pro’s camera performs extremely well, and it’s definitely more versatile than the camera in its predecessor.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>Both the Mate 10 Pro and Mate 20 Pro are Android phones, and they feature Huawei’s Android skin, EMUI. The Mate 10 Pro ships with Android 8.0 Oreo, though an update to Android 9.0 Pie has started rolling out. The Mate 20 Pro, on the other hand, ships with <a href=\"https://www.digitaltrends.com/mobile/android-9-pie-review/\">Android 9.0 Pie</a> — so it’s relatively up to date.</p>",
            "<p>Huawei isn’t known for for updating phones quickly, which may be frustrating for those who like to get new Android features as soon as they become available. If that’s you, then perhaps you’re better off with a <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Pixel phone</a>.</p>",
            "<p>EMUI may also not be for everyone. Icons are a little different, and there are a range of tweaks to <a href=\"https://www.digitaltrends.com/mobile/huawei-emui-9-interview/\">how the software works</a>, which might be a little confusing for a first-time Huawei user.</p>",
            "<p>The software experience on these phones is going to be very similar, but given the fact that the Huawei Mate 20 Pro is newer, and therefore expected to be supported with updates for longer, it’s the winner here.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>Both the Huawei Mate 10 Pro and the Huawei Mate 20 Pro feature Huawei’s own Neural Processing Unit, or NPU — however the one in the Mate 20 Pro is likely to be faster and more powerful. On top of that, the Mate 20 Pro offers features like a new Face ID-like facial-recognition system and an in-display fingerprint sensor, helping it win this category.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>The Huawei Mate 10 Pro has been out for a year now and has been discounted a few times. Right now, you can get one on Amazon for $500. The Mate 20 Pro, on the other hand, is brand-new — so expect flagship phone pricing. The device isn’t actually coming to the U.S., but in Europe it’ll be available starting at 1,049 euros, which equates to around $1,220.</p>",
            "<p>No surprises here — the Huawei Mate 20 Pro is clearly the better phone. It offers better performance, better design, a better display, and a better camera too. That’s not to say that the Mate 10 Pro isn’t a great device — in fact, of these two phones, it might be the only option available to you, due to the fact that the Mate 20 Pro isn’t coming to the U.S. The older phone is also potentially less than half the price. But if you do have a choice between the two and don’t mind spending the extra cash, we definitely recommend buying the Mate 20 Pro.</p>"
        ]
    },
    {
        "title": "\n\t\tTurbulent 2018 didn’t keep Huawei from selling millions and millions of phones\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p>Despite a turbulent year, Huawei has had massive sales success according to figures now released by the company itself. In 2018, Huawei sold more than 200 million smartphones, cementing its place as one of the top three manufacturers in the world. The 200 million figure includes both Huawei and Honor — the sister brand to Huawei — phones, and is an impressive rise from the three million phones Huawei sold in 2010. This represents an annual growth of 66 percent.</p>",
            "<p>Analysts place Huawei as the world’s <a href=\"https://www.digitaltrends.com/mobile/huawei-apple-counterpoint-research/\">number two smartphone manufacturer</a>, in front of Apple but behind Samsung. Samsung has not revealed the amount of phones sold in 2018. According to <a href=\"https://www.strategyanalytics.com/strategy-analytics/blogs/devices/smartphones/smart-phones/2018/11/01/global-smartphone-shipments-tumble-8-percent-in-q3-2018\" target=\"_blank\" rel=\"noopener\">Strategy Analytics</a>, Samsung’s sales figures fell during the third quarter — between July and September — by 13 percent, compared to Huawei’s 32 percent growth to 51 million devices. Samsung, even with its poor overall performance, still sold 72 million. While helping it catch Samsung, Huawei’s growth is equally key to keep it ahead of Apple. The same Strategy Analytics report shows Huawei’s global market share to be 14.4 percent. Apple is very close behind with 13 percent.</p>",
            "<p>Huawei’s 2018 premium smartphones have been well received. The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">P20 Pro</a> and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">Mate 20 Pro</a> have both been praised for their excellent cameras, with the Mate 20 Pro selling five million phones in only two months. In China, <a href=\"https://www.digitaltrends.com/mobile/huawei-nova-4-news/\">the Nova series</a> have proven popular too. The Nova 3 is the most popular selfie smartphone of the year, says the company in its press release.</p>",
            "<p>Honor’s contribution to the 200 million is likely to be sizeable, although the press release doesn’t breakdown the split between the two brands. Honor is China’s number one brand of smartphones sold online, and has been increasing its presence internationally. In mid-2018, Honor’s own growth reached 150 percent year-on-year internationally, selling three million Honor 10 phones alone. Growth is in the many hundreds of percent in Europe and India.</p>",
            "<p>Huawei’s success in 2018 has not been easily achieved. Most notably, the high sales figures have come with a minimal presence in the U.S., continued allegations over ties to the Chinese government sparking concerns over the use of its 5G network equipment, plus most recently the arrest of the firm’s Chief Financial Officer Meng Wanzhou, and the related political strife.</p>",
            "<p>It’s not letting all this, or its sales success, affect its ambition for the coming year. For 2019, Huawei has already promised <a href=\"https://www.digitaltrends.com/mobile/huawei-folding-smartphone-news/\">a folding smartphone</a> that will connect to a 5G network, and rumors are gathering around the forthcoming P20 replacement, known currently as <a href=\"https://www.digitaltrends.com/mobile/huawei-p30-pro-news/\">the P30</a>.</p>"
        ]
    },
    {
        "title": "\n\t\tHuawei and Leica’s monochrome lens is dead, so we celebrate its life\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p>While both the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-review/\">Huawei Mate 20</a> and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">Mate 20 Pro</a> have three camera lenses, none of them shoot only in monochrome, marking the end of a fantastic era for smartphone photography. Ever since Huawei first partnered with camera experts Leica, a monochrome lens has sat alongside the regular camera lens, giving us the wonderful ability to shoot photos in pure, unadulterated black and white. On the Mate 20 series, this lens has been replaced by an ultra-wide camera lens, and while we’re excited for the creative possibilities, the monochrome lens will be missed.</p>",
            "<p>For many people, me included, smartphones have been our entry into the world of photography. While we may have experimented with regular cameras in the past, any untapped photographic talent or burgeoning love will have only manifested because of the phone in our pocket. This means the phone’s camera features will have prompted experimentation, and influenced growth. Hyperbole? No, because that’s what the monochrome lens on the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p9-review/\">Huawei P9</a>, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p10-review/\">Huawei P10</a>, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-10-pro-review/\">Mate 10 Pro</a>, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/porsche-design-huawei-mate-rs-review/\">Mate RS</a>, and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">P20 Pro</a> did for me, and why I wanted to write what could be called an obituary.</p>",
            "<p>However, like all the best obituaries, it will really be a celebration.</p>",
            "<p>My first monochrome photo taken with the Huawei P10 was snapped on February 25, 2017. Two days after, a professional photographer taught me a little about how to capture beautiful shots in black and white. That session resulted in a former member of the DT Mobile team taking what I consider to be one of the best photos of me in existence, and it’s in black and white.</p>",
            "<p>Despite dabbling with the mode on the Huawei P9, this was the start of my love affair with the Huawei’s monochrome camera.</p>",
            "<p>Since then, a Huawei camera phone with a monochrome lens has accompanied me on many trips, and my favorites pictures taken are often those taken in black and white. In China, it captured the super modern buildings in stark detail, while the neon in Las Vegas seemed to shine more brightly. The Grand Canyon looked like the surface of the Moon, the sharp lines of Wall Street were emphasized even more, and the Louvre in Paris took on a magical look. From a late night whisky bar in London, to a nighttime photo tour of Frankfurt, a unique atmosphere was always captured, or created, photographing in black and white.</p>",
            "<p>On a photo tour of Frankfurt, photographer Bobby Anwar was a teaching a group about how to take low-light photos, and <a href=\"https://www.digitaltrends.com/mobile/monochrome-photography-tips/\">monochrome was heavily featured</a>. A life-long Leica fan, Anwar commented at the time how the monochrome lens made Huawei’s camera phones stand out. Seeing what was possible at the time was so influential personally, and it became a running joke that if I was taking a photo, there was a good chance it was a monochrome shot.</p>",
            "<p>I’m not saying monochrome worked everywhere, at all times. For every monochrome photo, a color one was usually taken at the same time, because the atmosphere changed with each one — and that was its appeal. For me, stripping away the color sometimes revealed more about the scene than keeping it in, and made me want to try it out, just to see what the end result would be like. It sparked creativity in an organic, immensely satisfying way.</p>",
            "<p>I’m not the only one. Digital Trends’ photography writer Daven Mathies used the P20 Pro on a visit to Leica’s headquarters, <a href=\"https://www.digitaltrends.com/photography/huawei-p20-pro-leica-street-photography/\">and wrote</a>, “We enjoyed the monochrome mode so much that we probably used it for well over half of the photos we made on the trip.”</p>",
            "<p>The photographers among you will already know the appeal of black and white photos, and most of us will know the many famous, striking images — especially portraits — that have been published in black and white over the years. This is not an article about the history, influence, or impact of monochrome photography. It is a celebration of Huawei and Leica bringing a true monochrome lens to a smartphone.</p>",
            "<p>Leica and black and white photography are synonymous with each other, to the point it produces <a href=\"https://www.digitaltrends.com/photography/leica-limited-edition-m-monochrom-signed-by-ralph-gibson/\">a digital, black-and-white-onl</a>y camera. Those classic black and white portraits we’re all familiar with? Many will have been taken with a Leica camera. Through my own personal love of using it, I can easily see how it has sparked the creativity of all those master photographers.</p>",
            "<p>It also illustrated the close <a href=\"https://www.digitaltrends.com/photography/huawei-p20-pro-leica-street-photography/\">working relationship between Leica and Huawei</a>. While there are technical reasons for including the lens, it’s not essential, and Huawei clearly put its trust in Leica rather than push for an alternative feature that’s more headline friendly. It was right to, as the pair created what is one of the best smartphone cameras we’ve ever used.</p>",
            "<p>However, change was afoot at Huawei. The monochrome photo mode, once an easily accessed feature, was becoming less important with every new version  of the software, eventually resulting in the mode being hidden in a submenu. It still worked as usual, and could even shoot in aperture mode for spectacular bokeh-style photos. But you wouldn’t stumble across it. You had to go looking.</p>",
            "<p>Leica and Huawei have a long-term partnership and as we’ve mentioned, monochrome is an important part of the company’s products. On Huawei phones it’s not just there as a feature, the monochrome lens worked in conjunction with the rest of the camera system to gather visual data and enhance its photos. Why has the monochrome lens been removed from the Mate 20 and Mate 20 Pro? Huawei told Digital Trends the feature simply wasn’t used much, and that it can now collect more image data, and crucially better data, from the other lenses. The monochrome lens had outlived its usefulness. Swapping it out for an ultra-wide lens makes sense.</p>",
            "<p>It’s the end, but not entirely. Dig into the camera app on the Mate 20 and Mate 20 Pro and you’ll still find a monochrome mode, only this time it enables a filter, just like the black and white mode on every other smartphone camera out there. Huawei promises us that Leica has tuned the filter exactly to its liking, and there is very little difference between the filter and a dedicated lens. We believe this, and find it highly unlikely that Leica would put its name in a substandard monochrome filter.</p>",
            "<p>But it’s not quite the same. Put a shot taken with the P20 Pro’s monochrome lens alongside a black and white filter shot taken with another phone, and although the differences are slight, they are there. It mostly has to do with crispness, depth, and pin-sharp contrast. Plus, there’s knowing you’re not taking a picture with a filter. It’s the real thing. Sweeteners make your tea taste sweet, but there’s no substitute for dropping in a real cube of actual sugar.</p>",
            "<p>It’s the end of an era, and the beginning of a new one. Shooting monochrome photos with the P20 Pro, the P10, Mate RS, and the Mate 10 Pro has genuinely changed my appreciation of photography. All the pictures you see in this article are ones I’ve taken. They’re not masterpieces, but they do represent the amount of enjoyment this one feature brought.</p>",
            "<p>I’m sorry to see it go, but excited for the future. Ultimately, if Leica approves of its new monochrome filter on the Mate 20, I’m sure I will too.</p>",
            "<p><em>The views expressed here are solely those of the author and do not reflect the beliefs of Digital Trends.</em></p>"
        ]
    },
    {
        "title": "\n\t\tTop tips to make the Huawei Mate 20 Pro your best friend\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p>The new <a href=\"https://consumer.huawei.com/uk/phones/mate20-pro/?gclid=Cj0KCQiAxNnfBRDwARIsAJlH29CHyUrh5miCLc8xsgm6VLNAD6sXBOlh_wuFlX-SBt1PYvMOnMCpGjoaAhEXEALw_wcB\" target=\"_blank\" rel=\"noopener\">Huawei Mate 20 Pro</a> is one of the most feature-packed smartphones available today, which makes it ultra-desirable, and likely to ensure it finds its way into a lot of hands. If that’s you, and a new Mate 20 Pro is nestling in your palm now, then read on, because we’ve got some great tips to help you know your phone just that little bit better. The more you know it, the more you’ll get from it.</p>",
            "<p>Alternatively, if you’re looking for our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">Huawei Mate 20 Pro review</a> it’s right here, and we have some suggestions for <a href=\"https://www.digitaltrends.com/mobile/best-huawei-mate-20-pro-cases/\">great cases here</a> too. If you’re still making a buying decision, don’t dismiss the standard Mate 20 either, and you can <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-review/\">read our review here</a>.</p>",
            "<p>Huawei has included gesture controls in EMUI 9.0, the user interface over Android 9.0, on the Mate 20 Pro; but they are not active by default. To try them out, open <em>Settings, System</em>, and <em>System Navigation</em>. From here, there are three choices: <em>Gestures, Three-key Navigation</em>, and <em>Navigation Dock</em>.</p>",
            "<p>Select Gestures for Huawei’s own gesture system. The traditional Android buttons will disappear from the bottom of the screen, and you’ll navigate around using an upward swipe for returning home, a swipe at the side of the screen for back, and a swipe up and hold for the open app menu.</p>",
            "<p>The Navigation Dock is a small onscreen dot, where taps and presses also navigate around the phone. It can be used in conjunction with either main control method. To return to the familiar Android keys, follow the same method above and select Three-Key Navigation. However, Huawei’s gesture controls work well on the Mate 20 Pro.</p>",
            "<p>This is a common request for Huawei phone users: How do you change the home screen layout from having app icons spread across multiple screens, to a traditional app tray? It’s easy. Open <em>Settings</em>, then <em>Home Screen &amp; Wallpaper</em>, and finally <em>Home Screen Style</em>. Here there are two options, either the standard Huawei setting for apps across Home screens, or the Drawer option. Tap either one to activate.</p>",
            "<p>This is a new feature for EMUI 9.0, and operates like <a href=\"https://www.digitaltrends.com/mobile/how-to-use-google-digital-wellbeing-android-9-pie/\">Google’s Digital Wellbeing</a> system that’s only available on Pixel phones at the moment. It’s a great way to monitor your app and phone usage, and a benefit of Huawei’s app is that it collects data over a longer period of time than Google’s.</p>",
            "<p>Go to <em>Settings</em> and find the <em>Digital Balance</em> option. Open it, and if it’s for the first time you may have to grant it some permissions. From here, you can set up usage limits for apps, set a daily screen time limit, and a bed time mode to grey out the screen after a certain time.</p>",
            "<p>The Huawei Mate 20 Pro does not have a 3.5mm headphone jack, so if you’re planning to buy a pair of Bluetooth headphones for use with the phone, perhaps consider getting a set that supports AptX HD, which gives you higher than CD quality sound from Hi-Res audio files. You need an AptX HD pair of headphones — find them all listed on the <a href=\"https://www.aptx.com/products?field_aptx_type_tid=483\" target=\"_blank\" rel=\"noopener\">AptX website</a>, but we like the <a href=\"https://www.digitaltrends.com/headphone-reviews/sony-wh-1000xm3-review/\">Sony WH-1000xM3</a>, and the <a href=\"https://www.digitaltrends.com/home-theater/audio-technicas-ath-dsrbt9-aptx-hd-bluetooth-headphones-were-almost-never-made/\">Audio-Technica ATH-DSR9BT</a> — and then simply pair them with your phone to get the best wireless sound you’ll hear.</p>",
            "<p>One of the reasons to buy the Mate 20 Pro is the awesome camera, which in addition to the new wide-angle lens, also has a special Super Macro Mode. There isn’t a specific setting for this, so it’s helpful to know how to kickstart it when you’re out taking photos. Open the camera app, then tap the zoom settings in the viewfinder to cycle through to the 0.6x wide-angle mode. Now, get in close to your subject — about 2.5cm away, according to Huawei — and wait for the artificial intelligence to realize what you’re taking a picture of, and Super Macro mode will activate. You’ll know because like other scene recognition modes, it’ll display the mode name in the viewfinder.</p>",
            "<p>Huawei has one of the best artificial intelligence (A.I.) systems on any smartphone, and it’s particularly effective in the camera, where it deals with scene recognition and setting adjustment. This can result in some <a href=\"https://www.digitaltrends.com/mobile/huawei-mate-20-pro-vs-lg-g7-vs-asus-rog-phone-camera-shootout/\">great photos</a>, but you may not always want it interrupting. It’s possible to turn off the A.I. in the camera completely, if you’d prefer to see results without it.</p>",
            "<p>Open the camera app, then tap the cog in the top right of the screen. Look for the <em>Master A.I.</em> setting and toggle it off. Remember that with the Master A.I. disabled, you won’t get any of the auto scene recognition adjustments. To turn it back on, just reverse the process.</p>",
            "<p>If you watched the Mate 20 Pro launch event, you may recall an amazing feature being demonstrated, where the phone’s camera 3D-scanned a cuddly toy and then using augmented reality, brought it to life on the screen. Not available at launch, this feature is now available for Mate 20 Pro owners, and here’s how to get it.</p>",
            "<p>Open the Huawei App Gallery app, and if it’s not already on the main screen, search for 3D Live Maker. Download and install the 145MB app, then follow the on-screen instructions to start bringing inanimate toys to life. Yes, it needs patience to get it right; but the results are cool when you get the hang of it.</p>",
            "<p>Did you know the Huawei Mate 20 Pro can charge other devices wirelessly? Surprising as it sounds, provided the other device supports the Qi wireless standard, it actually works. However, it’s not a feature that’s always active, so you’ll have to dig into the settings to switch it on.</p>",
            "<p>First, ensure the device you want to charge has wireless charging. The new <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-review/\">Apple iPhone XS</a>, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-max-review/\">XS Max</a>, and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Samsung Galaxy Note 9</a> will all work, for example. On the Mate 20 Pro, open up <em>Settings</em>, then choose the <em>Battery</em> option. Scroll down and look for the <em>Wireless Reverse Charging</em> option, and tap the switch to the right. A graphic will appear showing you how to position the two devices. It’s as easy as putting the two phones together, back-to-back.</p>",
            "<p>The Mate 20 Pro’s OLED screen supports an always-on display, so you can see the time, battery life, and notifications on the lock screen. This is turned off as standard, so to find it, go to <em>Settings, Home Screen &amp; Wallpaper</em>, and then look for the <em>Always-on Display</em> option at the bottom. Tap it and toggle the switch. While you’re there, you can schedule it so the always-on display doesn’t stay on during the night, where it could be too bright.</p>",
            "<p>Out of the box, the Mate 20 Pro will have its Smart Resolution feature active, which lowers the resolution of the screen to help save battery power. If you want to make use of the maximum 3120 x 1440 pixel resolution, you’ll have to override this. Go to <em>Settings, Display</em>, then <em>Screen Resolution</em>. Toggle the <em>Smart Resolution</em> option at the top of the screen, then select WQHD+ from the options underneath. You may want to switch Smart Resolution back on in the future, as not all apps and screens will make use of all the pixels, resulting in a waste of energy.</p>",
            "<p>A side effect of the Mate 20 Pro’s notch, where the 3D scanning front camera array is contained, is that there isn’t much room for notifications. While there isn’t much you can do about it, there is a way to free up a tiny bit of space. Try these two tips first. Go to <em>Settings</em>, then <em>Display</em>, and finally <em>More Display Settings</em>. Here, deselect the <em>Display Carrier Name</em> and <em>Display Network Speed</em> options.</p>",
            "<p>Next, go back to <em>Settings</em> and to <em>Battery</em>. Tap the cog in the top right, and then <em>Battery Percentage</em>, and choose Do Not Show. Additionally, pull down the notification shade and turn NFC off, then Bluetooth. Yes, several of these are compromises — no NFC means no Google Pay, and you’ll need Bluetooth for headphones or other accessories — but it’s the only way to free up space for notification icons.</p>"
        ]
    },
    {
        "title": "\n\t\tHuawei is not-so-subtly trolling Friday’s iPhone launch\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p>September 21 is <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-review/\">iPhone XS</a> day, but it’s not only Apple that’s out pushing its products into the hands of eager smartphone buyers. Huawei, the world’s second-largest smartphone manufacturer, has a new phone coming in the next few weeks and wants to remind prospective iPhone buyers what they could be missing out on. (Hint: It’s the <a href=\"https://www.digitaltrends.com/mobile/huawei-mate20-news/\">Mate 20 Pro</a>) It’s doing so in a not-so-subtle, but rather amusing, way.</p>",
            "<p>On its official U.K. mobile Twitter account, the company posted a picture of a large, <a href=\"https://twitter.com/HuaweiMobileUK/status/1043036367633100800\" target=\"_blank\" rel=\"noopener\">Huawei-branded van</a> parked outside the Apple Store on Regent Street in London Friday morning. It’s called the “Huawei Ju%ce Van,” and it’s a mobile phone recharging station, and a place for anyone passing the Apple Store to grab a “brain-boosting drink.” The Twitter post finishes with the words, “A #HigherIntelligence is coming,” which is a reference to the Mate 20 Pro’s launch on October 16.</p>",
            "<p>If that wasn’t enough, in Singapore Huawei spent the night before the iPhone XS launch handing out smartphone power banks — approximately 200 of them, <a href=\"https://mothership.sg/2018/09/huawei-troll-apple/\" target=\"_blank\" rel=\"noopener\">according to a local source</a> — to those patiently waiting in the Orchard Road Apple Store queue. The 10,000mAh pack included a friendly note from Huawei too, saying, “Here’s a power bank. You’ll need it. Courtesy of Huawei.”</p>",
            "<p>Huawei hasn’t been hiding its disdain for Apple’s new iPhone models since they launched. Through the Huawei Mobile Twitter account, the firm has posted several short videos, insinuating Apple’s new phones are the <a href=\"https://twitter.com/HuaweiMobile/status/1039959135914262528\" target=\"_blank\" rel=\"noopener\">same as the old ones</a>, and <a href=\"https://twitter.com/HuaweiMobile/status/1039948903943168005\" target=\"_blank\" rel=\"noopener\">thanking Apple</a> for letting Huawei be “the real hero of the year.” In July, Huawei overtook Apple to become the <a href=\"https://www.digitaltrends.com/mobile/gartner-huawei-overtook-apple/\">second-largest smartphone seller</a> in the world, and clearly feels it has earned the right to send a few well-aimed jabs in Apple’s direction.</p>",
            "<p>The <a href=\"https://www.digitaltrends.com/mobile/huawei-mate20-news/\">Huawei Mate 20 Pro</a> will launch at an event in London on October 16. It will be powered by the new Kirin 980 processor, and it’s in relation to this that Apple got one over on Huawei. The <a href=\"https://www.digitaltrends.com/mobile/huawei-kirin-980-news/\">Kirin 980</a> will become the second mobile chip manufactured using a 7nm process to be made available. Apple’s new A12 Bionic, inside the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-review/\">iPhone XS</a>, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-max-review/\">iPhone XS Max</a>, and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xr-review/\">iPhone XR</a>, will be the first, despite being announced after Huawei’s chip. These things always go both ways.</p>"
        ]
    },
    {
        "title": "\n\t\tHuawei Mate 20, Pro, and X: Everything you need to know\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Huawei is on a roll. The Chinese company produced the hit <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">Huawei P20 Pro</a> smartphone at the start of 2018, which earned praised for its excellent camera and beautiful design. But Huawei’s not done yet, and it ended the year by revealing the Huawei Mate 20 range. The Mate 20, Mate 20 Pro, and Mate 20 X follow the impressive <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-lite-review/\">Mate 20 Lite</a> and introduce Huawei’s latest hardware and beautiful design.</p>",
            "<p>Here’s everything you need to know about the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-review/\">Huawei Mate 20</a>, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">Mate 20 Pro</a>, and the supersized Mate 20 X.</p>",
            "<p>The west may have celebrated New Year already, but it’s not due in China until February — and there <a href=\"https://www.gsmarena.com/huawei_plan_launch_red_mate_20_pro-news-34880.php\">might be</a> <a href=\"https://www.droidshout.com/huawei-mate-20-pro/\">two new editions</a> of the Huawei Mate 20 Pro to celebrate it. According to <a href=\"https://news.mydrivers.com/1/609/609677.htm\">MyDrivers</a>, a special Fragrant Red and Comet Blue Mate 20 Pro have been spotted on Chinese microblogging site Weibo. An image has been leaked of the Fragrant Red option, but the only apparent evidence of the Comet Blue variant is apparently from source code. Still, Chinese companies love to celebrate Chinese New Year, so it’s likely we’ll see at least one of these new colors launched in China come February.</p>",
            "<p>The Huawei Mate 20 is clearly one of the best Android phones of the year — but unfortunately it’ll be very hard to get the device for yourself if you live in the U.S. The news comes from a <a href=\"https://www.businessinsider.com/huawei-mate-20-mate-20-pro-unavailable-us-spying-fears-2018-10?op=1\" rel=\"noopener\">report from Business Insider</a> in which a Huawei spokesperson confirmed that the company won’t be selling the device in the U.S. If you <em>really</em> want the phone, it’s possible you might be able to find it through some online retailers — but given the fact that the U.S. sometimes uses different network frequencies and technologies, you’ll want to carefully check on network compatibility before you buy.</p>",
            "<p>Huawei’s designs have always been in line with the latest mobile trends, and the Mate 20, Mate 20 Pro, and Mate 20 X are no different. You’ll find glass with gently curving sides laid over solid aluminum frames, and notches cut into both displays — but there are some fairly significant differences between Huawei’s latest flagships and 2018’s biggest trends.</p>",
            "<p>The most obvious change from the norm is the placement of the camera lenses on the back of the phone. While the use of three lenses is becoming more commonplace, having been introduced in Huawei’s own <a href=\"https://www.digitaltrends.com/photography/huawei-p20-pro-camera-tips/\">P20 Pro</a>, and continued in the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v40-thinq-review/\">LG V40 ThinQ,</a> it’s the positioning of the lenses that is now more interesting than the number. Rather than a horizontal or vertical line, the Huawei Mate 20 series’ three lenses are formed into a 2-by-2 box along with the camera’s flash unit as the fourth member, forming a distinctive square. In a world where flagship phones are looking startlingly similar, this simple change makes the Mate 20 range stand out from the crowd.</p>",
            "<p>The glass on both phones has also seen some changes. While both phones still sport Huawei’s magical color-changing glass backs, a “featherline” pattern has been added to both phones. This pattern helps to decrease the visual impact of greasy fingerprints on the back of the phones — hopefully ending this common scourge of glass phones. Huawei has also added an extra layer to the back as well, something referred to as “vinyl tactility.” This layer increases grip significantly on the back of the phone, while still permitting the phone to retain the premium feel of pure glass.</p>",
            "<p>Flip the two phones over and you’ll find some differences to set them apart from one another. The Mate 20 is equipped with a tiny Dewdrop notch cut into a 6.53-inch RGBW HDR display, running a 2244 x 1080 resolution in an 18.7:9 aspect ratio. The Mate 20 Pro is a slightly smaller phone, but rocks an impressive 6.39-inch curved OLED display, running a 3,120 x 1,440 resolution in a 19.5:9 aspect ratio. The Pro model also sports a notch, but it’s cut much wider to accommodate an advanced 3D depth-sensing array built into the front of the phone. The Mate 20 X is the largest of the three phones by a significant margin. It’s equipped with a huge 7.2-inch HDR display, and emulates the look of the Mate 20, complete with Dewdrop notch.</p>",
            "<p>You’ll find a fingerprint sensor on the back of the Mate 20 — but it’s missing on the Mate 20 Pro. Instead, Huawei has incorporated fingerprint scanning tech into that phone’s OLED display. This is definitely the mobile world’s next major advance, and it’s the first time we’ve seen Huawei put it into one of its mainstream phones. Huawei first tested out the tech in the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/porsche-design-huawei-mate-rs-review/\">Porsche Design Huawei Mate RS</a>, and it’s been revamped since that first buggy release.</p>",
            "<p>Only the Mate 20 Pro should be able to survive a slip into the pool, with IP68-rated water-resistance. The Mate 20 is only rated at IP54, and the Mate 20 X is rated for IP53, and can only withstand splashes. As a modern flagship phone, the Mate 20 Pro lacks a headphone jack, while the venerable port is still present on the less advanced Mate 20 and Mate 20 X.</p>",
            "<p>The Mate 20 series phones will be available in five colors from release — Black, Twilight, Midnight Blue, Emerald Green, and Pink Gold.</p>",
            "<p>While Huawei eschews the year’s usual Snapdragon 845 processor for its flagship phones, its own proprietary Kirin processors have usually kept up with the curve, providing great performance.</p>",
            "<p>The Mate 20 series presents the first Huawei phones to feature the new Kirin 980, the next advance of Huawei’s processor tech. It’s an eight-core processor, and Huawei’s first built on the 7-nanometer process — basically, it’s super-small. The 980 consists of four little cores that handle low-intensity tasks, two middle cores for more demanding tasks, and two advanced cores that will blast through the most demanding of apps and games. Huawei claims this new processor boosts speed by 20 percent and power efficiency by 40 percent when compared to the older Kirin 970.</p>",
            "<p>But it’s not just about raw power. Huawei is continuing its drive toward <a href=\"https://www.digitaltrends.com/mobile/huawei-ai-kirin-970-npu/\">an A.I.-powered future</a>, and has included two neural processing units (NPUs) inside the heart of the Kirin 980. The Kirin 970 also boasted a single one of these cores, but Huawei claims that these two newer NPUs outstrip the older NPU by 134 percent in performance, and 88 percent in power efficiency. Thanks to this massively boosted capacity, the Mate 20 range will do an awful lot more in the NPU, with support for real-time image processing, and object recognition and segmentation — not only in photos, but also in video.</p>",
            "<p>You’ll get the choice between 4GB of RAM and 6GB on the Mate 20, while the Mate 20 Pro and Mate 20 X will ship with 6GB as standard. Regardless of which model you pick, you’ll be getting 128GB of onboard storage — with the option of boosting that by up to 256GB via expandable storage. However, it’s not like regular MicroSD expansion — Huawei is pushing a new proprietary nano memory card for some reason, so your trusty old MicroSD won’t work.</p>",
            "<p>You’ll find huge batteries backing up these powerful phones. The Mate 20 comes with a 4,000mAh battery, while the Mate 20 Pro goes one better with a 4,200mAh battery. We’ve seen incredible two-day battery life from past Huawei flagships, and we’re expecting similar performance from both of these.</p>",
            "<p>The Mate 20 X takes it even further, with a massive 5,000mAh battery to power the huge 7.2-inch display. The Mate 20 X also comes with an innovative new cooling system that uses a combination of graphene film and a vapor chamber to funnel heat away from the battery and CPU — which means the Mate 20 X should be able to keep on ticking without dropping performance or damaging the phone’s internals.</p>",
            "<p>Huawei’s SuperCharge fast charging is back, too, and Huawei claims the 40W charger included with the Mate 20 Pro will charge up to 70 percent battery in just 30 minutes. The Mate 20 and Mate 20 X come with a lower powered 22.5W charger, but we’re still expecting incredibly fast charging. For comparison, the iPhone XS ships <a href=\"https://www.digitaltrends.com/mobile/how-to-fast-charge-your-iphone/\">with a 5W charger</a>, giving you an idea of how powerful these chargers are.</p>",
            "<p>You’ll get 15W fast wireless charging support for both phones, which Huawei claims is 200 percent faster than wireless charging on an iPhone X. There’s even more impressive tech included in the Mate 20 Pro though — it will be able to wirelessly charge other wireless charging devices. This feature has been rumored to work with an upcoming pair of Huawei wireless earphones — the Freebuds 2 Pro.</p>",
            "<p>Like all of Huawei’s phones, the Mate 20 range comes with Huawei’s customized Android skin — Emotion UI (<a href=\"https://consumer.huawei.com/en/emui/\">EMUI</a>). It’s certainly not the phone for Android purists, as EMUI is one of the more overtly different Android skins, and some may balk at the iOS-like style added. Still, it has improved greatly over the years, and it’s an operating system we’ve grown to enjoy using.</p>",
            "<p>Surprisingly the Mate 20 and Mate 20 Pro will launch with <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a>‘s version of EMUI already installed. Customized Android skins like EMUI usually come sometime after a major Android release, and it’s surprising that Huawei has managed to launch EMUI 9 so fast when <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">other manufacturers are lagging behind</a>.</p>",
            "<p>Like Android 9 Pie, EMUI 9 has seen some major changes and tune-ups. Settings have been hidden away to reduce the complexity of the system, and more intuitive touch settings have been added to make controlling the phone much easier than before. It’s faster, too — Huawei says starting an app has been sped up by up to 51 percent, while smoothness inside apps has been boosted by 42 percent. Huawei’s throwing shade, too, claiming that the Mate 20 range is 400 ms faster on average than the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Galaxy Note 9</a> at starting an app.</p>",
            "<p>Huawei’s also worked hard to reduce the level at which the Mate 20 range will slow down over time. Entropy is a fact of life, but the struggle against it is what defines life — and by that barometer, Huawei has done a terrific job in reducing the rate at which a phone slows as it ages. While it’s impossible to prove in practice until the phones have been out for some time, Huawei’s simulations say that the Mate 20 should only slow down 5 percent after 18 months. By comparison, Huawei’s simulations claim the Note 9 will slow by 28 percent in the same period.</p>",
            "<p>Huawei’s desktop mode will also be making a comeback in the Mate 20 range, so you’ll be able to plug your phone into a display to get a PC-like experience. An improved <a href=\"https://www.digitaltrends.com/mobile/huawei-honor-gpu-turbo-news/\">GPU Turbo</a> 2.0 mode is also included, which should boost gaming performance even further, and Huawei boasts of 22 percent higher stability and 14 percent more power efficiency compared to the same games on the Galaxy Note 9. A lot of <a href=\"https://www.digitaltrends.com/mobile/best-and-worst-features-android-9-pie/\">Android 9.0 Pie’s biggest features</a> will also be available, including Digital Wellbeing and Wind-Down mode.</p>",
            "<p>The Huawei P20 Pro is one of the world’s <a href=\"https://www.digitaltrends.com/mobile/best-camera-phones/\">best camera phones</a>, and we’re expecting that the Mate 20 and Mate 20 Pro will strongly follow Huawei’s reputation for high-quality photography.</p>",
            "<p>As mentioned earlier, you’ll find three Leica lenses on the back of the Mate 20 and Mate 20 Pro — a wide-angle lens, an ultra wide-angle lens, and a telephoto lens. However, you’ll find different tech depending on which phone you pick up.</p>",
            "<p>The Mate 20’s triple-camera system is comprised of a 16-megapixel ultra wide-angle lens with an f/2.2 aperture, a 12-megapixel wide-angle lens with an f/1.8 aperture, and an 8-megapixel 2-times telephoto zoom lens with optical image stabilization (OIS), and an f/2.4 aperture. The Pro model sports some bigger numbers, with a 40-megapixel wide-angle lens with an f/1.8 aperture, a 20-megapixel ultra wide-angle lens with an f/2.2 aperture, and an 8-megapixel 3-times telephoto zoom lens with OIS and an f/2.2 aperture.</p>",
            "<p>It’s a similar set-up to the one we saw in the P20 Pro, with the exception that the pure monochrome lens has been dropped in favor of an ultra wide-angle lens. According to Huawei, the monochrome data was being used less than it expected, so the dedicated lens was dropped. But don’t worry, monochrome is still available as a software feature. The new ultra wide-angle lens offers a great focal length for macro shots as well as with wider viewing angles, so it’s likely Huawei’s made a strong change here.</p>",
            "<p>A.I. is central to the performance of the Mate 20 range’s camera, and Huawei has pushed the boundaries even further. Named the “Thinking Lens”, A.I. will be able to control even more aspects of your camera, making it even easier for you to get great shots. While you can still manually swap between lenses, the A.I. will be able to automatically swap to the ultra wide-angle lens when it thinks it’s needed. A.I. will also be able to recognize the primary object in a camera to keep it in focus, and will be able to apply cinematic effects with A.I. — like a Sin City-esque effect that keeps people in color, but shifts the surroundings to black and white.</p>",
            "<p>You’ll find the same 24-megapixel selfie lens in the front of each phone, but the Mate 20 Pro also comes with a much-improved face unlocking feature that uses 3D depth-sensing tech like the iPhone XS. The larger notch on the Mate 20 Pro houses a huge amount of new tech to enable this, including an infrared camera, dot projector, and time-of-flight proximity sensors. The already snappy unlocking speed has also been increased, and it will also recognize you if you’re wearing a hat, or have spontaneously grown a beard. You’ll also be able to use your face to access your new Huawei Password Vault, which stores passwords for your apps similar to Google’s Autofill.</p>",
            "<p>Huawei is also continuing its partnership with Porsche, and is launching a super-premium version of the Mate 20 Pro with Porsche’s branding.</p>",
            "<p>You’ll still find the same Kirin 980 processor inside the special Porsche branded Mate 20 Pro, but you’ll also find 8GB of RAM, and you’ll also get the choice between models with 256GB and 512GB of onboard storage. The in-display fingerprint sensor from the Mate 20 Pro is included, and so is the advanced 3D sensing face recognition. The Mate 20 Pro’s triple-lens camera is there, too, but the battery has seen a decrease to a smaller 2,940mAh capacity.</p>",
            "<p>There’s a bigger difference on the outside of this device though. The all-glass design of the Mate 20 Pro is out — instead, the Porsche Design Huawei Mate 20 RS has a central racing stripe of glass, flanked by soft and luxurious artisan leather. This leather adds grip to the device, and a super-premium feel. It’s an utterly gorgeous device — but it has a price tag to match. The 8GB/256GB model starts at an eye-watering 1,695 euros (around $1,970), and rises to 2,095 euros (roughly $2,430) for the 8GB/512GB model.</p>",
            "<p>The Huawei Mate 20 and Mate 20 Pro is now available in the European Union, the U.K., and from Huawei’s website. The Mate 20 will start from 799 euros (roughly $930), while the Mate 20 Pro is more expensive, coming in at 1,049 euros (roughly $1,220). The supersized Mate 20 X will set you back 899 euros (roughly $1,050).</p>",
            "<p>Unfortunately, Huawei won’t be selling any of the variants of the device in the U.S.</p>",
            "<p><em>Updated on January 3, 2019: The Huawei Mate 20 Pro may be getting a red and blue variant for Chinese New Year.<br>\n</em></p>"
        ]
    },
    {
        "title": "\n\t\tCommon Huawei Mate 20 Pro problems, and how to fix them\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p>You’ve got your new <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">Huawei Mate 20 Pro</a> in your hands, but there’s something you’re not sure about or an issue that just doesn’t seem right. You may not be alone and your Mate 20 Pro may have a gremlin or two inside. Here’s our roundup of problems being reported regarding Huawei’s otherwise very impressive phone.</p>",
            "<p>Multiple cases of people complaining their phone screens have taken on <a href=\"https://www.gsmarena.com/huawei_responds_to_the_mate_20_pros_screen_light_bleeding_issue-news-34037.php\" target=\"_blank\" rel=\"noopener\">a green tint</a>, that only gets worse, have shown up online since the phone launched. Often most noticeable against a dark wallpaper or in low-light conditions, the green tint spreads from where the side of the phone curves and can extend over the top of the display.</p>",
            "<p>Currently, Huawei has not issued an official statement on the situation, which has affected other manufacturer’s phones in the past, although we have reached out to the company on the situation.  A post on the <a href=\"https://uk.community.huawei.com/mate-20-series-20/mate-20-pro-green-edges-on-screen-679/index3.html#post3367\" target=\"_blank\" rel=\"noopener\">Huawei Community forum</a> unofficially suggested affected users contact an authorized service center for assistance.</p>",
            "<p>New technology can often be problematic, and while the Mate 20 Pro’s in-display fingerprint sensor is one of the better ones, it’s not perfect, and can become less reliable over time. If your fingerprint sensor is taking a few tries to unlock the phone, when it used to only take one, the best thing to do is re-register your fingerprint.</p>",
            "<p>The Huawei Mate 20 Pro has a notch at the top of the screen, and the available display either side of it is not very big, leaving room only for the permanent icons such as battery, time, network signal, Bluetooth, and NFC. App and other <a href=\"https://uk.community.huawei.com/mate-20-series-20/mate-20-pro-emui9-issues-bugs-dislikes-feature-requests-673#post3638\" target=\"_blank\" rel=\"noopener\">notifications do not often appear</a>. Turning off the notch under Settings will not cure this problem.</p>",
            "<p>Artificial intelligence has been used to enhance still photos on Huawei phones for a while, and the Mate 20 Pro adds A.I. features to video as well. It’s possible to blur the background, isolate a particular color on screen or even add live filters to the footage. If your Mate 20 Pro doesn’t have these features, you may be running an out-of-date version of the firmware.</p>",
            "<p>Those are all the problems we’ve seen frequently reported with the Huawei Mate 20 Pro so far, but if others show up we will add them to the list, and help out with possible solutions, too.</p>"
        ]
    }
]