[
    {
        "title": "\n\t\tHuawei Mate 20 Pro vs. Huawei Mate 10 Pro: How much better is the new flagship?\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>Huawei has finally unveiled the all-new Huawei Mate 20 series, including the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">flagship Mate 20 Pro</a>. The new device boasts top-tier specs, an excellent design, and a number of exciting new technologies — including an in-display fingerprint sensor.</p>",
            "<p>But the Huawei Mate 20 Pro has big shoes to fill. Last year’s Mate 10 Pro was also much-loved, boasting excellent specs and a great design. Can the new Mate in town take out the older Mate 10 Pro? We put the two phones head-to-head to find out.</p>",
            "<p>As you might expect, the Huawei Mate 20 Pro is clearly a better performer than the older Huawei Mate 10 Pro — thanks largely to an upgraded processor. While the Mate 10 Pro features Huawei’s own Kirin 970 processor, the Mate 20 Pro steps things up with a <a href=\"https://www.digitaltrends.com/mobile/huawei-kirin-980-news/\">newer-generation Kirin 980</a>, which is around 20 percent faster and 40 percent more power efficient than the older chip. That’s not to say that the Kirin 970 isn’t a great chipset — it is — but the Kirin 980 is clearly a better performer. In the Mate 10 Pro, the processor is coupled with either 4GB or 6GB of RAM, along with either 64GB or 128GB of storage, while the Mate 20 Pro sticks with 6GB of RAM and 128GB of storage.</p>",
            "<p>The battery inside the Mate 10 Pro was already a great performer, coming in at 4,000mAh — but the Mate 20 Pro takes it up a notch to 4,200mAh. Now, that doesn’t necessarily mean that the phone will last longer on a charge, especially considering the larger, higher-resolution display. Still, it does bode well for a long battery life. Batteries can be charged a few different ways depending on the phone. On the Mate 20 Pro, you’ll enjoy wireless charging support, as well as Huawei’s own “Super Charge 2.0,” which is a 40W charging system that should charge the phone to 70 percent in just 30 minutes. The Mate 10 Pro doesn’t have wireless charging, and offers the original Huawei Super Charge, which will charge to around 55 percent in 30 minutes.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>The Huawei Mate 20 Pro features a modern design thanks to its edge-to-edge display and all-glass build. It does have a notch, which may not please all Android fans, but it’s not an overly deep or pronounced notch — like the one on the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-xl-review/\">Google Pixel 3 XL</a> — meaning that it’ll be easy to forget about. The display on the device comes in at 6.4 inches.</p>",
            "<p>The Mate 10 Pro may not look quite as modern as the newer phone, but it’s still not a bad-looking device. There’s a small forehead and chin on the phone, but they’re easy to ignore.</p>",
            "<p>When it comes to durability, the phones are very similar. Both phones feature a glass build, despite the Mate 10 Pro not offering wireless charging. The main difference, of course, is the water resistance — the Mate 10 Pro has a rating of IP67, while the Mate 20 Pro steps things up to IP68.</p>",
            "<p>The Mate 20 Pro features a more modern design and is slightly more durable. It’s the clear winner.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>When it comes to display, it’s another easy win for the newer phone. Both the Huawei Mate 10 Pro and the Mate 20 Pro feature AMOLED displays. However, while the display on the Mate 10 Pro comes in at 6 inches with a resolution of 2,160 x 1,080 pixels for a pixel density of 402 pixels-per-inch, the Mate 20 Pro is a serious upgrade with s 6.4-inch display, 3,120 x 1,440 resolution, and 538 pixels-per-inch pixel density. That makes the Mate 20 Pro’s display one of the best on the market.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>The Huawei Mate 10 Pro had one of the best smartphone cameras available at its time of release, boasting a dual-sensor setup with one 12-megapixel sensor and one 20-megapixel monochrome sensor, both with an aperture of f/1.6. Other features include optical image stabilization, laser autofocus, and more. We found that in the real world, the camera was pretty spectacular too — photos were crisp and detailed, while colors were nice and vibrant.</p>",
            "<p>The Mate 20 Pro, of course, aims to improve on this. The new device features three sensors instead of two, including one 40-megapixel main sensor with an f/1.8 aperture, one 20-megapixel wide-angle sensor with an aperture of f/2.2, and one 8-megapixel telephoto lens with an aperture of f/2.4. On the front, you’ll find a 24-megapixel sensor. The Mate 20 Pro’s camera performs extremely well, and it’s definitely more versatile than the camera in its predecessor.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>Both the Mate 10 Pro and Mate 20 Pro are Android phones, and they feature Huawei’s Android skin, EMUI. The Mate 10 Pro ships with Android 8.0 Oreo, though an update to Android 9.0 Pie has started rolling out. The Mate 20 Pro, on the other hand, ships with <a href=\"https://www.digitaltrends.com/mobile/android-9-pie-review/\">Android 9.0 Pie</a> — so it’s relatively up to date.</p>",
            "<p>Huawei isn’t known for for updating phones quickly, which may be frustrating for those who like to get new Android features as soon as they become available. If that’s you, then perhaps you’re better off with a <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Pixel phone</a>.</p>",
            "<p>EMUI may also not be for everyone. Icons are a little different, and there are a range of tweaks to <a href=\"https://www.digitaltrends.com/mobile/huawei-emui-9-interview/\">how the software works</a>, which might be a little confusing for a first-time Huawei user.</p>",
            "<p>The software experience on these phones is going to be very similar, but given the fact that the Huawei Mate 20 Pro is newer, and therefore expected to be supported with updates for longer, it’s the winner here.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>Both the Huawei Mate 10 Pro and the Huawei Mate 20 Pro feature Huawei’s own Neural Processing Unit, or NPU — however the one in the Mate 20 Pro is likely to be faster and more powerful. On top of that, the Mate 20 Pro offers features like a new Face ID-like facial-recognition system and an in-display fingerprint sensor, helping it win this category.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>The Huawei Mate 10 Pro has been out for a year now and has been discounted a few times. Right now, you can get one on Amazon for $500. The Mate 20 Pro, on the other hand, is brand-new — so expect flagship phone pricing. The device isn’t actually coming to the U.S., but in Europe it’ll be available starting at 1,049 euros, which equates to around $1,220.</p>",
            "<p>No surprises here — the Huawei Mate 20 Pro is clearly the better phone. It offers better performance, better design, a better display, and a better camera too. That’s not to say that the Mate 10 Pro isn’t a great device — in fact, of these two phones, it might be the only option available to you, due to the fact that the Mate 20 Pro isn’t coming to the U.S. The older phone is also potentially less than half the price. But if you do have a choice between the two and don’t mind spending the extra cash, we definitely recommend buying the Mate 20 Pro.</p>"
        ]
    },
    {
        "title": "\n\t\tHuawei Mate 20, Pro, and X: Everything you need to know\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Huawei is on a roll. The Chinese company produced the hit <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">Huawei P20 Pro</a> smartphone at the start of 2018, which earned praised for its excellent camera and beautiful design. But Huawei’s not done yet, and it ended the year by revealing the Huawei Mate 20 range. The Mate 20, Mate 20 Pro, and Mate 20 X follow the impressive <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-lite-review/\">Mate 20 Lite</a> and introduce Huawei’s latest hardware and beautiful design.</p>",
            "<p>Here’s everything you need to know about the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-review/\">Huawei Mate 20</a>, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">Mate 20 Pro</a>, and the supersized Mate 20 X.</p>",
            "<p>The west may have celebrated New Year already, but it’s not due in China until February — and there <a href=\"https://www.gsmarena.com/huawei_plan_launch_red_mate_20_pro-news-34880.php\">might be</a> <a href=\"https://www.droidshout.com/huawei-mate-20-pro/\">two new editions</a> of the Huawei Mate 20 Pro to celebrate it. According to <a href=\"https://news.mydrivers.com/1/609/609677.htm\">MyDrivers</a>, a special Fragrant Red and Comet Blue Mate 20 Pro have been spotted on Chinese microblogging site Weibo. An image has been leaked of the Fragrant Red option, but the only apparent evidence of the Comet Blue variant is apparently from source code. Still, Chinese companies love to celebrate Chinese New Year, so it’s likely we’ll see at least one of these new colors launched in China come February.</p>",
            "<p>The Huawei Mate 20 is clearly one of the best Android phones of the year — but unfortunately it’ll be very hard to get the device for yourself if you live in the U.S. The news comes from a <a href=\"https://www.businessinsider.com/huawei-mate-20-mate-20-pro-unavailable-us-spying-fears-2018-10?op=1\" rel=\"noopener\">report from Business Insider</a> in which a Huawei spokesperson confirmed that the company won’t be selling the device in the U.S. If you <em>really</em> want the phone, it’s possible you might be able to find it through some online retailers — but given the fact that the U.S. sometimes uses different network frequencies and technologies, you’ll want to carefully check on network compatibility before you buy.</p>",
            "<p>Huawei’s designs have always been in line with the latest mobile trends, and the Mate 20, Mate 20 Pro, and Mate 20 X are no different. You’ll find glass with gently curving sides laid over solid aluminum frames, and notches cut into both displays — but there are some fairly significant differences between Huawei’s latest flagships and 2018’s biggest trends.</p>",
            "<p>The most obvious change from the norm is the placement of the camera lenses on the back of the phone. While the use of three lenses is becoming more commonplace, having been introduced in Huawei’s own <a href=\"https://www.digitaltrends.com/photography/huawei-p20-pro-camera-tips/\">P20 Pro</a>, and continued in the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v40-thinq-review/\">LG V40 ThinQ,</a> it’s the positioning of the lenses that is now more interesting than the number. Rather than a horizontal or vertical line, the Huawei Mate 20 series’ three lenses are formed into a 2-by-2 box along with the camera’s flash unit as the fourth member, forming a distinctive square. In a world where flagship phones are looking startlingly similar, this simple change makes the Mate 20 range stand out from the crowd.</p>",
            "<p>The glass on both phones has also seen some changes. While both phones still sport Huawei’s magical color-changing glass backs, a “featherline” pattern has been added to both phones. This pattern helps to decrease the visual impact of greasy fingerprints on the back of the phones — hopefully ending this common scourge of glass phones. Huawei has also added an extra layer to the back as well, something referred to as “vinyl tactility.” This layer increases grip significantly on the back of the phone, while still permitting the phone to retain the premium feel of pure glass.</p>",
            "<p>Flip the two phones over and you’ll find some differences to set them apart from one another. The Mate 20 is equipped with a tiny Dewdrop notch cut into a 6.53-inch RGBW HDR display, running a 2244 x 1080 resolution in an 18.7:9 aspect ratio. The Mate 20 Pro is a slightly smaller phone, but rocks an impressive 6.39-inch curved OLED display, running a 3,120 x 1,440 resolution in a 19.5:9 aspect ratio. The Pro model also sports a notch, but it’s cut much wider to accommodate an advanced 3D depth-sensing array built into the front of the phone. The Mate 20 X is the largest of the three phones by a significant margin. It’s equipped with a huge 7.2-inch HDR display, and emulates the look of the Mate 20, complete with Dewdrop notch.</p>",
            "<p>You’ll find a fingerprint sensor on the back of the Mate 20 — but it’s missing on the Mate 20 Pro. Instead, Huawei has incorporated fingerprint scanning tech into that phone’s OLED display. This is definitely the mobile world’s next major advance, and it’s the first time we’ve seen Huawei put it into one of its mainstream phones. Huawei first tested out the tech in the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/porsche-design-huawei-mate-rs-review/\">Porsche Design Huawei Mate RS</a>, and it’s been revamped since that first buggy release.</p>",
            "<p>Only the Mate 20 Pro should be able to survive a slip into the pool, with IP68-rated water-resistance. The Mate 20 is only rated at IP54, and the Mate 20 X is rated for IP53, and can only withstand splashes. As a modern flagship phone, the Mate 20 Pro lacks a headphone jack, while the venerable port is still present on the less advanced Mate 20 and Mate 20 X.</p>",
            "<p>The Mate 20 series phones will be available in five colors from release — Black, Twilight, Midnight Blue, Emerald Green, and Pink Gold.</p>",
            "<p>While Huawei eschews the year’s usual Snapdragon 845 processor for its flagship phones, its own proprietary Kirin processors have usually kept up with the curve, providing great performance.</p>",
            "<p>The Mate 20 series presents the first Huawei phones to feature the new Kirin 980, the next advance of Huawei’s processor tech. It’s an eight-core processor, and Huawei’s first built on the 7-nanometer process — basically, it’s super-small. The 980 consists of four little cores that handle low-intensity tasks, two middle cores for more demanding tasks, and two advanced cores that will blast through the most demanding of apps and games. Huawei claims this new processor boosts speed by 20 percent and power efficiency by 40 percent when compared to the older Kirin 970.</p>",
            "<p>But it’s not just about raw power. Huawei is continuing its drive toward <a href=\"https://www.digitaltrends.com/mobile/huawei-ai-kirin-970-npu/\">an A.I.-powered future</a>, and has included two neural processing units (NPUs) inside the heart of the Kirin 980. The Kirin 970 also boasted a single one of these cores, but Huawei claims that these two newer NPUs outstrip the older NPU by 134 percent in performance, and 88 percent in power efficiency. Thanks to this massively boosted capacity, the Mate 20 range will do an awful lot more in the NPU, with support for real-time image processing, and object recognition and segmentation — not only in photos, but also in video.</p>",
            "<p>You’ll get the choice between 4GB of RAM and 6GB on the Mate 20, while the Mate 20 Pro and Mate 20 X will ship with 6GB as standard. Regardless of which model you pick, you’ll be getting 128GB of onboard storage — with the option of boosting that by up to 256GB via expandable storage. However, it’s not like regular MicroSD expansion — Huawei is pushing a new proprietary nano memory card for some reason, so your trusty old MicroSD won’t work.</p>",
            "<p>You’ll find huge batteries backing up these powerful phones. The Mate 20 comes with a 4,000mAh battery, while the Mate 20 Pro goes one better with a 4,200mAh battery. We’ve seen incredible two-day battery life from past Huawei flagships, and we’re expecting similar performance from both of these.</p>",
            "<p>The Mate 20 X takes it even further, with a massive 5,000mAh battery to power the huge 7.2-inch display. The Mate 20 X also comes with an innovative new cooling system that uses a combination of graphene film and a vapor chamber to funnel heat away from the battery and CPU — which means the Mate 20 X should be able to keep on ticking without dropping performance or damaging the phone’s internals.</p>",
            "<p>Huawei’s SuperCharge fast charging is back, too, and Huawei claims the 40W charger included with the Mate 20 Pro will charge up to 70 percent battery in just 30 minutes. The Mate 20 and Mate 20 X come with a lower powered 22.5W charger, but we’re still expecting incredibly fast charging. For comparison, the iPhone XS ships <a href=\"https://www.digitaltrends.com/mobile/how-to-fast-charge-your-iphone/\">with a 5W charger</a>, giving you an idea of how powerful these chargers are.</p>",
            "<p>You’ll get 15W fast wireless charging support for both phones, which Huawei claims is 200 percent faster than wireless charging on an iPhone X. There’s even more impressive tech included in the Mate 20 Pro though — it will be able to wirelessly charge other wireless charging devices. This feature has been rumored to work with an upcoming pair of Huawei wireless earphones — the Freebuds 2 Pro.</p>",
            "<p>Like all of Huawei’s phones, the Mate 20 range comes with Huawei’s customized Android skin — Emotion UI (<a href=\"https://consumer.huawei.com/en/emui/\">EMUI</a>). It’s certainly not the phone for Android purists, as EMUI is one of the more overtly different Android skins, and some may balk at the iOS-like style added. Still, it has improved greatly over the years, and it’s an operating system we’ve grown to enjoy using.</p>",
            "<p>Surprisingly the Mate 20 and Mate 20 Pro will launch with <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a>‘s version of EMUI already installed. Customized Android skins like EMUI usually come sometime after a major Android release, and it’s surprising that Huawei has managed to launch EMUI 9 so fast when <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">other manufacturers are lagging behind</a>.</p>",
            "<p>Like Android 9 Pie, EMUI 9 has seen some major changes and tune-ups. Settings have been hidden away to reduce the complexity of the system, and more intuitive touch settings have been added to make controlling the phone much easier than before. It’s faster, too — Huawei says starting an app has been sped up by up to 51 percent, while smoothness inside apps has been boosted by 42 percent. Huawei’s throwing shade, too, claiming that the Mate 20 range is 400 ms faster on average than the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Galaxy Note 9</a> at starting an app.</p>",
            "<p>Huawei’s also worked hard to reduce the level at which the Mate 20 range will slow down over time. Entropy is a fact of life, but the struggle against it is what defines life — and by that barometer, Huawei has done a terrific job in reducing the rate at which a phone slows as it ages. While it’s impossible to prove in practice until the phones have been out for some time, Huawei’s simulations say that the Mate 20 should only slow down 5 percent after 18 months. By comparison, Huawei’s simulations claim the Note 9 will slow by 28 percent in the same period.</p>",
            "<p>Huawei’s desktop mode will also be making a comeback in the Mate 20 range, so you’ll be able to plug your phone into a display to get a PC-like experience. An improved <a href=\"https://www.digitaltrends.com/mobile/huawei-honor-gpu-turbo-news/\">GPU Turbo</a> 2.0 mode is also included, which should boost gaming performance even further, and Huawei boasts of 22 percent higher stability and 14 percent more power efficiency compared to the same games on the Galaxy Note 9. A lot of <a href=\"https://www.digitaltrends.com/mobile/best-and-worst-features-android-9-pie/\">Android 9.0 Pie’s biggest features</a> will also be available, including Digital Wellbeing and Wind-Down mode.</p>",
            "<p>The Huawei P20 Pro is one of the world’s <a href=\"https://www.digitaltrends.com/mobile/best-camera-phones/\">best camera phones</a>, and we’re expecting that the Mate 20 and Mate 20 Pro will strongly follow Huawei’s reputation for high-quality photography.</p>",
            "<p>As mentioned earlier, you’ll find three Leica lenses on the back of the Mate 20 and Mate 20 Pro — a wide-angle lens, an ultra wide-angle lens, and a telephoto lens. However, you’ll find different tech depending on which phone you pick up.</p>",
            "<p>The Mate 20’s triple-camera system is comprised of a 16-megapixel ultra wide-angle lens with an f/2.2 aperture, a 12-megapixel wide-angle lens with an f/1.8 aperture, and an 8-megapixel 2-times telephoto zoom lens with optical image stabilization (OIS), and an f/2.4 aperture. The Pro model sports some bigger numbers, with a 40-megapixel wide-angle lens with an f/1.8 aperture, a 20-megapixel ultra wide-angle lens with an f/2.2 aperture, and an 8-megapixel 3-times telephoto zoom lens with OIS and an f/2.2 aperture.</p>",
            "<p>It’s a similar set-up to the one we saw in the P20 Pro, with the exception that the pure monochrome lens has been dropped in favor of an ultra wide-angle lens. According to Huawei, the monochrome data was being used less than it expected, so the dedicated lens was dropped. But don’t worry, monochrome is still available as a software feature. The new ultra wide-angle lens offers a great focal length for macro shots as well as with wider viewing angles, so it’s likely Huawei’s made a strong change here.</p>",
            "<p>A.I. is central to the performance of the Mate 20 range’s camera, and Huawei has pushed the boundaries even further. Named the “Thinking Lens”, A.I. will be able to control even more aspects of your camera, making it even easier for you to get great shots. While you can still manually swap between lenses, the A.I. will be able to automatically swap to the ultra wide-angle lens when it thinks it’s needed. A.I. will also be able to recognize the primary object in a camera to keep it in focus, and will be able to apply cinematic effects with A.I. — like a Sin City-esque effect that keeps people in color, but shifts the surroundings to black and white.</p>",
            "<p>You’ll find the same 24-megapixel selfie lens in the front of each phone, but the Mate 20 Pro also comes with a much-improved face unlocking feature that uses 3D depth-sensing tech like the iPhone XS. The larger notch on the Mate 20 Pro houses a huge amount of new tech to enable this, including an infrared camera, dot projector, and time-of-flight proximity sensors. The already snappy unlocking speed has also been increased, and it will also recognize you if you’re wearing a hat, or have spontaneously grown a beard. You’ll also be able to use your face to access your new Huawei Password Vault, which stores passwords for your apps similar to Google’s Autofill.</p>",
            "<p>Huawei is also continuing its partnership with Porsche, and is launching a super-premium version of the Mate 20 Pro with Porsche’s branding.</p>",
            "<p>You’ll still find the same Kirin 980 processor inside the special Porsche branded Mate 20 Pro, but you’ll also find 8GB of RAM, and you’ll also get the choice between models with 256GB and 512GB of onboard storage. The in-display fingerprint sensor from the Mate 20 Pro is included, and so is the advanced 3D sensing face recognition. The Mate 20 Pro’s triple-lens camera is there, too, but the battery has seen a decrease to a smaller 2,940mAh capacity.</p>",
            "<p>There’s a bigger difference on the outside of this device though. The all-glass design of the Mate 20 Pro is out — instead, the Porsche Design Huawei Mate 20 RS has a central racing stripe of glass, flanked by soft and luxurious artisan leather. This leather adds grip to the device, and a super-premium feel. It’s an utterly gorgeous device — but it has a price tag to match. The 8GB/256GB model starts at an eye-watering 1,695 euros (around $1,970), and rises to 2,095 euros (roughly $2,430) for the 8GB/512GB model.</p>",
            "<p>The Huawei Mate 20 and Mate 20 Pro is now available in the European Union, the U.K., and from Huawei’s website. The Mate 20 will start from 799 euros (roughly $930), while the Mate 20 Pro is more expensive, coming in at 1,049 euros (roughly $1,220). The supersized Mate 20 X will set you back 899 euros (roughly $1,050).</p>",
            "<p>Unfortunately, Huawei won’t be selling any of the variants of the device in the U.S.</p>",
            "<p><em>Updated on January 3, 2019: The Huawei Mate 20 Pro may be getting a red and blue variant for Chinese New Year.<br>\n</em></p>"
        ]
    },
    {
        "title": "\n\t\tForget 3 being a crowd, 4 is the magic number on the Huawei P30 Pro\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p>The replacement to Huawei’s successful P20 and P20 Pro will likely come during the first few months of 2018, and rumors about the device’s new features are starting to leak. <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">The P20 Pro</a> was a trendsetter when it launched in March 2018, introducing the world to a high-performance triple-lens camera system with a night mode, plus the now more widespread gradient color scheme. What will the sequel bring? Here’s what we know so far.</p>",
            "<p>The standout feature on the P-Series has always been the camera, and the P20 Pro set the bar for others to beat in 2018. The P30 is highly likely to add another camera lens to the setup, taking it from three to four, according to Huawei Europe boss Walter Ji, who said <a href=\"https://www.androidpit.de/quad-kamera-5g-flagship-stores-huaweis-plaene-fuer-2019\" target=\"_blank\" rel=\"noopener\">in an interview</a>, “Next year we will definitely see more innovation in the camera. Now we have three, imagine four next year.” He also commented on a greater zoom capability, potentially up to 10x. However, that fourth lens may not be used for photography. Instead, the fourth sensor <a href=\"https://www.slashgear.com/huawei-p30-leak-hints-at-an-oxymoronic-design-25559144/\">may be a Time-of-Flight sensor</a> (ToF) usually used for AR/VR mapping. Take this with a pinch of salt at the moment though, and wait to see what the other serial leakers find out in the coming months.</p>",
            "<p>Huawei has been linked to Sony for the P30, and according to this rumor may use the <a href=\"https://www.gizmochina.com/2018/12/12/38mp-sony-imx607-sensor-details-leaked-boasts-exceptional-low-light-performance-and-may-appear-first-in-the-huawei-p30-pro/\" target=\"_blank\" rel=\"noopener\">forthcoming IMX607 sensor</a>, which may add a 38-megapixel sensor to the phone. Huawei’s own <a href=\"https://www.digitaltrends.com/mobile/huawei-nova-4-news/\">Nova 4</a> and <a href=\"https://www.digitaltrends.com/mobile/honor-view-20-news/\">Honor’s View 20</a> both have 48-megapixel sensors.</p>",
            "<p>What will the P30 or P30 Pro look like? A series of cases for the P30 Pro model have been spotted for sale through online retailer <a href=\"https://www.mobilefun.com/huawei/p30-pro/cases\" target=\"_blank\" rel=\"noopener\">MobileFun</a> which may give us a hint. The rear of the phone may once again have a series of camera lenses running down the left side, but this time there may be four rather than three.</p>",
            "<p>There is no sign of a fingerprint sensor on the front or back of the phone, indicating the in-screen fingerprint sensor from the Mate 20 Pro will come to the P30 Pro. The screen has a teardrop-style notch at the top, much like the Mate 20. This is surprising, as the Pro versions of Huawei phones often have more complex face recognition systems requiring a larger notch. It’s possible this is speculation on the part of case maker Olixar, which may only have dimensions for the phone’s body rather than final renders of the full design.</p>",
            "<p>Olixar’s case is not the only one that has been spotted. A case for the <a href=\"https://twitter.com/UniverseIce/status/1072718083989487616\" target=\"_blank\" rel=\"noopener\">non-Pro P30 was leaked</a> with a slightly different design, showing an elongated camera cutout on the left, and a further section underneath. It’s not clear why this is separate. The <a href=\"https://www.mobilefun.com/huawei/p30/cases\" target=\"_blank\" rel=\"noopener\">Olixar P30 case</a> seems to combine the second cutout into one single larger cutout. The P30 Pro case in the Twitter leak from Ice Universe closely matches the Olixar case’s look.</p>",
            "<p>No specific details have leaked about the Huawei P30 or P30 Pro’s other features. However, it’s almost certain the phone will use the Kirin 980 processor, as Huawei is unlikely to replace it until later in 2019. It’s possible the phone will <a href=\"https://www.androidpit.de/quad-kamera-5g-flagship-stores-huaweis-plaene-fuer-2019\" target=\"_blank\" rel=\"noopener\">have 5G capabilities</a>, according to some rumors; but this may arrive on a modified version of the phone at a later date, with 4G LTE models being released first.</p>",
            "<p>The Huawei P20 Pro was announced in March 2018 at an event in Paris. Huawei may choose to launch the P30 at Mobile World Congress at the end of February 2019, or again decide to hold a separate event shortly afterward.</p>",
            "<p>We will update here with more Huawei P30 and P30 Pro rumors as they come in.</p>",
            "<p><em>Updated on December 27, 2018: We’ve added the latest rumors that the fourth sensor on the P30 may be a Time-of-Flight sensor.</em></p>"
        ]
    },
    {
        "title": "\n\t\tHuawei Mate 20 Pro vs. P20 Pro: Which 2018 Huawei flagship is best for you?\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>It doesn’t seem that long ago that the Huawei P20 Pro burst onto the scene with its stunning twilight finish, upping the ante for smartphone cameras everywhere with a triple lens setup. Yet here we are barely six months later with a new Huawei flagship sailing into view. The Huawei Mate 20 Pro is certainly bigger, but is it better than its predecessor?</p>",
            "<p>At first glance, these phones share a lot of similarities, but we’re about to dig a bit deeper to uncover all the differences and help you choose between them.</p>",
            "<p>The newer Huawei Mate 20 Pro has Huawei’s latest <a href=\"https://www.digitaltrends.com/mobile/huawei-kirin-980-news/\">Kirin 980 processor</a> inside. Huawei claims that it’s 20 percent faster and 40 percent more efficient than the Kirin 970 which graces the P20 Pro. Both phones are available with 128GB of storage and 6GB of RAM or 256GB of storage and 8GB of RAM. Only the Mate 20 Pro allows for storage expansion via a card, but it won’t take any Micro SD card, you will have to spring for one of Huawei’s proprietary NM Cards.</p>",
            "<p>Not only does the Mate 20 Pro have a bigger battery, it also supports much faster charging at up to 40W, giving you 70 percent battery life in just 30 minutes, compared to just over 50 percent for the P20 Pro. Just to seal the deal, the Mate 20 Pro also supports Qi wireless charging which the P20 Pro lacks.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro </strong></p>",
            "<p>Both of these phones have notches at the top of the displays, but the P20 Pro’s is smaller. They also both have bezels at the bottom, though the P20 Pro is starting to show its age with that lozenge-shaped fingerprint sensor, while the Mate 20 Pro has an in-display fingerprint sensor. The sides of the Mate 20 Pro are also more curved. On the back, you will find Huawei’s gorgeous paint job — we especially love the twilight finish — but the P20 Pro’s triple lens camera module definitely looks better than the big square module on the back of the Mate 20 Pro.</p>",
            "<p>Something Huawei has improved is the water resistance, with the Mate 20 Pro scoring an IP68 rating compared to the P20 Pro’s IP67 rating. Both can handle a short dunk without damage, but the Mate 20 Pro can handle slightly deeper water. Neither is going to handle falls well, so you’ll want to look at some <a href=\"https://www.digitaltrends.com/mobile/best-huawei-p20-pro-cases/\">good cases</a>.</p>",
            "<p>We’re going to give the Mate 20 Pro the nod here, but we do think the P20 Pro looks better from the back.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro </strong></p>",
            "<p>You’ll find top-quality AMOLED screens in both of these phones. The P20 Pro has a 6.1-inch display with a 2,240 x 1,080-pixel resolution which translates to 408 pixels-per-inch (ppi). The Mate 20 Pro has a slightly bigger 6.4-inch display with a 3,120 x 1,440-pixel resolution for a pixel density of 538 ppi. The taller display in the Mate 20 Pro isn’t just bigger, it’s also sharper and so it wins this round.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>Huawei has stuck with a triple lens setup on the Mate 20 Pro, just like the P20 Pro, but there are some differences. The Mate 20 Pro has a main lens rated at 40 megapixels with an f/1.8 aperture, with an ultra wide-angle lens with 20 megapixels and an f/2.2 aperture, and a telephoto 8-megapixel lens with an f/2.4 aperture. On paper, the P20 Pro set up looks familiar with 40-megapixel, 20-megapixel, and 8-megapixel lenses, but the <a href=\"https://www.digitaltrends.com/mobile/huawei-mate-20-monochrome-lens-replaced-by-filter/\">monochrome lens we loved so much</a> in the P20 Pro is gone. Huawei has essentially swapped the monochrome lens for a super wide-angle lens and the Mate 20 Pro camera is likely to be more versatile as a result.</p>",
            "<p>Both phones have a 24-megapixel front-facing camera for stunning selfies, but only the Mate 20 Pro offers proper facial scanning and 3D Live Emoji.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>While the P20 Pro launched with Android 8.1 Oreo, Huawei has started to roll out the Android 9.0 Pie update. The Huawei Mate 20 Pro launches with <a href=\"https://www.digitaltrends.com/mobile/android-9-pie-review/\">Android 9.0 Pie</a> on board. Both feature Huawei’s EMUI on top which adds various customization options and extra features. The software experience on these phones is going to be identical and we expect them to continue to get updates for a similar period of time, so there’s no dividing them here.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>Although most of the <a href=\"https://www.digitaltrends.com/mobile/huawei-ai-kirin-970-npu/\">special artificial intelligence features</a> are available on both phones, powered by the dedicated neural processing unit, the newer Mate 20 Pro chip should prove faster and more capable. The Mate 20 Pro also supports much faster charging and a special reverse wireless charging ability that enables it to act as a wireless charger for another phone, though we’re not sure you will want to donate your extra battery life very often. Factor in the FaceID-like, front-facing camera capabilities and the Mate 20 Pro is the clear winner here.</p>",
            "<p><strong>Winner: Huawei Mate 20 Pro</strong></p>",
            "<p>The P20 Pro was never officially released in the U.S. and it would have cost you close to $1,000 to import one when it was first released, but that price has dropped considerably and you can pick one up now for between $700 and $800. By contrast, the new Huawei Mate 20 Pro is going on sale at 1,049 euros, which is a staggering $1,220. There is a chance Huawei will release it stateside in the new year, probably for closer to $1,000, but we can’t say for sure.</p>",
            "<p>It’s more powerful, boasts a bigger screen, faster charging, and a more versatile camera, but the Huawei Mate 20 Pro is also considerably more expensive. The Huawei P20 Pro is still a strong flagship that outperforms many big competitors, so if you’re choosing between these two right now, we wouldn’t blame you for snagging it and saving the difference. If you already have a P20 Pro, the Mate 20 Pro isn’t enough of a jump to merit an upgrade, but it is definitely the better phone.</p>"
        ]
    },
    {
        "title": "\n\t\tCommon Huawei Mate 20 Pro problems, and how to fix them\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p>You’ve got your new <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">Huawei Mate 20 Pro</a> in your hands, but there’s something you’re not sure about or an issue that just doesn’t seem right. You may not be alone and your Mate 20 Pro may have a gremlin or two inside. Here’s our roundup of problems being reported regarding Huawei’s otherwise very impressive phone.</p>",
            "<p>Multiple cases of people complaining their phone screens have taken on <a href=\"https://www.gsmarena.com/huawei_responds_to_the_mate_20_pros_screen_light_bleeding_issue-news-34037.php\" target=\"_blank\" rel=\"noopener\">a green tint</a>, that only gets worse, have shown up online since the phone launched. Often most noticeable against a dark wallpaper or in low-light conditions, the green tint spreads from where the side of the phone curves and can extend over the top of the display.</p>",
            "<p>Currently, Huawei has not issued an official statement on the situation, which has affected other manufacturer’s phones in the past, although we have reached out to the company on the situation.  A post on the <a href=\"https://uk.community.huawei.com/mate-20-series-20/mate-20-pro-green-edges-on-screen-679/index3.html#post3367\" target=\"_blank\" rel=\"noopener\">Huawei Community forum</a> unofficially suggested affected users contact an authorized service center for assistance.</p>",
            "<p>New technology can often be problematic, and while the Mate 20 Pro’s in-display fingerprint sensor is one of the better ones, it’s not perfect, and can become less reliable over time. If your fingerprint sensor is taking a few tries to unlock the phone, when it used to only take one, the best thing to do is re-register your fingerprint.</p>",
            "<p>The Huawei Mate 20 Pro has a notch at the top of the screen, and the available display either side of it is not very big, leaving room only for the permanent icons such as battery, time, network signal, Bluetooth, and NFC. App and other <a href=\"https://uk.community.huawei.com/mate-20-series-20/mate-20-pro-emui9-issues-bugs-dislikes-feature-requests-673#post3638\" target=\"_blank\" rel=\"noopener\">notifications do not often appear</a>. Turning off the notch under Settings will not cure this problem.</p>",
            "<p>Artificial intelligence has been used to enhance still photos on Huawei phones for a while, and the Mate 20 Pro adds A.I. features to video as well. It’s possible to blur the background, isolate a particular color on screen or even add live filters to the footage. If your Mate 20 Pro doesn’t have these features, you may be running an out-of-date version of the firmware.</p>",
            "<p>Those are all the problems we’ve seen frequently reported with the Huawei Mate 20 Pro so far, but if others show up we will add them to the list, and help out with possible solutions, too.</p>"
        ]
    },
    {
        "title": "\n\t\tHere are some common Huawei P20 Pro problems and how to fix them\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>If you’re able to get your hands on one, the Huawei P20 Pro is sure to impress. It has an eye-catching design, a long-lasting battery, and one of the best cameras we’ve ever encountered, featuring an unprecedented three lenses. As impressive as it is, this phone is not perfect and we’re not just talking about the fact that it isn’t on sale in the U.S.</p>",
            "<p>There are a couple of <a href=\"https://forum.xda-developers.com/huawei-p20-pro/help/huawei-p20-pro-issues-t3784256/page3\">threads</a> at the <a href=\"https://forum.xda-developers.com/huawei-p20-pro/help/p20-pro-random-reboot-self-restart-t3804078\">XDA Developers forum</a> that mention unprompted reboots. For one person it was happening repeatedly in the Gallery app, but for others it seems to be a bit more random when it occurs. The P20 Pro will suddenly shut down and restart itself with no apparent cause. This is an issue we’ve seen from time to time on a lot of different phones.</p>",
            "<p><strong>Possible fixes:</strong></p>",
            "<p>We were particularly impressed by the battery life of the Huawei P20 Pro, which boasts a 4,000mAh battery. It should easily last you a day and beyond and two full days between charges is not out of the question. Yet we’ve seen threads at the <a href=\"https://forum.xda-developers.com/huawei-p20-pro/help/p20-pro-battery-issues-t3776618\">XDA Developers forum</a> and <a href=\"https://forums.androidcentral.com/huawei-p20-p20-pro/883730-problem-p20-pro-battery.html\">Android Central forum</a> about disappointing battery performance. The battery is big enough that you shouldn’t really have to bother with workarounds, but we have a few suggestions anyway. We also have an idea about a possible fix.</p>",
            "<p><strong>Workarounds:</strong></p>",
            "<p><strong>Potential fixes:</strong></p>",
            "<p>We’ve seen a couple of posts, most notably at <a href=\"https://forum.xda-developers.com/huawei-p20-pro/help/horrible-touchscreen-latency-lag-delay-t3774567\">XDA Developers forum</a> about touchscreen delays or lag when people are scrolling or trying to do small, precise movements on the screen.</p>",
            "<p><strong>Potential fixes:</strong></p>",
            "<p><strong>Workarounds:</strong></p>",
            "<p>Huawei’s SuperCharge system can take the battery from zero to full in about 90 minutes, but some people have been having trouble getting fast charging speeds. There are a couple of <a href=\"https://forum.xda-developers.com/huawei-p20-pro/help/supercharge-doesnt-t3794969\">threads</a> at <a href=\"https://forum.xda-developers.com/huawei-p20-pro/help/fast-charging-slow-t3775943\">XDA Developers forum</a> about this.</p>",
            "<p><strong>Potential fixes:</strong></p>",
            "<p>We have seen a few people complaining about the microphone not working so they can’t be heard by the other person during calls or sometimes when recording audio or video messages. There are <a href=\"https://forum.xda-developers.com/huawei-p20-pro/help/p20-pro-microphone-issues-t3781114\">threads</a> at <a href=\"https://forum.xda-developers.com/huawei-p20-pro/help/microphone-problem-t3793047\">the XDA Developers forum</a> on this topic.</p>",
            "<p><strong>Workarounds:</strong></p>",
            "<p><strong>Possible fix:</strong></p>"
        ]
    },
    {
        "title": "\n\t\tHuawei’s MateBook X Pro is everything that’s right with modern laptop design\t",
        "author": [
            "\n\t\t\t\t\t\tLuke Larsen\t\t\t\t\t"
        ],
        "text": [
            "<p>At <a href=\"https://www.digitaltrends.com/mwc-2019/\">MWC (Mobile World Congress)</a>, Chinese manufacturer Huawei showed off its new laptop, the <a href=\"https://www.digitaltrends.com/laptop-reviews/huawei-matebook-x-pro-review/\">MateBook X Pro.</a> And now, the laptop has been made available in the U.S. The base model will set you back $1,200, while the more powerful version is $300 more expensive.</p>",
            "<p>The design is stunning, but it’s not a revolutionary. Instead, it’s the fulfillment of a lot of the promises that laptop makers have been building toward for years. In particular, we noticed two trends from other manufacturers that the MateBook X Pro has borrowed, and taken a step further.</p>",
            "<p>The most striking feature of the MateBook X Pro is the bezel — or lack thereof. When the <a href=\"https://www.digitaltrends.com/laptop-reviews/dell-xps-13-2018-review/\">Dell XPS 13 </a>first came out in 2015, we couldn’t have known how big an influence it would have on the future of laptop design. Its shrunken bezels made just about every other laptop on the market feel outdated — in the same way that the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s8-review/\">Galaxy S8</a> did with smartphones years later.</p>",
            "<p>The MateBook X Pro has taken that trend and played it out to its final form, giving us a laptop display that feels nearly edge-to-edge. The bezels around the edges are only 4.4mm on each side, the same as the new Dell XPS 13’s bezels. The difference is that Huawei has also cut the bottom bezels, <a href=\"https://www.digitaltrends.com/computing/matebook-x-webcam-poll/\">moving the webcam off the lid</a> entirely and giving the display a 91-percent screen-to-footprint ratio. The size of the bezels are almost Apple-like in their stubborn symmetry — and this time, not even a notch was necessary.</p>",
            "<p>Not only do those severed bezels make for an awesome viewing experience, they also make room for more pixels. Huawei smartly went with a 3:2 aspect ratio, providing a 3,000 x 2,000 resolution display that feels right on a laptop. Rather than fitting the same-sized screen into a smaller footprint, Huawei went for a larger display into the same overall dimensions. It’s exactly what we wished Dell would have done on the newest XPS 13.</p>",
            "<p>No one’s going to deny that the MateBook X Pro looks eerily similar to the MacBook Pro. It has a metal unibody chassis, a very familiar paint job, and even the exact same placement of its speaker grilles. But copying Apple is not anything new. What Huawei has done differently is borrow the best parts of the MacBook Pro — and diverge in its own interesting way.</p>",
            "<p>While the MateBook X Pro looks like no more than a logo-swap on the back of the lid, inside there’s more going on. Unlike the MacBook Pro, it has a wedge shape, and the edges are slightly more rounded and smooth. That makes it feel smaller and more svelte than the blocky Pro.</p>",
            "<p>The laptop also takes the MacBook Pro’s massive touchpad and plants it on a Windows 10 laptop. There’s more to it than just looks obviously, but clearly it’s something Huawei borrowed from Apple’s playbook. This makes a lot of sense. Microsoft has improved Windows touch gesture support greatly with Windows 10, and it’s now just as useful as MacOS — when paired with a good touchpad.</p>",
            "<p>While the MateBook X Pro takes inspiration from Apple, it’s smart enough to reject what hasn’t worked. Huawei offers a full USB-A port, along with USB-C, and doesn’t waste time or money on a Touch Bar.</p>",
            "<p>Support for discrete graphics doesn’t really play into laptop design — or does it? After all, laptops with discrete graphics cards have come in two variants in the past – large 15-inch laptops, or chunky gaming machines. Neither are conducive for taking your work or play on the go.</p>",
            "<p>This year, though, we’ve seen laptops like the Asus ZenBook 13 UX331UN, which sports the Nvidia MX150 in a super-thin package that you’d never guess could play games at decent framerates. It takes a tremendous amount of design and engineering to fit those kinds of components in a laptop this thin, especially when it comes to keeping it cool. The trend has continued with the MateBook X Pro, which includes the MX150.</p>",
            "<p>Although it doesn’t come in the base model as it does with the ZenBook, Huawei has taken gaming on its laptop a step further by offering support for external GPUs. The inclusion of a Thunderbolt 3 port makes it possible, though many manufacturers block the ability to power up something like an Nvidia GeForce GTX 1080.</p>",
            "<p>Taking the best from Dell and Apple, the MateBook X Pro has taken the promise of thin bezels, unibody design, and powerful graphics to its fullest potential.</p>",
            "<p>The $1,200 model boasts an eighth generation Intel Core i5-8250U processor with integrated graphics, 8GB of RAM, and a 256GB NVMe PCIe SSD. The $1,500 laptop has an eighth generation Intel Core i7-8550U processor, 16 GB of RAM, and 512GB of storage, as well as NVIDIA GeForce MX150 graphics.</p>",
            "<p>You can buy the Matebook X Pro beginning today from <a href=\"https://go.redirectingat.com/?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB07CTKCFFH%2Fref%3Dcm_sw_r_sms_c_api_i_-sSaBbY7HJHJ2\" target=\"_blank\" rel=\"nofollow noopener\">Amazon</a>, <a href=\"https://go.redirectingat.com/?id=66960X1514734&amp;xs=1&amp;url=https%3A%2F%2Fm.newegg.com%2Fproducts%2FN82E16834324032%3FKeyword%3Dhuawei%2520matebook%2520x%2520pro\" target=\"_blank\" rel=\"nofollow noopener\">Newegg</a>, and <a href=\"https://click.linksynergy.com/deeplink?id=nOD%2FrLJHOac&amp;mid=24542&amp;u1=verge&amp;murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fstore%2Fd%2Fhuawei-matebook-x-pro-laptop%2F8n4k86d4j006%2FHB3R%3Factivetab%3Dpivot%253atechspecstab\" target=\"_blank\" rel=\"nofollow noopener\">Microsoft’s website</a>, or in Microsoft Stores if you’re willing to wait a couple more days to May 23. Plus, Huawei is offering a $300 gift card to any store you’d like if you buy the laptop from Amazon or Newegg, or in a physical Microsoft Store.</p>",
            "<p><em>Updated on May 21: The MateBook X Pro is now available in the U.S. beginning at $1,200.</em></p>"
        ]
    },
    {
        "title": "\n\t\tThe Huawei P20: Here’s everything you need to know\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p>Following in the footsteps of last year’s P10, the Huawei P20 brings a lot of exciting new features to the table. This year’s flagship comes in three flavors: The Huawei P20, Huawei P20 Pro, and Porsche Design Huawei Mate RS.</p>",
            "<p>Here are all the details we have about the Huawei P20, and you can read our comprehensive review of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">P20 Pro here</a>, and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/porsche-design-huawei-mate-rs-review/\">Porsche Design Mate RS</a> here.</p>",
            "<p>Is there anything that isn’t improved by being wrapped in leather? Many will have different answers to this, but we’d argue that the smartphone always gets an additional point if it has a leather back. Just look at the amount of leather cases there are in the world, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-g4-review/\">leather-clad LG G4</a>, and numerous <a href=\"https://www.digitaltrends.com/cell-phone-reviews/vertu-aster-review/\">Vertu (RIP) phones</a> for proof. Huawei is the latest to agree, and has added two leather-bound P20 Pro models to the range, and they’re exquisite.</p>",
            "<p>There are two versions. A tan leather matched to a muted gold chassis, and a black leather with an almost gunmetal gray steel chassis. The black version oozes class, but it’s the tan leather model that’s most eye-catching. The leather doesn’t feel thick, and has that wonderfully warm and tactile feeling we expect from the material. It closely follows the contours of the phone, doesn’t bulge at the corners, and generally looks like it was supposed to be there from the start.</p>",
            "<p>The two leather versions are accompanied by two new non-leather colors: A different version of the original P20 Pro twilight color called aurora, and a pearl white. The pearl white is the more interesting of the two, and it gives the phone a softer, less aggressive style. The aurora reverses the color gradient of the twilight — so it shifts from top to bottom, rather than vice versa — and it has a slight rainbow effect in the right light.</p>",
            "<p>We are waiting for any price differences to be confirmed, and also on details of where and when these new colors will be available.</p>",
            "<p>In early June, Huawei president Kevin Ho announced the smartphone giant <a href=\"http://www.scmp.com/tech/china-tech/article/2150630/huaweis-triple-camera-feature-helps-propel-high-end-smartphone-sales\">shipped six million</a> P20 and P20 Pro handsets during their first 10 weeks on the market. This represents an 81 percent increase in shipments during the same period year on year. The company believes its focus on premium handsets and excellent camera equipment — especially the triple-lens P20 Pro — contributed to the remarkable growth in shipments.</p>",
            "<p>The P-Series is usually Huawei’s “fashion-forward” smartphone, with an emphasis on design, and the Huawei P20 is no exception. It features an all-glass case that’s curved on all four sides. The phones have a bezel-less display with an aspect ratio of 18:9. The P20 Pro and Porsche Edition Mate RS feature a triple camera array on the back, while the P20 has a dual-camera setup. All three phones feature a fingerprint sensor that sits at the bottom of the phone.</p>",
            "<p>The P20 and P20 Pro ship in four colors: Black, midnight blue, pink gold, and twilight. While all of the colors are attractive, the twilight model is a showstopper, with a gradient pattern that shifts from purple to teal. The Porsche Edition Huawei Mate RS color options are more limited — black will be available in all markets, while a limited-edition red case will be sold in China.</p>",
            "<p>The Huawei P20 Pro features a 6.1-inch OLED display with a resolution of 2240 x 1080. The Huawei P20 has a 5.8-inch LCD screen with the same resolution. The Porsche Design Huawei Mate RS features a 6-inch OLED screen. And yes, Huawei did decide to go with a top notch on all three phones. It appears to be solely a design choice, as there is a setting that can make the notch disappear by dimming the display around it.</p>",
            "<p>Along with the Mate Series of phones, Huawei’s P Series represents the company’s flagship devices, and therefore are packed with the latest tech. All three models feature the company’s Kirin 970 processor. RAM varies depending on the exact model, with the P20 Pro and Porsche Design Huawei Mate RS packing 6GB of memory each, while the P20 comes in at 4GB. The Kirin processor features Huawei’s Neural Processing Unit (NPU), which does most of the heavy lifting in terms of A.I. tasks.</p>",
            "<p>Both P20 models come with 128 GB of storage, while the Porsche Design Huawei Mate RS comes with a 256GB and 512GB storage option. None of the phones feature a MicroSD slot, so there’s no option for external storage. As for battery capacity, the P20 and Porsche Edition Mate RS feature a hefty 4,000mAh battery, while the P20 comes in at 3,400mAh.</p>",
            "<p>There’s also a significant durability difference between the Huawei P20 and P20 Pro. The <a href=\"https://www.digitaltrends.com/mobile/how-rugged-is-your-phone/\">IP ratings</a> are quite a bit different: The P20 has a shabby IP52 rating, meaning it won’t handle much more than some dust and drops of water, while the Huawei P20 Pro has the more typical IP67 rating we’ve come to expect on phones. The IP rating was not disclosed for the Porsche Design Huawei Mate RS.</p>",
            "<p>The Huawei P20, P20 Pro, and Porsche Edition Huawei Mate RS ship with Android 8.1 Oreo. You’ll find the latest version of EMUI, Huawei’s customer interface, on the phone as well. The EMUI update offers some minor improvements over its predecessor.</p>",
            "<p>Several phones in 2017 featured face unlock, including the iPhone X and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-5t-review/\">OnePlus 5T,</a> and Huawei added a similar feature to the new phones. The face unlock feature on the phones uses 2D mapping to authenticate users in just half a second. Like the iPhone X, the feature will also work in the dark. Unlike the iPhone X, the feature is not secure enough to authorize payments.</p>",
            "<p>Huawei’s phone cameras have been great performers since the company began its partnership with Leica. How will it improve on the P20?  Well, it looks like Huawei added some pretty impressive new hardware and software features to make the camera on the P20 its best yet — and camera sensor testing company DxO Mark confirms that the goal has been met.</p>",
            "<p>First things first: The Huawei P20 Pro and Porsche Design Mate RS are the first phones we’ve seen with a triple camera array. They’re equipped with a 40-megapixel main lens with A.I. Image Stabilization (AIS). The secondary camera comes in at 8 megapixels with Optical Image Stabilization, while the tertiary lens is a 20-megapixel mono lens. Each lens carries a different aperture from f/1.6 to f/2.0, meaning you should be able to get good shots in just about any lighting condition.</p>",
            "<p>The front-facing camera on the Huawei P20 Pro and Porsche Design Huawei Mate RS comes in at 24 megapixels and, like the other lenses, is Leica branded, which bodes well for overall quality. It features an aperture of f/2.0, which is pretty good for a selfie cam, just don’t expect amazing shots in low light.</p>",
            "<p>As for the Huawei P20, you’ll find a dual rear camera array with a 12-megapixel primary lens accompanied by a 20-megapixel monochromatic secondary lens. The primary lens features an aperture of f/1.8 while the mono lens comes in at f/1.6. Like other Huawei phones, the monochrome lens should help users get better shots in low light. You’ll also find the same 24-megapixel Leica-branded camera on the P20 that appears on the P20 Pro.</p>",
            "<p>In addition to hardware, Huawei has added some interesting software features to its newest flagships. The camera relies on A.I. to make image adjustments based on object recognition; while the P10 could discern between 13 different scene-recognition modes, the P20, P20 Pro, and Porsche Design Huawei Mate RS up the ante by identifying 19 different common scenes. A.I. also helps with composition by adding a horizontal line to the viewfinder to ensure the shot is level.</p>",
            "<p>You’ll also find a super slow motion feature on these phones that are similar to what you’d find on the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-plus-review/\">Samsung Galaxy S9 Plus</a>. With super slow motion, you can increase your camera’s frame rate to 960 fps for 0.2 seconds to get a Matrix-like effect.</p>",
            "<p>All that hardware has earned the P20 Pro <a href=\"https://www.dxomark.com/huawei-p20-pro-camera-review-innovative-technologies-outstanding-results/\" rel=\"noopener\">the highest DxO Mark smartphone rating yet</a>, with a score of 109. The plain P20 earns a still high, second-place 102. The DxO champions are getting shorter and shorter times on the throne — the P20 Pro replaces the previous top scorer, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-plus-review/\">Samsung Galaxy S9+</a>, after less than a month. Before that, <a href=\"https://www.digitaltrends.com/photography/google-pixel-2-camera-guide/\">the Google Pixel 2</a> replaced <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">the iPhone X</a> as the top-scoring smartphone camera. DxO credits the P20 and P20 Pros’ larger-than-average sensor, monochrome camera, and triple lens setup for that high score. The difference is so significant that DxO Mark says it looks like “Huawei has skipped one or two generations.”</p>",
            "<p>All three phones are available now. Pricing for the Huawei P20 comes in at 649 euros ($805), while the P20 Pro is available for 899 euros ($1,115). The 256GB version of the Porsche Edition Huawei Mate RS will sell for 1,695 euros ($2,103), while the 512GB variant will go for 2,095 euros ($2,600).</p>",
            "<p><i>Updated on August 31: New P20 Pro colors announced.</i></p>"
        ]
    },
    {
        "title": "\n\t\tHuawei P20 Pro vs. the P20: Which smartphone is the right Huawei to go?\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>The fact that Huawei has repeatedly <a href=\"https://www.digitaltrends.com/mobile/senate-intelligence-committee-huawei-zte-news/\">run into issues</a> trying to <a href=\"https://www.digitaltrends.com/mobile/huawei-att-discussions/\">break into the U.S. market</a> hasn’t stopped the Chinese manufacturer from turning out some very impressive Android smartphones. The Huawei P20 and P20 Pro offer a compelling combination of cutting-edge hardware and software, but there are some big differences between the two. If you’re considering buying one of them, then this comparison will help you get a grasp on where they’re similar and where they diverge.</p>",
            "<p>Dissect either of these phones and you’re going to find Huawei’s own <a href=\"https://www.digitaltrends.com/mobile/huawei-kirin-970-ai-news/\">Kirin 970 processor</a> inside, along with its special Neural Processing Unit (NPU), which is designed to offer all kinds of artificial intelligence (A.I.) enhancements without slowing things down or draining too much power. You get 6GB of RAM in the P20 Pro, while the P20 makes do with 4GB of RAM. Only serious multitaskers will feel the difference. Both phones have 128GB of storage, but there’s no MicroSD card slot.</p>",
            "<p>It’s easier to separate these phones on battery life because the P20 Pro has a 4,000mAh battery, while the battery in the P20 is only rated at 3,400mAh. The P20 Pro has a marginally bigger screen and a few more tricks up its sleeve, but we can’t see that being enough to cancel out the extra capacity, so we expect the P20 Pro to have more stamina than its sibling. There’s no wireless charging here, but you can expect both phones to support Huawei’s SuperCharge fast-charging standard.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/94b3f00b49b0e2f655ecbdc36369621e07b93b6b/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Huawei\">Huawei P20 Pro</a></strong></p>",
            "<p>The all-glass, curved design of these phones is extremely attractive and they come in some interesting finishes, particularly the twilight option, which shifts from purple to teal. Strangely, Huawei has put the fingerprint sensors on the front, in the old traditional spot beneath the screen, but the main thing that jumps out is that notch at the top. We’re not keen on the <a href=\"https://www.digitaltrends.com/mobile/why-are-android-phone-makers-embracing-the-notch/\">notch trend afflicting Android phones</a> right now, but if you’re going to do it, there’s nothing wrong with Huawei’s implementation — the notch in the P20 and P20 Pro is much smaller than the iPhone X’s notch.</p>",
            "<p>There’s nothing to divide these phones on the design front, but if we delve into durability, the P20 Pro is clearly superior. The P20 has a distinctly disappointing IP53 rating, while the P20 Pro scores an IP67 rating. In simple terms, this means that the P20 Pro can survive submersion, but the P20 probably won’t.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/94b3f00b49b0e2f655ecbdc36369621e07b93b6b/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Huawei\">Huawei P20 Pro</a></strong></p>",
            "<p>The Huawei P20 sports a 5.8-inch RGBW LCD screen, while the P20 Pro boasts a 6.1-inch OLED screen. Both of them have a 2,240 x 1,080 pixel screen resolution. Strictly speaking, this makes the P20 screen a touch sharper, but the P20 Pro has a much higher contrast ratio, with rich colors and really deep blacks.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/94b3f00b49b0e2f655ecbdc36369621e07b93b6b/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Huawei\">Huawei P20 Pro</a></strong></p>",
            "<p>The camera war in smartphones has reached new heights recently, as the battle for supremacy has spilled beyond megapixel count and led many manufacturers to adopt secondary lenses. Huawei is taking things a lot further with the P20 Pro by packing in three lenses: There’s a 40-megapixel main lens with A.I. Image Stabilization (AIS), a secondary telephoto lens rated at 8-megapixels, and a third 20-megapixel monochrome lens. This camera offers 3x optical zoom, which can be enhanced digitally to 5x. It also delivers incredible detail and solid low -light performance.</p>",
            "<p>By contrast, the P20 combines a 12-megapixel primary lens with a 20-megapixel monochromatic lens. It may not have as many tricks at its disposal, but we still expect it to be a good performer. Both phones have front-facing cameras rated at 24-megapixels, which should be enough to elevate your selfie game to the next level.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/94b3f00b49b0e2f655ecbdc36369621e07b93b6b/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Huawei\">Huawei P20 Pro</a></strong></p>",
            "<p>You’ll find the latest Android 8.1 Oreo on the P20 and P20 Pro, with Huawei’s EMUI 8.1 user interface on top. It’s quite a departure from stock Android, and it means you won’t get the latest software updates as soon as Google rolls them out. Huawei’s software is packed with clever A.I. tricks, enabling things like keyword search in the photo gallery app. There’s no real difference between the two phones in this category.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>Huawei is firmly focused on the triple-lens camera as the standout feature of the P20 Pro, but everything else you might point to as a special feature can be found on both phones. There is a face unlock option on the P20 and P20 Pro that uses 2-D mapping to authenticate users in only half a second, but it’s not as secure as the iPhone X’s Face ID, so you can’t use it for payments.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>This has been a very one-sided battle so far, but the P20 is able to score a win on price, because it’s significantly cheaper than the P20 Pro. The Huawei P20 costs 649 euros (around $800), while the P20 Pro costs 899 euros (around $1,100).</p>",
            "<p>The phones are available globally now. The bad news is that the P20 and P20 Pro will not be released through carriers in the U.S. after <a href=\"https://www.digitaltrends.com/mobile/huawei-att-discussions/\">they were pressured to drop Huawei phones</a> by Republican politicians, due to security concerns.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/2a3ea98eecec1273565fb4e1e8a698bdcc4a1e6f/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Huawei\">Huawei P20 </a></strong></p>",
            "<p>There is absolutely no doubt that — as the name would suggest — the Huawei P20 Pro is a better phone than the P20. It has that triple-lens camera, a superior display, a bigger battery, and it’s more durable. The P20 is still a decent device, offering the same level of performance, A.I. smarts, and gorgeous design, but it falls well short of the P20 Pro. All you really have to decide is whether you can stretch your budget.</p>"
        ]
    },
    {
        "title": "\n\t\tWhy can’t Americans buy the best Android phone of 2018? Scaremongers\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p> <span class=\"dropcap\">I</span>n 2011, U.S. customs seized and presumably destroyed 60,000 Kinder Surprise eggs — a hollow chocolate egg with a capsule inside containing a toy. Why? The Food and Drug Administration banned the eggs for fear that over-eager children may scoff the chocolate egg and toy down in one go, thus choking on the plastic parts.</p>",
            "<p>“These chocolate treats may be cute and seasonal but they are too dangerous to children to be imported legally into the United States,” the <a href=\"https://www.cbp.gov/newsroom/national-media-release/dont-be-surprised-kinder-eggs-seizures-double\">Customs and Border Protection website</a> read at the time.</p>",
            "<p>Then it was candy. Today it’s phones. While Huawei phones are not yet banned, Americans are now being told these devices are <a href=\"https://www.digitaltrends.com/mobile/senate-intelligence-committee-huawei-zte-news/\">a threat to national security</a>, giving the impression that simply by owning one, all our personal and private information is being monitored and presumably stored or stolen by a clandestine operation on another continent. No-one wants that, in the same way we don’t want little kids choking on a miniature plastic toys.</p>",
            "<p>But there’s no evidence Huawei products are a security threat. Like the original Kinder Surprise, Huawei phones are sold all over the world (<a href=\"https://en.wikipedia.org/wiki/Kinder_Surprise#Safety_concerns\">almost</a>) without incident. As scaremongers keep the P20 out of U.S. stores, Americans are missing out on one of the best Android phones available. And that’s shame, even if you don’t want one.</p>",
            "<p>There are plenty of smartphones to buy. Spend <a href=\"https://www.digitaltrends.com/mobile/best-smartphones/\">over $500</a> and it’s almost assured that it’ll be good. Great, even. So why cry over a phone from a brand you don’t really know? It’s simple: Choice. Having more choice is excellent for us, because it pushes companies to give us better prices and make even better devices in the future, because they’re having to work harder to earn our support.</p>",
            "<p>Shutting out a manufacturer lessens that choice. Apple and Samsung must be chuckling away, because thanks to political and business machinations, they’ve not had to fight a newcomer. The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">Huawei P20 Pro</a> isn’t a perfect phone, but it’s easily as good as any other phone released in the past year. Its camera is better than any other, and right now it’s our favorite Android phone of 2018. It’s absolutely worth your money. Like the Kinder Surprise, it’s inviting, fun, and you can’t buy one.</p>",
            "<p>You may be thinking, “I trust these people saying Huawei and <a href=\"https://www.digitaltrends.com/mobile/zte-android-ban/\">ZTE phones</a>, services, and infrastructure equipment are a potential security risk.” It’s a fair point, and inviting trouble wouldn’t be sensible at all. You can read all about Huawei’s denial of any government involvement and how it’s privately owned — not by the state — on <a href=\"http://www.huawei.com/ucmf/groups/public/documents/webasset/hw_090305.pdf\">its site here</a>, but is there any truth to the accusations?</p>",
            "<p>Andrew Blaich, head of device intelligence at mobile security firm, <a href=\"https://www.lookout.com/uk\">Lookout</a>, told Digital Trends there are three factors at play:</p>",
            "<p>“First, speculation fueled by fear, uncertainty, and doubt. Second, insider knowledge of something known, but the information cannot be revealed at this time. Third, a general guidance to minimize any possible risk in the future based on geopolitics or other factors.”</p>",
            "<p>Is there any truth to Huawei hardware having backdoors that would allow governments to spy in its users? “As of now, there is no publicly available evidence that this has happened,” he said.</p>",
            "<p>Additionally, Blaich said it’s unfair to single out Huawei, adding, “All devices have some level of risk, which varies from device to device and manufacturer to manufacturer, all depending on the companies, developers, agencies, technology pipeline, app stores, or network operators involved.”</p>",
            "<p>Does that mean we should just accept the risk? No, of course not, so how about looking at Huawei’s relationship with the United Kingdom as a model for keeping everyone happy?</p>",
            "<p>Huawei is a major supplier of network infrastructure in the U.K., and its phones are available through <a href=\"https://www.digitaltrends.com/mobile/how-to-buy-huawei-p20-pro-uk/\">all the big-name carriers</a> with or without a contract. It has a 13 percent market share, according to <a href=\"https://www.counterpointresearch.com/apple-leads-uk-smartphone-market-in-2017q3/\">Counterpoint research</a>, behind Apple and Samsung. To help assuage concerns over security, Huawei set up the the Huawei Cyber Security Evaluation Centre (HCSEC) in 2010 with the U.K. intelligence agency, GCHQ. In it, phones and network equipment are tested by Huawei employees, extensively <a href=\"https://www.independent.co.uk/news/uk/home-news/are-huawei-the-enemy-within-gchq-is-tightening-its-supervision-of-the-giant-chinese-technology-9013869.html\">vetted by the U.K. government</a>, and everything is reported to the CEO of the National Cyber Security Centre, which is a part of the GCHQ itself.</p>",
            "<p>“The Oversight Board concludes that in the year 2016-17, HCSEC fulfilled its obligations in respect of the provision of assurance that any risks to U.K. national security from Huawei’s involvement in the U.K.’s critical networks have been sufficiently mitigated,” reads the HCSEC <a href=\"https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/626110/20170413_HCSEC_Oversight_Board_Report_2017_-_FINAL.pdf\">2017 annual report</a>.</p>",
            "<p>Huawei <a href=\"https://www.theguardian.com/technology/2016/aug/07/china-huwaei-cell-uk-national-security-cyber-surveillance-hacking\">works with the U.K. government</a> in a sensible way to reduce fears. The result is more phones on sale, and a stronger, faster, more robust network on which they operate.</p>",
            "<p>Huawei didn’t become the world’s third largest phone maker and the largest supplier of telecoms equipment by not adapting. It’s conscious of China’s poor record when it comes to espionage, and it knows it needs to do all it can to convince governments and companies it’s not a threat.</p>",
            "<p>Its success has come with a limited amount of exposure in the U.S. But it’s a business, and selling phones and equipment in America means more profit, and a greater chance to become the world’s number one phone manufacturer — a repeatedly-stated company goal.</p>",
            "<p>American phone buyers aren’t just missing out on the P20 Pro; but also Huawei’s investment and expertise in 5G network equipment. The <a href=\"https://www.wsj.com/articles/why-washington-is-so-obsessed-with-chinas-huawei-1520373341\">Wall Street Journal</a> reported Washington is consumed with the idea that China will have wider 5G connectivity before the U.S., and wants to do nothing to assist in its technological advancement. It’s a closed-minded approach that may see consumers suffer once again, and place more control in the hands of officials and carriers.</p>",
            "<p>The barrier has resulted in Huawei deciding to <a href=\"https://www.digitaltrends.com/mobile/huawei-refocus-efforts/\">leave the U.S.</a> to get on without it for now. Current Huawei <a href=\"https://www.wsj.com/articles/huawei-looks-to-existing-markets-as-tech-becomes-target-in-u-s-china-trade-spat-1523966693\">CEO Eric Xu said</a> he “couldn’t explain” what was going on between China and the U.S., and that it was “beyond him.” Instead, Huawei will focus on the places where it’s already seeing success. And who can blame it?</p>",
            "<p>That’s it. No P20 Pro for you. But if you want one, what can you do? Write to government representatives. Write to networks. How about going into <a href=\"https://www.digitaltrends.com/mobile/huawei-att-discussions/\">AT&amp;T</a>, <a href=\"https://www.digitaltrends.com/mobile/verizon-huawei-mate-10-pro-deal-news/\">Verizon</a>, or <a href=\"https://www.digitaltrends.com/mobile/best-buy-huawei-news/\">Best Buy</a> stores and asking for the Huawei P20 Pro? If enough people tell them, it’ll get back to management. Or, <a href=\"https://www.digitaltrends.com/mobile/how-to-buy-huawei-p20-pro-united-states/\">why not import one</a> and really thumb your nose at the establishment? It’s not a choking hazard, so customs won’t seize it. Alternatively, you could always not buy a phone through AT&amp;T or Verizon next time, and choose an unlocked <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-review/\">Google Pixel 2</a> instead.</p>",
            "<p>Don’t think this will make a difference? If 60,000 Kinder Surprise eggs were stopped at the border, imagine how many slipped through. This, and a subtle change in packaging by Kinder, resulted in the considerably more throat-friendly Kinder Joy being sold in American stores by 2017. If we’re proactive enough, and refuse to take scaremongering at face value without evidence, perhaps Huawei’s next phone (which <a href=\"https://www.digitaltrends.com/mobile/huawei-ceo-richard-yu-mwc-2018-interview/\">will have 5G</a>, by the way) and the network equipment it connects to will be vetted by a government-backed operation in the U.S., to make sure no one is listening in.</p>",
            "<p>More choice means we all win, remember?</p>",
            "<p><em>Opinion pieces represent the views of their individual authors, and not Digital Trends.</em></p>",
            "<p><em>The views expressed here are solely those of the author and do not reflect the beliefs of Digital Trends.</em></p>"
        ]
    },
    {
        "title": "\n\t\tHuawei P20 Pro vs. Huawei P10 Plus: A year is a long time in tech\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>The Huawei P20 Pro has been grabbing headlines because of its triple-lens camera, but it has plenty besides that to recommend it. This is a real, cutting-edge 2018 flagship with a price tag to match. But how does it measure up against its predecessor, the Huawei P10 Plus? A lot can happen in a year. Let’s take a closer look and see how these phones compare.</p>",
            "<p>The snappy performance of the P20 Pro is down to Huawei’s own <a href=\"https://www.digitaltrends.com/mobile/huawei-kirin-970-ai-news/\">Kirin 970 processor</a>, along with its Neural Processing Unit (NPU), which has a number of special artificial intelligence (A.I.) tricks up its sleeve and is designed to take the burden off the main processor. The P10 Plus has the older Kirin 960 processor and predates Huawei’s push into A.I. There’s no doubt that the P20 Pro will outperform the P10 Plus.</p>",
            "<p>You get 6GB of RAM in the P20 Pro, while the P10 Plus comes in two versions, one with 4GB of RAM and one with 6GB. The P20 Pro offers 128GB of storage, but there’s no MicroSD card slot. The P10 Plus comes with 64GB or 128GB of storage and there is room for a MicroSD card, offering expansion by up to 256GB.</p>",
            "<p>These phones both boast big batteries: The P20 Pro has a 4,000mAh battery, while the battery in the P10 Plus is rated at 3,750mAh. The P20 Pro has a bigger screen, though the resolution is lower, so we’d expect the extra capacity to tell. Sadly, there’s no wireless charging support, but both phones offer Huawei’s SuperCharge fast-charging standard.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/94b3f00b49b0e2f655ecbdc36369621e07b93b6b/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Huawei\">Huawei P20 Pro</a></strong></p>",
            "<p>These are both expensive-looking, attractive phones, but the P20 Pro looks much more modern than the P10 Plus. Huawei has embraced the <a href=\"https://www.digitaltrends.com/mobile/why-are-android-phone-makers-embracing-the-notch/\">notch trend we’re seeing in Android phones</a> and created a gorgeous glass back in various colors. Unusually for a new phone nowadays, the fingerprint sensor is on the front of the P20 Pro, just like it is with the P10 Plus, but the older phone has much larger bezels above and below the screen. On the back, the P10 Plus has that distinctive camera module along the top, whereas the P20 Pro opts for three vertically stacked lenses.</p>",
            "<p>In terms of durability, the P10 Plus has a distinctly disappointing IPX3 rating, while the P20 Pro scores an IP67 rating. In simple terms, this means that the P20 Pro can survive submersion, while the P10 Plus is only equipped to deal with the odd splash.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/94b3f00b49b0e2f655ecbdc36369621e07b93b6b/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Huawei\">Huawei P20 Pro</a></strong></p>",
            "<p>The P20 Pro boasts a 6.1-inch OLED screen with a 2240 x 1080 pixel screen resolution. The P10 Plus only has a 5.5-inch LCD screen, but it does boast a higher resolution of 2560 x 1440 pixels. In terms of pixel density this means that the P20 Pro scores 408 pixels-per-inch, while the P10 Plus offers 540ppi. The P10 Plus screen is significantly sharper, but the OLED in the P20 Pro has a much higher contrast ratio, with rich colors and really deep blacks. We think the P20 Pro has the superior screen and it’s also much bigger despite the body of the phone not being that much bigger.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/94b3f00b49b0e2f655ecbdc36369621e07b93b6b/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Huawei\">Huawei P20 Pro</a></strong></p>",
            "<p>We’re not necessarily convinced that more lenses makes for a better camera, but Huawei clearly is. The P20 Pro has an unprecedented three lenses making up the main camera: There’s a 40-megapixel main lens, an 8-megapixel telephoto lens, and a 20-megapixel monochrome lens. Put that together and you get a very high level of detail, powerful optical zoom, a solid bokeh effect for blurred backgrounds, and great low-light performance.</p>",
            "<p>By contrast, the P10 Plus combines a 12-megapixel primary lens with a 20-megapixel monochromatic lens. We were very impressed with some of the photos we were able to capture with the P10 Plus, but there’s little doubt that the P20 Pro is capable of more — we’re just beginning to test so we can find out how good that triple lens camera really is.</p>",
            "<p>The P10 Plus has a typical 8-megapixel front-facing camera, but the P20 Pro boasts a selfie camera rated at 24-megapixels.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/94b3f00b49b0e2f655ecbdc36369621e07b93b6b/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Huawei\">Huawei P20 Pro</a></strong></p>",
            "<p>You’ll find the latest Android 8.1 Oreo on the P20 Pro, with Huawei’s EMUI 8.1 user interface on top. The P10 Plus shipped with Android 7.0 Nougat and EMUI 5.1, though it has since been updated to Android 8.0 Oreo and EMUI 8.0. Huawei’s Emotion UI is a real departure from stock Android, but it does offer some nifty tricks. The software experience on these two phones will be very similar, but the P20 Pro has slightly newer software and we expect it to get updates for longer.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/94b3f00b49b0e2f655ecbdc36369621e07b93b6b/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Huawei\">Huawei P20 Pro</a></strong></p>",
            "<p>Huawei is firmly focused on the triple-lens camera as the standout feature of the P20 Pro, though the camera was also a headline feature for the P10 Plus. There are no real standout extras that might be described as special features here, but everything you might point to in the P10 Plus, from the software to the battery life, is done better in the P20 Pro.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/94b3f00b49b0e2f655ecbdc36369621e07b93b6b/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Huawei\">Huawei P20 Pro</a></strong></p>",
            "<p>The P10 Plus has struggled to put up much of a fight here, but it definitely wins on price. The Huawei P20 Pro costs 900 euros (around $1,100), while the P10 Plus costs 700 euros (around $850), though you can get it even cheaper now if you shop around.</p>",
            "<p>We’ve been fans of Huawei’s phones for a while now, so it’s shame the company has <a href=\"https://www.digitaltrends.com/mobile/senate-intelligence-committee-huawei-zte-news/\">run into problems</a> trying to <a href=\"https://www.digitaltrends.com/mobile/huawei-att-discussions/\">crack the U.S. market</a>. Though you can’t get either of these phones from your carrier, you can still buy them direct from Huawei and use them in the States on T-Mobile or AT&amp;T and they’re widely available in the rest of the world.</p>",
            "<p><strong>Winner: Huawei P10 Plus</strong></p>",
            "<p>With a triple-lens camera, a superior processor, a better design, a bigger battery, and greater durability, the P20 Pro is the clear winner here. It looks to be an excellent phone that will surely turn a lot of heads. The only reason you might choose the P10 Plus is to save yourself some money.</p>"
        ]
    },
    {
        "title": "\n\t\tHuawei sweetens the MateBook X Pro’s U.S. launch deal with gift card offer\t",
        "author": [
            "\n\t\t\t\t\t\tChuong Nguyen\t\t\t\t\t"
        ],
        "text": [
            "<p>Huawei’s privacy-focused flagship <a href=\"https://www.digitaltrends.com/laptop-reviews/huawei-matebook-x-pro-review/\">MateBook X Pro</a> laptop is now available for purchase by consumers in the U.S. Starting at $1,199, the MateBook X Pro is a great value, given the higher European launch prices, but Huawei is also sweetening the deal for American customers with a bundle. In addition to the free one-year Office 365 personal subscription and a MateDock 2 accessory bundle, there’s also a promotional gift card deal for up to $300 if the laptop is purchased before June 10. The gift card would be issued by the retailer and is good for use toward a future purchase.</p>",
            "<p>The MateBook X Pro comes with <a href=\"https://www.digitaltrends.com/computing/matebook-x-webcam-poll/\">a pop-up webcam</a> that’s carefully concealed and stowed in a key on the keyboard deck when not in use. This design change allowed Huawei to drastically slim down the bezels around the device’s 13.9-inch screen, giving the notebook a 91 percent screen-to-body ratio. Another <a href=\"https://www.digitaltrends.com/computing/matebook-x-pro-laptop-future/\">benefit</a> with moving the webcam is that it can be hidden when not in use, alleviating privacy concerns about the webcam being remotely activated by malicious software.</p>",
            "<p>At <a href=\"https://www.amazon.com/Huawei-MateBook-Signature-i7-8550U-GeForce/dp/B07CTKCFFH/ref=sr_1_1_sspa?s=pc&amp;ie=UTF8&amp;qid=1526923798&amp;sr=1-1-spons&amp;keywords=huawei%20matebook%20x%20pro&amp;th=1&amp;tag=dt-incontent-btn-20&amp;tag=dt-incontent-btn-20\" target=\"_blank\" rel=\"noopener\">$1,199</a>, the MateBook X Pro comes with the latest 8th Generation Intel Core i5 prcoessor, 8GB RAM, and 256GB solid-state storage inside a footprint that measures just 14.6mm thick. Upgrading to the higher <a href=\"https://www.amazon.com/Huawei-MateBook-Signature-i7-8550U-GeForce/dp/B07CTHN94Z/ref=sr_1_1_sspa?s=pc&amp;ie=UTF8&amp;qid=1526923798&amp;sr=1-1-spons&amp;keywords=huawei%20matebook%20x%20pro&amp;psc=1&amp;tag=dt-incontent-btn-20&amp;tag=dt-incontent-btn-20\" target=\"_blank\" rel=\"noopener\">$1,499 configuration</a> will give you a better Intel Core i7 processor along with discrete Nvidia GeForce MX150 graphics. The higher-priced model also comes with double the memory and storage, giving it 16GB RAM and a 512GB solid-state drive. Both configurations come with a single USB Type-C port, legacy USB Type-A port, Thunderbolt 3 over USB Type-C port, and 3.5mm headphone jack. A fingerprint reader that works with Windows Hello on Windows 10 is integrated into the power button, like Huawei’s previous MateBook X notebook.</p>",
            "<p>With the included MateDock 2 USB Type-C dongle, you can convert the USB Type-C port on the MateBook X to accommodate an additional USB Type-A port along with USB Type-C port for pass-through charging or to connect another USB Type-C accessory, HDMI, and VGA connectors. At the time of writing, <a href=\"https://www.newegg.com/Product/Product.aspx?Item=N82E16834324032&amp;cm_re=matebook_x_pro-_-34-324-032-_-Product\" target=\"_blank\" rel=\"noopener\">Newegg</a> is offering a promotional $150 gift card, and <a href=\"https://www.amazon.com/Huawei-MateBook-Signature-i7-8550U-GeForce/dp/B07CTHN94Z/ref=sr_1_1_sspa?s=pc&amp;ie=UTF8&amp;qid=1526923798&amp;sr=1-1-spons&amp;keywords=huawei%20matebook%20x%20pro&amp;psc=1&amp;tag=dt-incontent-btn-20&amp;tag=dt-incontent-btn-20\" target=\"_blank\" rel=\"noopener\">Amazon</a> is offering $300; <a href=\"https://www.microsoft.com/en-us/store/d/huawei-matebook-x-pro-laptop/8n4k86d4j006\" target=\"_blank\" rel=\"noopener\">Microsoft</a> makes no mention of a gift card bonus on its website, but the Windows 10 maker does offer special education and military discounts if you qualify. Given that the laptop just launched in the U.S., shipping times may vary between retailers.</p>",
            "<p>Before you decide to snag the deal right now, be sure to read our <a href=\"https://www.digitaltrends.com/laptop-reviews/huawei-matebook-x-pro-review/\">review</a> of Huawei’s MateBook X Pro and check out our guide to the <a href=\"https://www.digitaltrends.com/computing/best-laptops-ces-2018/\">best laptops</a>.</p>"
        ]
    },
    {
        "title": "\n\t\tMaster your Huawei P20 and P20 Pro with these helpful tips and tricks\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>While the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Samsung Galaxy S9</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a> may get the lion’s share of attention in the U.S., Huawei is a Chinese smartphone manufacturer that’s creating some seriously impressive phones. The <a href=\"https://www.digitaltrends.com/mobile/huawei-p20-and-p20-pro-news/\">Huawei P20</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">P20 Pro</a>, are forces to be reckoned with, offering beautiful designs and unique dual- and triple-camera setups.</p>",
            "<p>If you managed to get your hands on the Huawei P20 or P20 Pro (they are <a href=\"https://www.digitaltrends.com/mobile/how-to-buy-huawei-p20-pro-united-states/\">not sold</a> in the U.S.), check out our favorite tips and tricks that will help you make the most out of your new phone.</p>",
            "<p>When you set up your new Huawei P20 or P20 Pro, one of the first things you may notice is the pre-installed SwiftKey keyboard. If you’re not a fan, it’s easy to change it to another keyboard app. For example, if you would rather use Google’s Gboard, <a href=\"https://play.google.com/store/apps/details?id=com.google.android.inputmethod.latin&amp;hl=en_US\">download the app</a> from the Google Play Store. Once installed, head over to <em>Settings</em> &gt; <em>System</em> &gt; <em>Language &amp; Input</em> &gt; <em>Default keyboard</em>. You will get a prompt to choose from a list of installed keyboards — choose the one you want to use. This settings page has options to customize the keyboard even further if you choose.</p>",
            "<p>Facial authentication features on Android devices are often not as secure as <a href=\"https://www.digitaltrends.com/mobile/apple-face-id-head-start/\">Face ID</a> on Apple’s <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a>, and the same rings true with the Huawei P20 and P20 Pro. You cannot use Face Unlock to access secure services like banking apps — it’s purely a convenient way to quickly unlock your phone from the lock screen. If you didn’t configure Face Unlock when you first set up your device, simply go to <em>Settings &gt; Security &amp; privacy &gt; Face unlock.  </em>You either need to enter your existing PIN or set one up to use Face Unlock. You then see the Enroll face screen that provides details about the functionality. Tap <em>Continue &gt; Allow. </em> You will see a round viewfinder screen appear — make sure your face is centered and in good light, and the phone will register your face. You can then choose how you want Face Unlock to work. <em>Direct unlock</em> will automatically scan for your face and unlock the phone when the screen turns on, and <em>Slide to unlock</em> will require you to slide the screen to head to the home screen after the phone registers your face. You can also require lock screen notification content to be hidden until your face has been scanned.</p>",
            "<p>One of the few unfortunate things about the P20 and P20 Pro is the amount of bloatware that comes pre-installed. When you turn on the phone you will find apps like eBay, Booking.com, Instagram, and Netflix. Although you are likely to download at least a few of these apps anyway, we would prefer if Huawei allowed us to choose the apps on our phone. While most of these apps can be uninstalled, a select few can only be disabled. To uninstall apps, long-press the app icon and drag to the <em>Uninstall </em>tab located on the top right side of the notification bar. After that, you just need to click <em>OK i</em>n the pop-up window to approve the process. When you can’t uninstall an app, Android gives you the option to disable it. Disabling an app puts it to sleep and doesn’t allow it to run in the background. It also erases any data and updates, restoring it to the factory version. To disable an app, go to <em>Settings &gt; Apps &amp; notifications &gt; Apps. </em> Tap on the app you wish to disable and select <em>Disable. </em>If the app is running, you may need to select <em>Force Stop</em> &gt; <em>OK</em> before disabling the app.</p>",
            "<p>One of the best ways to personalize your phone is by <a href=\"https://www.digitaltrends.com/mobile/best-widgets-for-android/\">changing widgets</a>, wallpapers, and other home screen features. With the P20 and P20 Pro, there’s no shortage of options. To access these customization tools, long press on an empty area of the home screen. You’ll see several customization icons appear at the bottom of the display. Tap <em>Wallpaper </em>to switch the wallpaper on your home and lock screens. You can swipe through all of the different options at the bottom of the screen or tap the <em>Gallery </em>button to use one of your own photos.  There is also <em>Illusion and Scrollable </em>icons that allow you even more flexibility with your screens.  Once you have selected your desired wallpaper, just press the check mark in the upper-right corner and choose between the <em>Lock screen, Home screen, </em>or <em>Both </em>options.</p>",
            "<p>Widgets allow you to add small versions of your favorite apps to your home screen for quick access. To add a widget to your screen, press the <em>Widgets </em>icon and drag your favorite to an empty area on the home screen.  If you want to change the size or remove a widget, long-press on it to reshape it or drag it to the <em>remove </em>icon on the top right of the notification bar. Transitions allow you to change the animation used when you switch between screens or open an app. To change your default transition, long-tap on the home screen and press the <em>Transitions </em>icon. Tap the different transition options to preview the animation. Once you select your ideal transition, tap on an empty area of the home screen to enable it.</p>",
            "<p>The notch on the Huawei P20 and P20 Pro creates a pretty crammed notification bar at the top of your display. Luckily it’s pretty easy to gain a little more space by hiding the carrier name from the notification bar. Go to <em>Settings &gt; Apps &amp; notifications &gt; </em><em>Notifications &amp; status bar </em>and toggle off <em>Display carrier name. </em></p>",
            "<p>If you’re looking for a complete full-screen experience, Huawei lets you remove the Android navigation bar from your P20 or P20 Pro. There are a few options to replace it: On-screen navigation key, and the fingerprint sensor as an off-screen navigation key. With the latter, you can control your phone with the fingerprint sensor. A single tap acts as the back button, pressing and holding goes home, and a swipe to the right opens up recent apps. This option provides more screen real estate, but it will take you some time to get used to it. Head over to <em>Settings &gt; System &gt; System navigation.  </em>Choose <em>Off-screen navigation button </em>to use the fingerprint sensor as your primary method of navigation. If you don’t want to depend upon the fingerprint sensor, you can also select <em>Onscreen Navigation key </em>which creates a single navigation icon at the bottom of the screen.</p>",
            "<p>It seems like every major phone is <a href=\"https://www.digitaltrends.com/mobile/why-are-android-phone-makers-embracing-the-notch/\">coming with a notch</a> in 2018 and the Huawei P20 and P20 Pro are no exceptions. If the notch isn’t your cup of tea, Huawei has created a software fix that can hide it by placing some black bars around it. you’ll need to go to <em>Settings &gt; Display &gt; Notch </em>and click <i>Hide notch</i> button.</p>",
            "<p>By default, you will find all of your apps on the home screens of your P20 and P20 Pro. If you’d prefer to keep things a little tidier, you can enable the App Drawer to house all of your applications. Enabling the App Drawer is simple: Go to <i>Settings &gt; Display &gt; Home screen style </i>and choose <em>Drawer</em>.</p>",
            "<p>The cameras on the Huawei P20 Pro are game changers. The regular P20 only has a dual-camera system, but the Pro model adds a third. Huawei has made its camera software simpler and easier to use, but there are plenty of tips and tricks you’ll need to know to master it.</p>",
            "<p><strong>How to change the camera resolution</strong></p>",
            "<p>While the Huawei P20 and P20 Pro come with a 20-megapixel and 40-megapixel main camera, respectively, Huawei set the default megapixel setting for photos a bit lower for both phones. It’s because some of the camera features do not work on the highest resolution, such as 3x optical zoom, Night mode, and more. To change the megapixel count, open the <em>Camera </em>app and tap the gear icon on the upper right side. Select <em>Resolution </em>and choose the resolution you want.</p>",
            "<p><strong>How to enable super slow-motion video </strong></p>",
            "<p>Super slow-motion video allows you capture <em>Matrix-</em>like slow-motion effects with your P20 or P20 Pro. Like the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Samsung Galaxy S9</a> and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz3-review/\">Sony Xperia XZ3</a>, the P20 phones can shoot slow-motion video in 960 frames per second. Using this mode is easy on the P20. Open the <i>Camera </i>app and swipe the slider above the shutter button to the left until you see a <em>More </em>option. Tap <i>Slow-mo </i>and select <em>32x</em> speed from the icon on to the right of the shutter button. Press the shutter button when you’re ready to film. You will have two seconds to grab your slow-motion footage.</p>",
            "<p><strong>How to use Monochrome mode</strong></p>",
            "<p>While many smartphones offer a monochrome filter, Huawei is one of the only brands that has a dedicated monochrome lens tuned by experts at Leica. Using a monochrome lens, as opposed to a filter, allows you to <a href=\"https://www.digitaltrends.com/mobile/monochrome-photography-tips/\">capture stunning black and white photos</a> with impeccable details. Whether you’re looking for a gorgeous portrait or just something a little more artistic, Monochrome mode on the Huawei P20 and P20 Pro is not to be missed. Open the <em>Camera </em>app and move the slider above the capture button to <em>More. </em>Tap the <em>Monochrome </em>icon. You will see a menu of different options appear, including <em>Normal, Aperture, Portrait, and Pro. </em>For the most part, using<em> Normal </em>or <em>Portrait </em>modes will yield the best results unless you’re an experienced photographer. Once you have selected a mode, simply click the shutter button to grab your shot.</p>",
            "<p><strong>Turn off A.I.-assisted mode</strong></p>",
            "<p>Both the Huawei P20 and P20 Pro offer an A.I.-assisted mode for the rear-facing camera. The A.I.-assisted mode can detect more than 500 different scenarios in 19 different categories and make adjustments to help you get the best photograph. While Huawei’s A.I.-assisted mode typically does a great job detecting different objects and scenarios, it doesn’t always work perfectly. If you prefer to not to bother with the feature, it’s pretty easy to disable. Open the <em>Camera </em>app and tap the gear icon on the upper right side. From the <i>Settings </i>menu, simply toggle off the <em>Master AI </em>option.</p>",
            "<p><strong>How to grab a quick photo</strong></p>",
            "<p>Most phones allow you to grab a quick photo from the lock screen. The Huawei P20 and P20 Pro are no exceptions, however, the default setting is a little wonky. When you double-tap the volume down button, the phones default to taking a snapshot instead of just opening the camera. Fortunately, it’s pretty simple to change the default setting. Simply tap on the <em>Camera </em>app and select the gear icon. In this menu, select <em>Ultra snapshot </em>and change the default to <em>Open camera. </em>You can also swipe up from the lock screen to open the camera quickly.</p>",
            "<p>While the Huawei P20 and P20 Pro have many of the same features, there are a few goodies that are only available on the more expensive P20 Pro.</p>",
            "<p>Love the look of the Always-On Display you find on the Samsung Galaxy S9, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Pixel 3</a>, and scores of other Android phones? Huawei offers the exact same feature, it’s just hidden in the settings. If you want to add an Always-On Display to your Huawei P20 Pro, go to <em>Settings &gt; Security &gt; Screen Lock &amp; Passwords &gt; Always display</em> information and toggle it on. From here you’ll have the option to either schedule the display for certain times or have it stay on all day.</p>",
            "<p>People have strong feelings about dark mode. While dark mode does offer some benefits like marginally longer battery life, some people just find it more aesthetically pleasing. To enable dark mode, go to S<em>ettings &gt; Battery</em> and toggle on<em> Darken interface colors. </em>You will notice most settings screens will use the dark mode, but this does not translate to third-party apps.</p>"
        ]
    }
]