[
    {
        "title": "\n\t\tTake control of your LG G7 ThinQ with these helpful tips and tricks\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>As LG’s newest flagship, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-g7-thinq-review/\">LG G7 ThinQ</a> offers the perfect blend of gorgeous design and powerful specs. While it packs many of the same features you will find on other Android phones, it has a few awesome tricks up its sleeve. If you have managed to get your hands on LG’s latest and greatest, here are a few of our favorite LG G7 ThinQ tips and tricks to get you started.</p>",
            "<p>Love it or hate it, the <a href=\"https://www.digitaltrends.com/mobile/why-are-android-phone-makers-embracing-the-notch/\">notch is becoming a common feature</a> on smartphones. However, if you’re a traditionalist and prefer a notch-free display, LG has you covered.</p>",
            "<p>If you wish to remove the notch from your display, simply go to <em>Settings &gt; Display &gt; New Second Screen. </em>Select the <em>Custom </em>radio button and tap on the black circle below. If you wish to change the way the corners on the app display, you can also adjust that under the <em>App Corners </em>heading.</p>",
            "<p>One of our favorite Android features is the Always-on display. The feature allows you to easily see the time and various notifications even when your display is turned off.</p>",
            "<p>Setting up the Always-on display on your LG G7 ThinQ is simple. Go to <em>Settings &gt; Display </em>and toggle on the <em>Always-on display</em> option. Once the feature is enabled tap the overflow (three-dot) icon to customize your display, change its brightness, or turn it off during certain times.</p>",
            "<p>If you’re looking to access certain apps and features quickly, you’ll want to check out the Floating Bar on the LG G7 ThinQ. With Floating Bar you simply swipe from one side of your screen to access app shortcuts, capture screen GIFs, control the music player, and find frequently used contacts.</p>",
            "<p>To enable Floating Bar, simply go to <em>Settings &gt; General </em>and toggle on <em>Floating Bar</em>. Once the feature is enabled, tap the overflow (three-dot) icon to customize its position and active features.</p>",
            "<p>Since LG customizes Android for its phones, things are a little different than what you’ll find on phones with the stock OS. For example, instead of seeing the Google News Feed when you swipe right from the home screen, you will see something called Smart Bulletin.</p>",
            "<p>Smart Bulletin allows you to quickly access features you use on a regular basis. From the Smart Bulletin screen, you can get customized app suggestions, keep track of your health goals, catch up with news, and even use the built-in music app.</p>",
            "<p>While all of these features sound nice, some people just aren’t fond of Smart Bulletin. Luckily the feature is easy to disable. Simply long-tap on the home screen and select the <em>Home screen settings</em> icon. From this window, you simply need to toggle off the <em>Smart Bulletin </em>feature.</p>",
            "<p>One of our <a href=\"https://www.digitaltrends.com/mobile/oneplus-6-tips-and-tricks/\">favorite features on the OnePlus 6</a> is the Reading mode. The feature allows you to switch to a monochromatic display that looks similar to that of an ereader. A similar feature, called black and white mode, is available on the LG G7 ThinQ. If you want to give black and white mode a whirl, go to <em>Settings &gt; Display &gt; Comfort view</em> and toggle on the <em>Black &amp; white </em>slider.</p>",
            "<p>Want to unlock your phone with a quick glance? Well, the LG G7 ThinQ has you covered. With the G7 you can select from one of several different options to unlock your phone. Fingerprint authentication may be the quickest, but facial recognition is a lot more fun.</p>",
            "<p>To set up face recognition go to <em>Settings &gt; Lock screen &amp; security </em>and tap the <i>Face Recognition </i>tab in the <em>Biometrics </em>section. Tap <em>Next </em>and enter your PIN; if you’ve not set up a PIN you will need to do so before you can continue. From here select <em>Next</em> and follow the prompts to register your face.  Once you’re finished you can tap <em>Improve face recognition </em>and <em>Advanced face recognition </em>to make your phone more secure.</p>",
            "<p>When you use the LG G7 ThinQ, it’s easy to see audio was a priority for the smartphone giant. In addition to the new Boombox mode, LG also added several new features to help you get awesome sound when using headphones.</p>",
            "<p>If you want to tweak your sound preferences, first plug your headphones or earbuds into the 3.5mm jack on the bottom of the LG G7 ThinQ. Then go to <em>Settings &gt; Sound &gt; Sound quality and effects. </em>From this screen, you can normalize volume, tweak the equalizer, and turn on DTS:X 3D Surround or Hi-Fi Quad DAC.</p>",
            "<p>Although the LG G7 ThinQ features a 6.1-inch display, it’s pretty easy to hold. While you shouldn’t have a problem holding it one-handed, it may be hard to navigate the far edges of the display. Fortunately, the G7 ThinQ has an option that allows you to easily use the screen with one hand.</p>",
            "<p>To enable the feature go to <i>Settings &gt; Display</i> and toggle on the <em>Mini view </em>slider. Once enabled, simply slide your finger across the navigation icons to minimize the screen. To return to the full-size display, simply tap the X icon in the upper righthand corner.</p>",
            "<p>Sure, your new LG G7 ThinQ is blazing fast when you first pull it out of the box, but what happens in a few months when you’ve taken a chunk out of your storage for apps and photos? Not to worry, it’s easy to optimize your LG G7 ThinQ from the settings menu.</p>",
            "<p>When it’s time to clean up your phone, just go to <i>Settings &gt; General &gt; Smart Cleaning </i>and tap the <em>Optimize </em>button. If you optimized your phone and are still having performance issues, you may want to test your hardware; to do so just tap the <em>Test hardware </em>button at the bottom of the screen.</p>",
            "<p>There is a good chance you’re one of the many people who glance at their phone display before bedtime, so you will want to check out Comfort View on the LG G7 ThinQ. Comfort view allows you to make adjustments to your screen to <a href=\"https://www.digitaltrends.com/mobile/does-blue-light-ruin-sleep-we-ask-an-expert/\">minimize blue light, in hopes of getting a better night’s sleep</a>. If you’re finding yourself sleeping fitfully or waking unrefreshed you may want to check this feature out.</p>",
            "<p>Setting up comfort view only takes a few seconds. Go to <em>Settings &gt; </em><i>Display &gt; Comfort view. </i>From the <em>Comfort view </em>screen you adjust the blue light filter, and schedule active times for the feature.</p>"
        ]
    },
    {
        "title": "\n\t\tLG G8 ThinQ: News and rumors\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p>2018 was a busy year for LG. In addition to the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-g7-thinq-review/\">LG G7 ThinQ</a>, we’ve also seen the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v30s-thinq-review/\">LG V30S ThinQ</a>, the <a href=\"https://www.digitaltrends.com/mobile/lg-v35-thinq-news/\">LG V35 ThinQ</a>, and even the <a href=\"https://www.digitaltrends.com/mobile/lg-v40-thinq-news/\">LG V40 ThinQ</a>. Despite this release roster, it still had time to think about the LG G8 ThinQ, and rumors about its existence and release have started to spread. Here’s everything we know about the upcoming LG G8 ThinQ.</p>",
            "<p>It’s official: LG is revealing something at MWC 2019, and the LG G8 ThinQ is the most likely candidate. LG has sent out invites to a February 24 event at the Barcelona International Convention Centre in Barcelona, as well as a video that asks us to say “Goodbye Touch”. Considering the hand in the video uses swipes to interact with the paper on-screen, this hints at air gestures being a big part of the LG G8 ThinQ. Digital Trends will be on the ground at MWC 2019, and we’ll be sure to keep you up-to-date on the latest news and developments.</p>",
            "<p>According to sources speaking to <a href=\"http://www.etnews.com/20181226000327?mc=ev_104_00005\" target=\"_blank\" rel=\"noopener\">ETNews</a>, the LG G8 will be released in South Korea and internationally at the end of March. Old rumors said the G8 was more likely come in May — which would match previous phones. The LG G7 was revealed in May 2018, making it less than a year old if LG does return to MWC for its flagship phone launch. However, this could be down to <a href=\"https://www.androidauthority.com/lg-g8-mwc-2019-941386\">an accelerated release schedule</a>.</p>",
            "<p>Unlike some smartphone manufacturers, LG tends to stay true to its naming conventions. Rumors so far seem to agree the phone will be called the LG G8, either with or without the ThinQ suffix. There are no rumors regarding price and LG does not usually reveal how much a phone costs at all, often leaving that job to carriers.</p>",
            "<p>What will the LG G8 look like? The screen may change from having a wide, square notch to <a href=\"http://www.etnews.com/20181226000327?mc=ev_104_00005\" target=\"_blank\" rel=\"noopener\">a water droplet version</a>, in a similar shift to the one implemented by OnePlus for the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6-review/\">OnePlus 6</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T</a>.</p>",
            "<p>LG may also be working on <a href=\"http://www.etnews.com/20180612000253?mc=em_003_00001\">new display technology</a> which incorporates a speaker. This would mean the elimination of a traditional speaker in favor of an on-screen speaker system. <a href=\"https://www.digitaltrends.com/mobile/in-screen-speaker-technology-ces-2019/\">Other reports</a> claimed this may not be ready for 2019, but a <a href=\"https://twitter.com/OnLeaks/status/1080750645689413632\">recent tweet from leaker Steve H.</a> makes claims to the contrary, citing a source who says we’ll see this “Sound on Display” technology in the G8. After the G7 introduced the impressive Boombox speaker, this could be the natural next step.</p>",
            "<p>The LG G8 ThinQ’s screen may also have an impressive resolution. LG may use a 4K LCD screen on the G8, according to an unsubstantiated rumor from phone leaker <a href=\"https://twitter.com/UniverseIce/status/1004284702998474752\" target=\"_blank\" rel=\"noopener\">Ice Universe</a>.</p>",
            "<p>Since the LG G8 ThinQ will be one of LG’s 2019 flagships, we’re fairly confident the phone will have top-of-the-line specs, including a Qualcomm Snapdragon 855 processor. However, we <a href=\"http://www.etnews.com/20181226000327?mc=ev_104_00005\" target=\"_blank\" rel=\"noopener\">should not expect</a> the LG G8 to have 5G connectivity, as LG is rumored to be introducing a new range for this purpose.</p>",
            "<p>There are no leaks around RAM and storage options for the LG G8 ThinQ yet. If we had to venture a guess based off the LG G7 ThinQ and smartphone trends, we would say at the base model of the LG G8 ThinQ will have 6GB of RAM and a 128GB of onboard storage.</p>",
            "<p><em>Updated on January 23, 2019: The G8 ThinQ’s reveal date seems set in a new video from LG.<br>\n</em></p>"
        ]
    },
    {
        "title": "\n\t\tThe LG V40 ThinQ, G7 ThinQ, and Watch W7 are discounted for the holidays\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>Like LG’s current lineup of smartphones and in the market for a new device? LG has a few deals going right now that might be perfect for you. The company has discounted both of its flagship devices — the LG V40 ThinQ and LG G7 ThinQ — as well as its flagship smartwatch, the LG Watch W7.</p>",
            "<p>Let’s start with the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v40-thinq-review/\">LG V40 ThinQ</a>. The device boasts a Qualcomm Snapdragon 845, like most 2018 flagship phones, and that processor is coupled with 6GB of RAM and options for either 64GB or 128GB of storage. The display comes in at 6.4 inches with a resolution of 3,120 x 1,440 pixels — which is pretty good. What about the prices? Well, while the phone normally comes at $950, LG has discounted it to $750 — though you will have to buy the phone between December 16 and December 29. It can be bought at the discounted rate from <a href=\"https://click.linksynergy.com/fs-bin/click?id=9e1vMmumXG0&amp;subid=0&amp;offerid=570502.1&amp;type=10&amp;tmpid=13127&amp;RD_PARM1=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Flg-v40-thinq-with-64gb-memory-cell-phone-unlocked-aurora-black%2F6305718.p%3FskuId%3D6305718\" target=\"_blank\" rel=\"noopener\">Best Buy</a>, <a href=\"https://www.digitaltrends.com/go/8078ab895fd1059242c2c9021e6b138eafc89aa3/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a>, or <a href=\"https://www.bhphotovideo.com/c/product/1436639-REG/lg_lmv405qa7_ausabk_v40_thinq_64gb_smartphone.html\" target=\"_blank\" rel=\"noopener\">B&amp;H</a>.</p>",
            "<p>Next up is the LG G7 ThinQ, which is also a pretty nice device. The phone also has a Qualcomm Snapdragon 845 processor, along with either 4GB of RAM and 64GB of storage, or 6GB of RAM and 128GB of storage. The display on this phone is a little smaller, at 6.1 inches, with a resolution of 3,120 x 1,440 pixels. At launch, the phone was a little cheaper than the V40 ThinQ — coming in at $750 — and it’s been discounted by $150, down to $600. The deal is running the same amount of time as the LG V40 ThinQ deal. The phone is also available from <a href=\"https://click.linksynergy.com/fs-bin/click?id=9e1vMmumXG0&amp;subid=0&amp;offerid=570502.1&amp;type=10&amp;tmpid=13127&amp;RD_PARM1=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Flg-g7-thinq-with-64gb-memory-cell-phone-unlocked-new-platinum-gray%2F6302278.p%3FskuId%3D6302278\" target=\"_blank\" rel=\"noopener\">Best Buy</a>, <a href=\"https://www.amazon.com/LG-Electronics-ThinQ-Factory-Unlocked/dp/B07DYPM1XC/ref=sr_1_5?s=wireless&amp;ie=UTF8&amp;qid=1544656536&amp;sr=1-5&amp;keywords=lg%20g7%20thinq&amp;tag=dt-incontent-btn-20&amp;tag=dt-incontent-btn-20\" www.>Amazon</a>, and <a href=\"https://www.bhphotovideo.com/c/product/1407151-REG/lg_lmg710ulm_ausabk_g7_thinq_64gb_smartphone.html\" target=\"_blank\" rel=\"noopener\">B&amp;H</a>.</p>",
            "<p>Then there’s LG’s latest smartwatch, the <a href=\"https://www.digitaltrends.com/smartwatch-reviews/lg-watch-w7-review/\">LG Watch W7</a>. This watch came out a few months ago, and while it features Qualcomm’s old Snapdragon Wear 2100 processor, it’s still a relatively good accessory to couple with an LG smartphone. The Watch W7 has been discounted by $200 for the holidays, from $450 down to $250. Unlike the other two deals, the Watch W7 discount is running now and will run until December 22. The Watch W7 is also available from <a href=\"https://click.linksynergy.com/fs-bin/click?id=9e1vMmumXG0&amp;subid=0&amp;offerid=570502.1&amp;type=10&amp;tmpid=13127&amp;RD_PARM1=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Flg-watch-w7-smartwatch-44-5mm-stainless-steel-cloud-silver-rubber%2F6303711.p%3FskuId%3D6303711\" target=\"_blank\" rel=\"noopener\">Best Buy</a>, <a href=\"https://www.amazon.com/LG-Electronics-LMW315-AUSASK-Watch-W7/dp/B07HRZCYVF/ref=sr_1_3?s=wireless&amp;ie=UTF8&amp;qid=1544656575&amp;sr=1-3&amp;keywords=lg%20watch%20w7&amp;tag=dt-incontent-btn-20&amp;tag=dt-incontent-btn-20\" www.>Amazon</a>, and <a href=\"https://www.bhphotovideo.com/c/product/1436640-REG/lg_lm_w315_watch_w7_cloud_silver.html\" target=\"_blank\" rel=\"noopener\">B&amp;H</a>.</p>",
            "<p>All three of these devices are great buys — especially the smartphones — so if you’re in the market for a new device and like the idea of saving some cash, then they may be the way to go.</p>"
        ]
    },
    {
        "title": "\n\t\tLG V40 ThinQ vs. LG G7 ThinQ: Which LG flagship is right for you?\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/mobile/lg-v40-thinq-news-version-1538467594/\">LG V40 ThinQ</a> is to the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-g7-thinq-review/\">LG G7 ThinQ</a>, as Samsung’s <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Galaxy Note 9</a> is to the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Galaxy S9</a>: Bigger, more expensive, and packing a few extra features. The V in LG’s V Series phones stands for video, but that’s not the only thing that sets these two phones apart.</p>",
            "<p>If you’re shopping for a new smartphone, you like LG, and you’re wondering whether to go for the V40 or the G7, then we’re here to help. Perhaps you’re weighing up whether to upgrade from the G7 to the V40 — we can help you there, too.</p>",
            "<p>Both the G7 ThinQ and the V40 ThinQ rely on Qualcomm’s Snapdragon 845 processor which ensures fast and smooth performance. The V40 ThinQ backs that up with 6GB of RAM and 64GB of storage, while the G7 has 4GB of RAM in the 64GB model and 6GB of RAM in the 128GB model. You can expand the storage in both of these phones with a MicroSD card.</p>",
            "<p>There’s fast charging and wireless charging out of the box with these phones, so there’s no dividing them there. The V40 has a slightly larger battery, but it also has a slightly larger screen, so we think battery life will be similar and you’ll probably need to charge your phone daily whichever one you pick.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>We were a little disappointed when LG <a href=\"https://www.digitaltrends.com/mobile/why-are-android-phone-makers-embracing-the-notch/\">embraced the notch</a> in the G7 ThinQ, and the notch in the V40 suggests that it’s here to stay. The V40 ThinQ is the taller and wider of these two phones, though it does manage to be a touch more svelte than the G7. Both have a metal frame and a curved glass back with a fingerprint sensor in the middle of it. They’re clearly part of the same family, but you can see an important difference right off the bat: The V40 ThinQ boasts three lenses in its main camera to the G7’s two.</p>",
            "<p>Drop either of these phones and you’re going to run the risk of cracked glass and a scuffed metal chassis. Cases are a smart move. Water need not provoke any concerns, though, as both phones are IP68 rated, which means they can survive in water up to a meter and a half deep for 30 minutes without any signs of permanent damage.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>It has taken a while to hit upon a meaningful difference, but the OLED screen in the V40 is clearly superior to the LCD screen in the G7. The shape of these wide screens is very similar and they both have a 3120 x 1440-pixel resolution. That actually means the G7’s screen is a touch sharper, because it’s smaller, but we think the advantage of OLED tech far outweighs that detail. There are good reasons why all the top manufacturers are employing OLED in their phones now including the fact that it’s thinner, offers better refresh rates, and delivers higher contrast with true blacks.</p>",
            "<p><strong>Winner: LG V40 ThinQ </strong></p>",
            "<p>The headline feature for the LG V40 ThinQ is the camera. There are five lenses in the two cameras that the V40 ThinQ has and they’re packed with tricks. You’ll find a 12-megapixel main lens with larger pixels for improved low-light performance and optical image stabilization (OIS). It’s flanked by a 16-megapixel wide-angle lens and a 12-megapixel telephoto lens. That means you can still shoot wide photos when there is a lot to pack in, but it should also mean you can take better portrait shots with the bokeh effect blurring the background or zoom in on subjects that are far away. The front-facing camera pairs an 8-megapixel lens with a 5-megapixel wide-angle lens — a setup you’ll appreciate if you take a lot of group selfies.</p>",
            "<p>By contrast, the LG G7 ThinQ pairs two 16-megapixel lenses, one with OIS, and the second with wide-angle support. It’s a solid performer, as we recently found out in a <a href=\"https://www.digitaltrends.com/mobile/lg-g7-thinq-vs-samsung-galaxy-s9-plus-camera-shootout/\">shootout with the S9 Plus</a>. The G7 makes do with a single 8-megapixel lens in its front-facing camera.</p>",
            "<p>Not only is the hardware in the V40 better and more versatile, but you’ll also find some neat tricks in the software, especially if you love to shoot video. One of our favorite new features is the cinemagraph support, which enables you to take video where a single spot is animated and the rest is frozen like a photograph. While there’s a gimmicky feel to some of this stuff, and it may be used once and forgotten by the average person, if you’re into shooting video, the V40 should delight you.</p>",
            "<p><strong>Winner: LG V40 ThinQ </strong></p>",
            "<p>The LG G7 ThinQ shipped with Android 8.0 Oreo while the LG V40 ThinQ is shipping with Android 8.1 Oreo. They will both get upgraded to <a href=\"https://www.digitaltrends.com/mobile/android-9-pie-review/\">Android 9.0 Pie</a>, but we don’t know how long that will take. With LG’s interface on top of Android, you’ll find the experience of using these phones very similar. Since they came out around the same time, we don’t expect to see much difference in terms of future updates or support longevity.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The camera and some of the video tricks and filters are what sets the LG V40 ThinQ apart. As we said in the camera section, if you love to make videos, the V40 has been designed with you in mind.</p>",
            "<p><strong>Winner: LG V40 ThinQ </strong></p>",
            "<p>While you’ll need at least $900 to snag an <a href=\"https://www.digitaltrends.com/go/1bd1ccfdbcdda865a2d439cac03c9009123ec60c/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"LG\">LG V40 ThinQ</a>, the <a href=\"https://www.digitaltrends.com/go/6349f20faace43c651661a7e8525086a8ddd913c/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">LG G7 ThinQ</a> has recently dropped in price and can be picked up for $650 if you shop around. Both phones have wide carrier support, so you shouldn’t have any trouble using them on any network or buying one on a contract.</p>",
            "<p>The triple-lens camera and the OLED screen elevate the V40 ThinQ above the G7 ThinQ. The fact that LG is asking for a big premium to secure those advantages might give you pause, but there’s no doubt that the V40 is the better phone.</p>"
        ]
    },
    {
        "title": "\n\t\tLG V35 ThinQ vs. LG G7 ThinQ: Which phone prevails in stablemate showdown?\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-g7-thinq-review/\">LG G7 ThinQ</a> isn’t even out yet, but LG is already taking the wraps off its next phone, <a href=\"https://www.digitaltrends.com/mobile/lg-v35-thinq-news/\">LG V35 ThinQ</a>. Being stablemates, these two phones have a lot in common, with powerful hardware, huge screens, and LG’s A.I. smarts. But when it comes down to the real nitty-gritty, which of these two should you be spending your hard-earned dollars on? We put them head-to-head in a specs comparison.</p>",
            "<p>You’re likely to not see much of a difference between these two models when it comes down to performance, as both are using the latest <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a> processor. It’s an exceptionally powerful chip, and most phones we’ve tested with it have proven to be lightning fast, with no issues handling even the most demanding games. We haven’t had a chance to fully test the LG V35 ThinQ yet, but we expect it to perform extremely well. The G7 comes with 4GB RAM with the base model, but the V35 ups it to 6GB of RAM.</p>",
            "<p>We were slightly disappointed with the size of the G7’s battery on launch, but the 3,000mAh capacity proved capable enough to last a little more than a day. Again, we haven’t tested the V35 ThinQ properly yet, but we reckon the slightly larger battery size and OLED display should mean it’s a slightly stronger performer in battery life. Charging-wise, you can plunk either of these down on a <a href=\"https://www.digitaltrends.com/mobile/best-wireless-phone-chargers/\">Qi wireless charger</a>, or connect with a USB Type-C charging cable for superfast <a href=\"https://www.qualcomm.com/products/quick-charge-3\">QuickCharge 3.0</a> recharging.</p>",
            "<p>There’s a lot that’s similar between these two phones, but the larger battery capacity and the extra RAM on the V35 ThinQ push it ahead. It wins this round.</p>",
            "<p><strong>Winner: LG V35 ThinQ<br>\n</strong></p>",
            "<p>There’s a lot to like on the LG G7 ThinQ, but design isn’t necessarily high on the list. It’s not a bad style — the notched display and bezel-less design marks it firmly as a 2018 flagship — but it simply doesn’t do enough to differentiate itself in terms of its looks. The V35 ThinQ is a little more uniform on the front, because there’s no notch, but since it’s a design we’ve already seen on the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v30s-thinq-review/\">V30S</a> and the V30, it’s hardly exciting.</p>",
            "<p>Both phones feel very light in the hand, which lends an air of cheapness — not something you want to feel in a premium flagship. We don’t recommend dropping either of these phones, thanks to the large amount of glass used on both. <a href=\"https://www.digitaltrends.com/mobile/best-lg-g7-thinq-cases/\">Get a case</a> for either one and your peace of mind will improve. Surprisingly, the G7 will be slightly more durable because it uses Gorilla Glass 5 on the front and back, as opposed to Gorilla Glass 4 on the V35. Both phones fare better in terms of water and dust-resistance, thanks their IP68-ratings. That should mean both of them can take a trip down the toilet or into the bath and come out mostly unscathed (though we don’t recommend testing that).</p>",
            "<p>One other big difference is the power button. The V35 uses the fingerprint sensor as the power button, but the LG G7 adds a new power button on the right edge of the phone.</p>",
            "<p>The LG G7 ThinQ is slightly more durable than the V35, and we think its design is at least a little more interesting. It takes the win.</p>",
            "<p><strong>Winner: LG G7 ThinQ<br>\n</strong></p>",
            "<p>We hope you like big screens, because both of these phones come with huge displays, thanks to <a href=\"https://www.digitaltrends.com/mobile/bezel-less-phone-comparison/\">bezel-less designs</a> and extended aspect ratios. The G7 ThinQ comes with the larger screen, sporting a 6.1-inch Super LCD screen with a 3,120 x 1,440 resolution, and delivering a super-sharp 564 pixels per inch (ppi). The V35 ThinQ has a smaller 6-inch screen and a smaller ppi of 537, but with a resolution of 2,880 x 1,440 pixels, it’s likely tough to notice a difference.</p>",
            "<p>There is a difference between the types of screens used. While the G7 ThinQ uses a Super LCD screen, the V35 ThinQ is rocking an OLED screen, with all the advantages that screen tech delivers. The Super LCD on the G7 ThinQ looks great, but it can’t offer inky blacks like an OLED display. The G7 does have a trick up its sleeve: Super Bright Mode. Tap a button on the brightness slider and the screen will hit 1,000 nits — plenty of brightness to see the display outdoors in daylight. It only lasts 3 minutes, but it makes the screen far easier to read than an OLED outdoors.</p>",
            "<p>The notch design on the G7 is a point of contention. You can turn it off via software in the settings, but you won’t have to deal with this problem at all on the V35.</p>",
            "<p>There are advantages and disadvantages to both screens. While we love OLED displays, the Super Bright Mode is certainly handy outdoors, and the sharper screen helps,too. This round’s a tie.</p>",
            "<p><strong>Winner: Tie<br>\n</strong></p>",
            "<p>We haven’t had much chance to test out the LG V35 ThinQ’s camera yet, but it has the exact same camera we saw in the LG G7 ThinQ. Both phones’ camera suites are comprised of two 16MP lenses on the back — one standard, one wide-angle. These cameras are quite capable, with the wide-angle delivering some rather spectacular shots on occasion — but it’s when the lights go down that performance really takes a hit. Despite LG’s Super Bright mode, the G7 ThinQ just doesn’t deliver in low-light situations — and based on the numbers, the V35 ThinQ will probably suffer from the same issue.</p>",
            "<p>The V35 ThinQ will also come with the same A.I.-powered camera smarts that will change your settings based on what’s in frame, 4K video recording, and a 240 fps slow-motion video mode. There’s nothing different here, so this category is a tie.</p>",
            "<p><strong>Winner: Tie<br>\n</strong></p>",
            "<p>It’ll likely come as no surprise to anyone that you’ll find much the same versions of <a href=\"https://www.digitaltrends.com/mobile/android-o-news/\">Android 8.0 Oreo</a> on both of these LG flagships. It’s not stock Android and both have a couple of LG’s pre-installed apps, but there are plenty of settings to help you customize the phone to your liking.</p>",
            "<p>In terms of updates, as flagships, we expect these two will get a good few years of updates from LG, and will most likely be updated to <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android P</a>. Judging by <a href=\"https://www.digitaltrends.com/mobile/android-oreo-when-do-you-get-it/\">past performance</a>, you can expect the LG V35 ThinQ to get an update before the G7 ThinQ, but there’s unlikely to be a huge difference between the two. This is a tie.</p>",
            "<p><strong>Winner: Tie<br>\n</strong></p>",
            "<p>We’re seeing more and more A.I. integration in the market, and LG’s products are no stranger to A.I. smarts. The “ThinQ” name indicates an entry into LG’s A.I.-assisted world, and that means that both the LG G7 ThinQ and V35 ThinQ will be able to talk to any of LG’s other ThinQ-branded products. But it doesn’t end there (thankfully), as LG has ramped up integration of the Google Assistant. The G7 ThinQ comes with a dedicated button that can be used to talk to the Google Assistant without having to say a hot word — similar to how the Bixby button works on Samsung phones. The V35 ThinQ doesn’t have a button, but like the G7, you can ask Google Assistant to complete specific phone-related tasks.</p>",
            "<p>The BoomBox speaker was one of the more impressive parts of the G7 ThinQ, using the inside of the phone as an echo chamber to enhance sound quality. The V35 ThinQ doesn’t have this specific feature, but it does have get a Quad DAC and DTS-X Virtual Surround Sound like the G7.</p>",
            "<p><strong>Winner: LG G7 ThinQ<br>\n</strong></p>",
            "<p>The LG G7 ThinQ is currently <a href=\"http://www.lg.com/us/mobile-phones/g7-thinq\">available for pre-order</a>, and will ship June 1, with prices starting from $750. It will be available on all carriers except for AT&amp;T. Pre-orders for the LG V35 ThinQ will start June 1, with the phone shipping June 8. It will cost $900, and it will be sold exclusively on AT&amp;T and Google’s <a href=\"https://www.digitaltrends.com/mobile/google-project-fi-plans-pricing-explained-version-1527606016/\">Project Fi</a> network.</p>",
            "<p>The LG V35 ThinQ may be the company’s latest phone, but we think the G7 ThinQ is worth the money. It has a slightly flashier design, and handy features like the Super Bright Screen, a dedicated Google Assistant button, and the Boombox speaker. But if you hate the notch, the more expensive V35 might be the phone for you if you’re on AT&amp;T or Project Fi. The V35 does have a bigger battery, an OLED screen, and more RAM.</p>"
        ]
    },
    {
        "title": "\n\t\tLG V35 ThinQ vs. LG V30: Is the newer model worth the extra cash?\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>With an impressive dual camera setup, plenty of video-recording options, and A.I. smarts built into its core, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v35-thinq-review/\">LG V35 ThinQ</a> is an impressive new smartphone from LG. But it’s been less than a year since the LG V30 rolled out. What has the South Korean manufacturer added? Is the V35 ThinQ a major improvement over its predecessor? We decided to put the two phones head-to-head to find out.</p>",
            "<p>Phones get faster every year, with many of the top flagships adopting Qualcomm’s latest processor. The LG V35 ThinQ is no exception, as it comes packing a <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a> that is faster and more power efficient than the Snapdragon 835 you’ll find in the LG V30. While it definitely offers improvements, we never encountered any issues with performance in the LG V30. The difference between the two in everyday use is likely to be quite subtle.</p>",
            "<p>The V35 ThinQ has also been beefed up in the RAM department with 6GB instead of the 4GB that the V30 made do with. <a href=\"https://www.digitaltrends.com/mobile/how-much-ram-does-a-smartphone-need/\">How much RAM a phone needs</a> is the subject of some debate, but if you’re not a major multitasker, dipping in and out of countless apps and games, we don’t think you’ll feel much difference here either.</p>",
            "<p>When it comes to battery size and charging capabilities, these phones are identical. They both have 3,300mAh batteries that support Quick Charge 3.0 via the USB-C port, which is capable of delivering around 50 percent in just over half an hour. They also both support Qi wireless charging.</p>",
            "<p>While it may not feel much different now, the extra performance and RAM will be more telling over time, and the V35 ThinQ certainly offers more raw power.</p>",
            "<p><strong>Winner: LG V35 ThinQ</strong></p>",
            "<p>You may have trouble telling these phones apart at first glance. In fact, you may struggle to tell them apart at second glance, too. The LG V35 ThinQ and the LG V30 are identical in terms of outward appearance. They both have a 6-inch display with curved corners, small bezels, and no notch. They both have glass backs with a dual camera module and a fingerprint sensor beneath, as well as a USB-C port on the bottom and a headphone port on the top. They both …well, you get the picture.</p>",
            "<p>While you’ll want a case to guard against drop damage, both these phones also boast IP68 certification, which means they can handle short dunks into water without damage. Interestingly, the V35 ThinQ employs Corning’s Gorilla Glass 4 instead of the Gorilla Glass 5 found in the V30. We don’t have <a href=\"https://www.digitaltrends.com/mobile/when-will-we-have-unbreakable-smartphone-glass-gorilla-glass/\">unbreakable smartphone glass</a> yet, but we do know that Gorilla Glass 5 can withstand falls from greater heights without damage. The trade-off is that tougher protection against impacts means less protection against scratching, and glancing at our well-used LG V30, it does have a few scratches on the body, so perhaps that’s why LG made the switch here.</p>",
            "<p>The only other difference you’ll find is the color options. The V35 ThinQ only comes in black or gray so far. The V30 can be found in black, silver, blue, violet, and rose.</p>",
            "<p>There’s not enough here to separate these contenders, so this round has to be a tie.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>These phones both boast a 6-inch OLED screen with an 18:9 aspect ratio and a resolution of 2,880 x 1,440 pixels, which translates to 538 pixels-per-inch. They’re sharp and vibrant with inky blacks and support for HDR. In short, these displays are top-notch. They’re also identical, so there’s no dividing the phones here.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The V35 ThinQ offers some subtle hardware improvements in the camera department, pairing a 16-megapixel lens with an f/1.6 aperture and a 16-megapixel wide angle lens with an f/1.9 aperture. In the LG V30, the wide-angle lens is rated at 13 megapixels. The front-facing camera in the V35 ThinQ is also better — it’s an 8-megapixel camera with an f/1.9 aperture. Compared to the 5-megapixel, f/2.2 aperture shooter in the V30, it should capture more detail and perform better in low light.</p>",
            "<p>The V stands for video, and both these phones can record 4K at 30 frames per second. The V35 ThinQ has support for slow motion video at 240 frames per second in 720p, while the V30 can only manage 120 frames per second. You’ll also find <a href=\"https://www.digitaltrends.com/mobile/lg-v30-cine-video-mode-review/\">Cine Mode options</a> to help you shoot video in different styles.</p>",
            "<p>The main software difference is the addition of A.. Cam in the V35 ThinQ, which automatically identifies what’s in the shot and theoretically helps you to find the optimal settings to make your photo look good. The V35 also has support for <a href=\"https://www.digitaltrends.com/mobile/google-lens-smart-text-selection-style-match-io-2018/\">Google Lens</a> built into the camera app, enabling you to identify landmarks, scan text, and more. However, most of these software improvements have already started to roll out to the V30 as an update.</p>",
            "<p><strong>Winner: LG V35 ThinQ</strong></p>",
            "<p>The LG V30 launched with Android 7.1.2 (Nougat), but it has since been updated to Android 8.0 Oreo. The V35 ThinQ is launching with Android 8.0 Oreo and we expect it to be updated to <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android P</a> in the near future. Both have LG’s user interface over the top and a smattering of LG apps and gesture shortcuts. As the newer phone, we can expect the V35 ThinQ to be a higher priority for updates and to receive them for longer.</p>",
            "<p><strong>Winner: LG V35 ThinQ</strong></p>",
            "<p>There are a lot more similarities than differences when it comes to special features. The LG V30 and the V35 both offer support for Google Daydream and those large, sharp displays make them ideal for virtual reality. We already discussed some of the special video options, and the Google Lens integration, which be found on both devices.</p>",
            "<p>LG has added something called “Super Far-Field Voice Recognition” into the V35, which apparently allows the phone to recognize your voice from up to 17 feet away. That should make it easier to ask Google Assistant for help. Thanks to a special level of integration, you can also task Google Assistant with things like snapping a wide-angle selfie on your V35.</p>",
            "<p><strong>Winner: LG V35 ThinQ</strong></p>",
            "<p>The LG V35 ThinQ costs $900. It was sold exclusively on AT&amp;T and Google’s <a href=\"https://www.digitaltrends.com/mobile/google-project-fi-plans-pricing-explained-version-1527606016/\">Project Fi</a> network at first, but you can buy it unlocked from Amazon now. The LG V30 costs $800 and you can find it on all the major carriers including AT&amp;T, Verizon, T-Mobile, and Sprint.</p>",
            "<p>That means you’re looking at paying an extra $100 for a slightly better camera, newer processor, and more RAM. We imagine you might start to see some discounts on the V30 now as well, which could increase the price gap further.</p>",
            "<p>The LG V35 ThinQ is the better phone overall, but the improvements are minor. If you’re a big selfie fan or you love to play the latest graphically intensive games, then it might justify the extra outlay, but if you already own an LG V30, we don’t think it’s worth upgrading.</p>"
        ]
    },
    {
        "title": "\n\t\tLG G7 ThinQ vs. LG G6: Out with the old, in with the new\t",
        "author": [
            "\n\t\t\t\t\t\tBrenda Stolyar\t\t\t\t\t"
        ],
        "text": [
            "<p>LG officially launched its latest flagship — the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-g7-thinq-review/\">LG G7 ThinQ</a>. The latest addition to LG’s flagship G series, the G7 ThinQ brings a list of changes — from an updated look to a few new features. As the successor to the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-g6-review/\">LG G6</a>, how do the two stack up against each other? Let’s take a closer look and find out.</p>",
            "<p>The LG G7 ThinQ packs a Qualcomm Snapdragon 845 processor, which is a major upgrade from LG G6’s Qualcomm Snapdragon 821. You can expect the G7 ThinQ to be much faster and far more powerful since it’s running on one of the latest chipsets. As far as RAM, both phones offer 4GB but you can opt for 6GB instead with the G7 ThinQ if you need the extra memory.</p>",
            "<p>When it comes to the battery, the LG G6 packs a larger 3,300mAh battery in comparison to the LG ThinQ’s 3,000mAh battery. But in our LG G6 review, we saw poor battery life in the beginning until a software update improved the situation. LG also says that it has reduced the screen’s power consumption over the LG G6 by 30 percent, and the new processor is more power efficient, meaning the LG G7 ThinQ could potentially offer better battery life, even though capacity is smaller.</p>",
            "<p>The LG G6 only supports Qualcomm’s QuickCharge 2.0 while the LG G7 ThinQ supports QC 3.0 and 4.0. With QuickCharge 4.0, LG claims it can give you up to five hours worth of charge in only 15 minutes — but you need to purchase a specific adapter separately.</p>",
            "<p>With a more powerful processor, fast-charging capabilities, and a battery-saving feature, the LG G7 ThinQ takes it for overall performance.</p>",
            "<p><strong>Winner: LG G7 ThinQ</strong></p>",
            "<p>If we’re talking trends, the LG G7 ThinQ is definitely following the latest one in the world of smartphones these days — by including a notch. But if you’re not a fan, there are options to customize it via the settings. When it comes to size, it’s only slightly longer and heavier than the LG G6 and every bit as thin. By comparison, the LG G6 looks a little dated — even with a similar rounded design, its thicker bezels along the top and bottom make it look like the cheaper option.</p>",
            "<p>Another difference you’ll find is that the LG G7 ThinQ has a button on the side to activate Google Assistant. If you long-press it, you’ll activate its walkie-talkie feature which keeps Assistant listening for as long as you are pressing the button. By double-tapping the button, you will have access to Google Lens — which uses object identification with the phone’s camera. You also find the camera is placed vertically above the fingerprint sensor rather than horizontally like it is on the G6. For charging, both phones include a USB-C port but when it comes to the headphone jack, you will find it on the bottom of the LG G7 ThinQ and on the top of the G6.</p>",
            "<p>As for durability, both phones are made of metal and glass with Gorilla Glass 5 on the back making them equally as delicate. The same goes for water-resistance, as both the G7 ThinQ and G6 come with IP68 water-resistance. Either way, you’re going to want to put a case on both of these phones to protect from damage.</p>",
            "<p>With an upgraded design and features that are more easily accessible, such as Google Assistant via the A.I. key, the LG G7 ThinQ is designed to offer a better user experience.</p>",
            "<p><strong>Winner: LG G7 ThinQ</strong></p>",
            "<p>The LG G7 ThinQ packs a 6.1-inch display with a 3,120 x 1,440 pixel-resolution, while the LG G6’s 5.7-inch IPS LCD touchscreen has a 2,880 x 1,440-pixel resolution. The G7 ThinQ has a bit more screen real estate, but they are identical in terms of sharpness. Rather than OLED, both phones use IPS LCD which allows for a brighter screen. The LG G7 ThinQ even has a Super Bright Display feature that allows you to boost the screen to 1,000 nits (for three minutes at a time) during days when it’s super sunny outside. As mentioned earlier, it can also limit screen power consumption (at 500 nits) so you won’t have to sacrifice battery life for a bright, vivid display.</p>",
            "<p>While we found the G6 had a stunning display — filled with color, warmth, and detail — it can’t match the G7 ThinQ. Its successor has a slightly taller screen thanks to its 19.5:9 aspect ratio — in comparison to the G6’s 18:9 aspect ratio. One trait the phones do share in common is that they both have support for HDR 10.</p>",
            "<p>Even though both phones have LCD displays, the tech is improving all the time, so the LG G7 ThinQ wins this round.</p>",
            "<p><strong>Winner: LG G7 ThinQ</strong></p>",
            "<p>The LG G7 ThinQ has a dual-lens camera on the back, both rated at 16 megapixels, along with an 8-megapixel front-facing camera. It’s definitely an upgrade from the dual 13-megapixel lenses and 5-megapixel front-facing camera in the G6. The G7 ThinQ also has optical image stabilization and the wide-angle lens can take photos with a 107-degree angle. By comparison, the LG G6 has a wide-angle lens with a 125-degree angle, but you will see more distortion at the edges of shots. Both also have a manual mode for those who want to adjust the settings.</p>",
            "<p>The G7 ThinQ also has artificial intelligence integrated into its camera — if you point at an object, the A.I. will identify what it is, whether it’s a plant, soda can, etc. There is also Portrait mode available on both the rear and front-facing cameras which we found worked well for the most part.</p>",
            "<p>The LG G7 ThinQ’s camera allows you to take pictures in low light with its Super Bright Camera mode which darkens images by enlarging its pixels. We found the G6 ‘s camera seemed to struggle on days that were overcast, but took great nighttime shots, especially when using the wide-angle lens with the right lighting. Photos taken in the daytime were extremely crisp and bright as well.</p>",
            "<p>When comparing both specs and photos, the G7 ThinQ is the obvious choice. The camera’s software has far more features that allow you to be even more creative with your pictures and the hardware is slightly improved.</p>",
            "<p><strong>Winner: LG G7 ThinQ</strong></p>",
            "<p>The LG G7 ThinQ ships with Android 8.0 Oreo, and we didn’t experience lag or slowdown. There wasn’t too much bloatware loaded on the device either. Meanwhile, the G6 ships with Android 7.0 Nougat which launched two years ago. It was recently announced that the G6 would soon be receiving the Android 8.0 update, but it hasn’t at the time of writing. Both have LG’s user interface placed over Android with a few additions to make the experience better.</p>",
            "<p>With the release of Android P coming up, it’s unclear when the G7 ThinQ will receive the update. But of the two, you’re better off with a device that comes with Android’s most recent operating system right out of the box and we would expect the newer G7 ThinQ to receive updates for longer.</p>",
            "<p><strong>Winner: LG G7 ThinQ</strong></p>",
            "<p>As mentioned previously, the G7 ThinQ includes an A.I. key on the left side which allows you to enable voice recognition with Google Assistant. By holding it down, you can also use the walkie-talkie feature to speak to Google Assistant for even longer. Both devices also include a headphone jack along with QUAD DAC.</p>",
            "<p>Music lovers will also appreciate the boombox speaker on the G7 ThinQ. By removing the module that originally covers the speaker, LG managed to turn the whole phone into a resonance chamber providing enhanced, loud sound for audio.</p>",
            "<p>The G6 isn’t as impressive — with only new software features to highlight, like the Square Camera which splits your screen, with the top half for square format pictures and the lower half for either custom shots or previews.</p>",
            "<p><strong>Winner: LG G7 ThinQ</strong></p>",
            "<p>We’re still waiting on the final price for the LG G7 ThinQ, but <a href=\"https://www.digitaltrends.com/mobile/how-to-buy-the-lg-g7-thinq/\">we’ve learned</a> it costs $750 on T-Mobile. That’s $100 more than the G6, which cost $650 at launch. Both phones will work on all major carriers, though AT&amp;T is not selling the device, and those in the U.S. will be able to snag the G7 ThinQ starting the first week of June.</p>",
            "<p>As the successor to the LG G6, you would expect the G7 ThinQ to take the winning title. Not only does the G7 ThinQ have a more powerful processor under the hood, it offers a larger display, A.I. features, and an upgraded look. If you’re stuck between the two, the G7 ThinQ will provide you with the latest, high-end specifications, and a better user experience.</p>"
        ]
    },
    {
        "title": "\n\t\tLG V40 ThinQ: Everything you need to know\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Forget dual cameras, LG’s latest flagship smartphone packs five. It’s called the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v40-thinq-review/\">LG V40 ThinQ</a>, and it’s a direct successor to LG’s <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v30-review/\">V30</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v35-thinq-review/\">V35 ThinQ</a>, while also bringing a few features from the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-g7-thinq-review/\">LG G7 ThinQ</a>. If you’ve been waiting to break with an older phone and get your hands on a new LG phone, then now might be the time.</p>",
            "<p>With five cameras, the ability to create cinemagraphs, and an extremely good-looking display, here’s everything you need to know about the new LG V40 ThinQ. Check out our review for our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v40-thinq-review/\">in-depth impressions</a> of the phone.</p>",
            "<p>If you’ve not already pre-ordered your LG V40 ThinQ, then Verizon has released details for a few deals that might tempt you to part with some green.</p>",
            "<p>First off, new and existing customers will get $200 off their LG V40 when purchased as a part of a Verizon device payment. Trade in your old phone as well, and you can increase that discount by up to an incredible $300 — giving top-level customers the chance to receive $500 off their brand new LG V40 ThinQ.</p>",
            "<p>As with other carriers, anyone pre-ordering the LG V40 before October 17 will also receive some free gifts: A SanDisk Ultra 256GB MicroSDXC card and a DJI Osmo Mobile 2 gimbal, along with enrolment in LG’s <a href=\"https://www.lg.com/us/mobile-phones/warranty\">Second-year Promise program</a>. Check this deal and others in our <a href=\"https://www.digitaltrends.com/mobile/how-to-buy-lg-v40-thinq/\">LG V40 ThinQ purchasing guide</a>.</p>",
            "<p>First thing’s first — let’s talk about that display. It’s a massive 6.4-inch QuadHD+ OLED panel, running a 3,120 x 1,440 resolution in a 19.5:9 aspect ratio, and a pixels-per-inch measurement of 537. It offers deep, inky blacks and vibrant colors, though it won’t get as bright as the LCD screen on the G7 ThinQ. A notch cut into the top of the display houses the two front-facing cameras, but the screen is capable of getting so dark that you’ll probably forget it’s there.</p>",
            "<p>Take a look at the design of the phone and you’d be forgiven for mistaking this for the LG V35 ThinQ or LG V30 at first glance. Indeed, slap an extra camera lens on the back of either of those phones and a notch in the display, and you’ve got a dead-ringer for the LG V40 ThinQ. That’s no bad thing though, and we’ve praised the design of LG’s phones in the past. The edge-to-edge display curves gracefully into the phone’s body, and there’s an extremely slim bottom bezel. It’s packing water-resistance too, with an IP68-rating — the same as the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-review/\">iPhone XS</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Samsung Galaxy S9</a>.</p>",
            "<p>Flip the phone over and you’ll find the headline feature — three rear-facing camera lenses. There’s a fingerprint sensor underneath the horizontally arranged lenses, with LG’s logo and the phone’s name underneath. The LG V40 ThinQ comes in two colors to begin with — Aurora Black and Moroccan Blue. There were previous mentions of new colors including platinum gray and carmine red — and it’s possible these colors will follow at a later date. Only the Aurora Black will come to the U.S.</p>",
            "<p>The LG’s V-series dedication to top flagship specs hasn’t disappointed us in the past, and it seems that LG isn’t planning on doing so yet — the LG V40 ThinQ is packed to the brim with some top specs.</p>",
            "<p>The mighty <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a> serves as the LG V40 ThinQ’s main brainpower — the same processor we’ve seen on other top-level flagships this year, including the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Samsung Galaxy Note 9</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6-review/\">OnePlus 6</a>. That powerful processor is backed up by 6GB of RAM, and 64GB of onboard storage — though that storage can be expanded by up to 2TB, thanks to the inclusion of a MicroSD card slot.</p>",
            "<p>The 3,300mAh battery is unchanged, and you should expect to see a day’s usage. Should your battery run lower though, there’s support for QuickCharge 3.0 and fast wireless charging built in.</p>",
            "<p>The LG V40 ThinQ will launch with <a href=\"https://www.digitaltrends.com/mobile/android-distribution-news/\">Android 8.1 Oreo</a>, with LG’s UX skin laid over the top. There are a few useful features like LG’s <a href=\"https://www.lg.com/uk/support/solutions/mobile/v30/floating-bar\">Floating Bar</a> that can replace the traditional navigation bar, and there are some LG-branded apps that duplicate some of Android’s base apps. While the phone doesn’t launch with <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a>, you should expect to see the V40 be one of the first LG phones to <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">get the upgrade</a>.</p>",
            "<p>The V40 is packed to the brim with some great special features. Audio lovers will benefit from a 32-bit Hi-Fi Quad DAC and DTS:X 3D Surround Sound, as well as the <a href=\"https://www.lg.com/uk/lg-magazine/tech-story/lg-g7-thinq-puts-the-boom-back-into-the-boombox-speaker\">Boombox Speaker</a> originally seen in the G7 ThinQ that dramatically increases the device’s volume by creating a sound chamber inside the phone. <a href=\"https://www.digitaltrends.com/mobile/google-assistant/\">Google Assistant</a> is well entwined into LG’s software too thanks to a dedicated hardware key, and you’ll be able to access <a href=\"https://www.digitaltrends.com/mobile/how-to-use-google-lens/\">Google Lens</a> directly from the camera app. You’ll also get face recognition unlocking options, as well as voice recognition.</p>",
            "<p>Mobile photography has never been more impressive, but most phones ask users to pick between having a telephoto lens or a wide-angle lens. Why not have both? That’s what the LG V40 ThinQ is suggesting, with a huge array of five camera lenses that gives users an amazing suite of camera options.</p>",
            "<p>The back of the LG V40 ThinQ is graced with three camera lenses, arranged horizontally in the center line of the phone. The main lens is a 12-megapixel lens with an f/1.5 aperture, optical image stabilization, and Dual Phase Detection Autofocus. The second lens is a 16-megapixel wide-angle lens with a 107-degree field of view and an f/1.9 aperture. The final lens is another 12-megapixel lens, but with a smaller f/2.4 aperture and a 2x optical zoom.</p>",
            "<p>Flip the phone over and there are two camera lenses on the front. The main lens is an 8-megapixel lens, and it’s backed up a secondary 5-megapixel 90-degree wide-angle lens. The second lens is primarily used in portrait-style photos, as well as for wide-angle selfies or groupies.</p>",
            "<p>LG has often leaned heavily into video for its V-series and the V40 is no exception. The LG V40 ThinQ will be able to capture full 4K video at 60 frames-per-second, or 240 fps slow-motion video at 1080p H. There’s also digital image stabilization available on each lens.</p>",
            "<p>There are also some fun new features available in the LG V40 ThinQ — most notably the Cine Shot mode.</p>",
            "<p>Cine Shot is a new mode in the LG V40’s camera app that lets you take photographs with some motion in them, otherwise known as cinemagraphs. This type of medium has been around for quite some time, and LG is hardly the first manufacturer to add it to a phone. Motorola most recently included it in the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-z3-review/\">Moto Z3</a>.</p>",
            "<p>You can take Cine Shots with all three cameras on the back. It’s best to find an area with a lot of movement, with one subject in the foreground. When you tap the shutter button, the camera takes about three seconds of video, stabilizes it, and then you need to paint over the area you want to keep in motion. You can pinch and zoom to make sure it’s precise, and an eraser is present if you mess up — that’s important because once you save, you can’t edit the area of motion again. When you hit save, you will get a final result where whatever you painted over is in motion, and the rest is frozen like a photograph. It’s a short MP4 file, so you can share it on any social media platform.</p>",
            "<p>To get a better idea of what these Cine Shots look like, here are a few examples we’ve captured:</p>",
            "<p>It’s a little gimmicky, but it’s fun to play around with this mode. The video resolution is 1920 x 1080, but videos sometimes aren’t as detailed as we’d like.</p>",
            "<p>The LG V40 ThinQ is now available, and prices start at $900. It is available from Sprint, AT&amp;T, T-Mobile, Verizon, and US Cellular. Check out <a href=\"https://www.digitaltrends.com/mobile/how-to-buy-lg-v40-thinq/\">our buying guide</a> for all the best deals and pricing details.</p>",
            "<p>There are some great deals out there right now, and anyone buying the V40 at the moment will also be rewarded with the <a href=\"https://www.dji.com/osmo-mobile-2\">DJI Osmo Mobile 2</a> gimbal and a SanDisk 256 GB MicroSD Card with adapter, saving $258 off the retail price.</p>",
            "<p><i>Updated on October 18, 2018: We’ve updated the availability of the LG V40 ThinQ.<br>\n</i></p>"
        ]
    },
    {
        "title": "\n\t\tHow to buy the LG G7 ThinQ\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>LG has officially taken the wraps off of its newest flagship, the LG G7 ThinQ, and it features some <a href=\"https://www.digitaltrends.com/mobile/lg-g7-news/\">pretty awesome specs</a>, including a Qualcomm Snapdragon 845 processor, 4GB and 6GB RAM options, and a 12-megapixel dual-camera array with a wide-angle lens.</p>",
            "<p>In addition to the usual features we have come to expect on a smartphone in 2018, the LG G7 ThinQ has another trick up its sleeve: A Boombox Speaker that offers punchy sound and actual bass. To learn more about the G7 and its features, check out <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-g7-thinq-review/\">our review</a>. If you’re ready to buy one, read on to find the best deals for your next phone.</p>",
            "<p>The LG G7 ThinQ is now available for <a href=\"https://fi.google.com/about/phones/#lg-g7-thinq\" target=\"_blank\" rel=\"noopener\">pre-order from Google Project Fi</a>, making it one of the few high-end phones available from the carrier. The pricing comes in at $750, but if you get it on Project Fi, Google will also throw in a $100 Project Fi bill credit if you order the phone before July 7.</p>",
            "<p>U.S. Cellular is currently offering <a href=\"https://www.uscellular.com/uscellular/cell-phones/showPhones.jsp\">a great deal</a> on the newly released LG G7 ThinQ.</p>",
            "<p>Prospective buyers can either buy the G7 ThinQ SIM-free for $750, or can save $300 through U.S. Cellular’s 30-month installment plan. If you go for the monthly option, you’ll pay just $15 a month, with no money upfront. However, this cut-price deal is only available until June 30, 2018 — after which, the phone will be available for $25 a month.</p>",
            "<p>If you’re on America’s largest carrier, you can now order the LG G7 ThinQ directly through the <a href=\"https://www.verizonwireless.com/\">Verizon Wireless website</a>.</p>",
            "<p>Verizon is offering the LG G7 ThinQ at both its retail price of $750, as well as part of its monthly payment option. If you choose monthly payments, you’ll pay just $31.25 for 24 months. As an added bonus, Verizon is offering an additional $100 off LG’s latest flagship for a limited time in conjunction with other trade-in discounts.</p>",
            "<p>T-Mobile <a href=\"https://www.t-mobile.com/devices/lg-g7\" rel=\"noopener\">started selling</a> the LG G7 on June 1. The handset will set you back $30 a month for 24 months (you’ll need to pay $30 first), and the full retail price comes out to $750. If you’re on T-Mobile, you may want to consider the Raspberry Rose color that’s “exclusive” to the carrier.</p>",
            "<p>The magenta carrier is also offering a buy-one-get-one-free program for the G7, though you need to purchase both phones on equipment installment plans in exchange for monthly bill credits. This program is still available for the LG G6 and LG V30.</p>",
            "<p>AT&amp;T will not sell the LG G7 ThinQ, instead opting to sell the <a href=\"https://www.digitaltrends.com/mobile/lg-v35-thinq-news/\">new LG V35</a>, another LG flagship that’s a little pricier.</p>",
            "<p>Looking for the LG G7 ThinQ on the Sprint network? Well, you’re in luck: The G7 ThinQ has been available from Sprint since June 1.</p>",
            "<p>Unlike most carriers, Sprint does not finance phones. Instead, it offers an 18-month lease program on its devices so you can easily switch phones every 12 to 16 months. For a limited time, Sprint is offering a BOGO promotion where new and upgrading customers can lease two LG G7 ThinQ handsets for one monthly lease payment of $33.</p>",
            "<p>U.S. Cellular is offering the LG G7 ThinQ on its network. Since June 1, U.S. Cellular customers have been able to order LG’s 2018 flagship in stores and online. Like most carriers, U.S. Cellular offers a monthly payment plan that will allow you to pay for the G7 over time.</p>",
            "<p>If you like to keep your options open, buying the LG G7 ThinQ unlocked may be your best choice. You’re not tied to any carrier and can switch at will, though you may need to pay the full price of the phone upfront if LG doesn’t offer any payment plans. The unlocked LG G7 ThinQ is available for <a href=\"https://www.bhphotovideo.com/c/product/1407151-REG/lg_lmg710ulm_ausabk_g7_thinq_64gb_smartphone.html\" target=\"_blank\" rel=\"noopener\">pre-order from B&amp;H</a>, where it comes at $750.</p>",
            "<p><em>Update: The LG G7 is available for pre-order from Google Project Fi.</em></p>"
        ]
    },
    {
        "title": "\n\t\tUseful LG V40 ThinQ tips and tricks\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v40-thinq-review/\">LG V40 ThinQ</a> was one of the first premium smartphones available in the U.S. to feature a triple-camera setup, and it’s backed up by a stylish design and top-of-the-line specs. It takes time to learn what this powerful phone and versatile camera are truly capable of, but we’re here to help.</p>",
            "<p class=\"p1\">\n\t\t\t<aside class=\"m-content-item-list m-content-module right h-nonessential\">\n\t\t\t\t\t\t\t\t\t<h4 class=\"title\">\n\t\t\t\t\t\tFurther reading\t\t\t\t\t</h4>\n\t\t\t\t\n\t\t\t\t<div class=\"items\">\n\t\t\t\t\t\t\t\t\t\t\t<div class=\"item\">\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://www.digitaltrends.com/mobile/best-lg-v40-thinq-cases/\">Best LG V40 ThinQ cases</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t<div class=\"item\">\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://www.digitaltrends.com/mobile/lg-v40-thinq-settings/\">Key settings you need to change</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t<div class=\"item\">\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://www.digitaltrends.com/mobile/lg-v40-thinq-news/\">Everything you need to know</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t</aside>\n\n\t\t\t</p>",
            "<p>If you’ve managed to get your hands on LG’s latest and greatest smartphone, we’ve compiled a few of our favorite LG V40 ThinQ tips and tricks so you can get more out of it. Let’s dive in and unlock the hidden features and functions that await.</p>",
            "<p>Ready for your new LG V40 ThinQ to feel like it’s actually yours? How about updating the home screen to reflect your taste and preferences. You can easily change the wallpaper, add widgets, or even change the grid layout on your home screen in just a few easy steps.</p>",
            "<p>To make customizations, long press on the home screen. The home screen will reduce and a menu will appear with four options. If you wish to add interactive widgets to your screen, tap <em>Widgets </em>and select the one you’d like to use by long pressing on the image and dragging it to the home screen.</p>",
            "<p>If you want to change the wallpaper, theme, or always on display setting, select <em>Wallpaper &amp; Theme. </em>Choose the wallpaper you’d like to use by tapping on it. Choose if you’d like the new wallpaper to appear on the home screen, lock screen, or both by selecting the appropriate radio buttons. Click the <em>Set Wallpaper </em>button to confirm your option.</p>",
            "<p>Finally, to change the spacing between apps on the home screen, you’ll need to adjust the grid. Just tap <em>Grid</em> and select your preferred option and press the <em>Apply </em>button.</p>",
            "<p>Can’t decide which lens to use on your LG V40 ThinQ? Not to worry because Triple Shot allows you to quickly (well, fairly quickly) take a photo with each lens.</p>",
            "<p>To use the feature, simply open the camera app and select Triple Shot from the menu bar below the viewfinder. Once in Triple Shot mode, you’ll want to make sure the focal point is centered in the viewfinder before tapping the shutter button. Once you tap the shutter button, you’ll want to keep the camera very still until you see the message <em>Triple Shot is being saved</em>.</p>",
            "<p>In addition to seeing three photos appear in the Photos app, you’ll also see a compilation video of all three shots set to music. While we’ve never found the video to be very useful, you can edit it by tapping on the <em>Overflow</em> (three dot) icon on the top-right side of the screen and selecting <em>Edit in Quick Video Editor.</em></p>",
            "<p>While the LG V40 ThinQ doesn’t have a ton of extra apps, you will find a little bloatware. For the most part, it’s just Yahoo branded apps, however you may not want them. Luckily, the apps can be easily uninstalled directly from the home screen.</p>",
            "<p>To uninstall an app, long press on the app you’d like to delete. When the app bubble appears, just select <em>App info </em>and tap <em>Uninstall. </em>Press <em>OK </em>to confirm.</p>",
            "<p>If you’re not a fan of apps filling up your home screen, there’s an alternative to the multi-app folder system you’ve probably created to tidy things up. On the LG V40 ThinQ, you can easily create an app drawer that’s accessible from the app bar on the bottom of the screen.</p>",
            "<p>To set up the App drawer, you’ll need to tap <em>Settings &gt; Display &gt; Home Screen &gt; </em><i>Select Home. </i>Select the <em>Home with separate apps list </em>radio button and toggle on the <em>Apps List Icon </em>option before tapping <em>Ok. </em></p>",
            "<p>If you’re looking to get a good night’s sleep, you’ll probably want to keep your LG V40 ThinQ out of the bedroom. But you’re probably not going to do that, so <a href=\"https://www.digitaltrends.com/mobile/how-to-use-blue-light-filter-phone/\">scheduling the blue light filter</a> on your phone may be the next best option.</p>",
            "<p>Finding the blue light filter on the LG V40 ThinQ is a little more difficult than it should be since it’s hidden in the settings and is called Comfort View. If you want to set up the blue light filter, go to <i>Settings &gt; Display &gt; Comfort View. </i>Tap <em>Schedule and </em>enter the times you’d like to schedule the filter to be on or off.</p>",
            "<p>In addition to including some serious camera hardware in the LG V40 ThinQ, the South Korean smartphone manufacturer also made some impressive changes to the camera software. One such change is the addition of the cinemagraph mode.</p>",
            "<p>A cinemagraph is a still image with repeated movement in an isolated area. The best cinemagraphs tend to be images where there’s both distinct background and foreground movement. You can see an example above where the busy subway station appears to be perfectly still as the train arrives.</p>",
            "<p>To take a cinemagraph on the LG V40 ThinQ, open the camera app and tap <em>Mode </em>followed by <em>Cine Shot. </em>Capture your 2-second clip by tapping the red shutter button. Once the image is captured, just use your finger to paint over the area where you’d like to see movement. If you select a larger area than necessary, you can easily make adjustments by tapping the eraser icon. When you’re satisfied with your cinemagraph, just tap <em>Save </em>and it will appear as a GIF in your photo gallery.</p>",
            "<p>One of the biggest selling points of the LG V40 ThinQ is the triple-camera array on the back. In addition to the primary camera, there’s also a super-wide-angle lens and a telephoto lens that will help you get the best shot.</p>",
            "<p>Not sure which lens will get you the best shot? Well, you’re in luck because LG created a way for you to easily preview what your shot will look like on each lens. Simply long tap on any of the lens icons (trees) on the right side of the viewfinder and a tiny preview window for each lens will appear. When you’ve decided which lens to use, simply tap on it and press the shutter button to grab your perfect photo.</p>",
            "<p>Want to watch Hulu in the background while you send an email? Like most Android smartphones, you can easily activate split-screen mode on your LG V40 ThinQ.</p>",
            "<p>To use split-screen mode, open the apps you’d like to use and make sure the app you’d like on top is active on the display. Long press the <i>Overview</i> (square) button and select the app you’d like on the bottom half of the screen. To adjust the size of either half, drag the resize slider that sits between the two apps.</p>",
            "<p>Ready to return to a single app? Just drag the resize slider all the way to the top or bottom of the screen.</p>",
            "<p>If you’ve ever had a child accidentally send a message or email on your phone, you’ll appreciate Screen Pin. With Screen Pin, you can restrict the person using your phone to a single app.</p>",
            "<p>To turn on Screen Pin, open the app you’d like to pin. Tap the <em>Overview</em> (square) button in the navigation bar. Select the app you’d like to pin. Tap the blue pin<em> </em>icon that appears on the bottom right side. When the pop-up appears asking you to confirm your selection, select <em>Pin. </em></p>",
            "<p>Finished with Screen Pin? Just tap the <em>Back </em>and <em>Overview </em>buttons simultaneously to unpin the app.</p>"
        ]
    }
]