[
    {
        "title": "Moto's Great Cheap Phones Are Back, Now With a Face ID Knockoff",
        "author": "Sam Rutherford",
        "text": [
            "<p>For years, Motorola has been the leader in making cheap phones feel like quality products, instead of gadgets designed only to hit a certain price point. And while the next generation of Moto’s low cost handsets don’t seem super exciting, from what I’ve seen so far, they should continue Motorola’s legacy of making, simple, but solid smartphones for under $250.</p>",
            "<p>In total, Motorola is offering four new models: the $250 Moto G6 and $200 Moto G6 Play, and less expensive Moto E5 Plus and E5 Play (exact prices still TBA). Starting with the standard G6, which can be considered the flagship of Moto’s new low-cost lineup, Moto has taken a lot of design cues and features from the <a href=\"https://www.motorola.com/us/products/moto-x-gen-4?cid=us:sem:wj0rfd&amp;utm_source=Google&amp;utm_medium=PPC&amp;utm_campaign=Brand_MotoX_Exact&amp;utm_content=Moto_X4&amp;utm_term=moto_x4&amp;gclid=CjwKCAjw2dvWBRBvEiwADllhn1x8WySpWOQeur_eBhIKDwbkWsCKRmqzm1gazRNZJywr40A4imB4_BoCpqcQAvD_BwE&amp;dclid=CKKR_sjoxNoCFQm_TwodKasGfw\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.motorola.com/us/products/moto-x-gen-4?cid=us:sem:wj0rfd&amp;utm_source=Google&amp;utm_medium=PPC&amp;utm_campaign=Brand_MotoX_Exact&amp;utm_content=Moto_X4&amp;utm_term=moto_x4&amp;gclid=CjwKCAjw2dvWBRBvEiwADllhn1x8WySpWOQeur_eBhIKDwbkWsCKRmqzm1gazRNZJywr40A4imB4_BoCpqcQAvD_BwE&amp;dclid=CKKR_sjoxNoCFQm_TwodKasGfw', {metric25:1})\">Moto X4</a>, and made them just a little bit better. </p>",
            "<p>Instead of X4's 16:9 display, the G6 sports a 5.7-inch extra-wide 18:9 full HD+ screen with a Qualcomm Snapdragaon 450 processor, 12-MP and 5-MP dual rear cameras, front-mounted fingerprint sensor, and a built-in microSD card reader. Available RAM will be either 3GB or 4GB  depending on the model, with users able to chose from 32GB of 64GB of storage as well. Around back, the G6 sports a sleek, curved glass back, along with a USB Type-C port and headphone jack on bottom. </p>",
            "<p>All told, the G6's specs ticks all the major check boxes for smartphone essentials, without adding in too much extra BS. As with past G series devices, the G6 sports a near stock version of Android 8.0 Oreo, though Moto has included its traditional set of Moto Actions so you can hold the phone and twist your wrist a couple times to launch the camera, or make a chopping motion to turn on the flashlight. </p>",
            "<p>Even the fingerprint sensor supports gesture controls so that instead of using Android’s traditional software nav buttons to get around, you can swipe left on the fingerprint reader to go back, swipe right to open recent apps or press and hold to lock the phone. Inside the camera, Moto has also added object recognition that can detect certain landmarks and certain objects like food, and a the usual set of selective focus and depth of field effects that you’d expect from a dual camera smartphone. Once again, these aren’t particularly new or innovative features, but they remain nice additions to an otherwise minimalist Android skin. </p>",
            "<p>As for the G6's slightly cheaper sibling, the G6 Play, Motorola has moved the phone’s fingerprint reader to the back, while also stepping down to a Snapdragon 427 chip, lower-res 1440 x 720 screen, 2GB or 3GB of RAM, 16GB or 32GB of storage and a single 13-MP rear cam. But then things get a little weird with the G6 Play’s 4,000 mAh battery, which is 1,000 mAh more than the one in the more expensive G6. Moto says that the standard G6's more energy efficient CPU should neutralize some of the discrepancy in battery size, but honestly, screw that, I want both phones to have the big battery!</p>",
            "<p>I also kind of take offense to Motorola putting a micro USB port on the G6 Play instead of USB-C. It seems like a lazy cost-cutting move that goes against what makes Moto’s G-series phones so good in the first place. Thankfully, both the G6 and G6 Play have kept their headphone port, because the last thing you want to do after saving money on a phone is turn around and buy new headphones because there’s no 3.5mm jack.</p>",
            "<p>Finally, we come to the E5 Plus and E5 Play. Unlike the G-series which will be available unlocked and through carrier channels, the E-series will only be available direct from wireless providers, which is why specific pricing hasn’t been announced yet. That said, it’s safe to assume that both phones will cost even less then the $200 G6 Play. </p>",
            "<p>Specs-wise, the E5 Plus sports a huge 6-inch 1440 x 720 screen alongside a massive 5,000 mAh battery, Snapdragon 435 CPU, 3GB of RAM, 32GB of storage and microSD expandability. Meanwhile the super budget E5 Play features just 2GB of RAM and 16GB of storage, and is the only new Moto with a cheapish feeling plastic back. </p>",
            "<p>Even though I only got to spend a briefing time checking out the phones, it’s clear that two of these phones are a little more interesting than the others: the standard G6 and the E5 Plus. </p>",
            "<p>At just $250, the G6 has all the features you really want on a phone. Heck, it even has a face unlock system, though likely not nearly as secure as Apple’s 3D FaceID tech. Alternatively, the E5 Plus should be quite cheap, while also featuring the biggest screen and battery of the four. It’s an intriguing combination for folks who just want to most device for their dollar. While no specific release dates have been announced just yet, Moto says both G6 and E5 handsets should go on sale sometime in late spring. </p>"
        ]
    },
    {
        "title": "Motorola’s Making the Cheap Smartphone Even Harder to Resist",
        "author": "Patrick Lucas Austin",
        "text": [
            "<p>Apple and Samsung would have you believe quality smartphones should cost the <a href=\"https://gizmodo.com/protect-your-1-000-phone-with-actual-rocks-1823086563\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/protect-your-1-000-phone-with-actual-rocks-1823086563', {metric25:1})\">many hundreds of dollars</a> you must sacrifice to obtain their rarefied devices. But in recent years, the march of time has made that notion obsolete. In 2012, a $200 device was nearly unusable. But now? Sharp screens are cheap, and fast processors are even cheaper. <a href=\"https://gizmodo.com/the-triumph-of-the-cheap-phone-1724918486#_ga=2.9519029.1255309007.1529863636-1409107817.1528475388\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-triumph-of-the-cheap-phone-1724918486#_ga=2.9519029.1255309007.1529863636-1409107817.1528475388', {metric25:1})\">Inexpensive smartphones have been pretty good</a> for years! And so, the <a href=\"https://www.motorola.com/us/products/moto-g-gen-6\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.motorola.com/us/products/moto-g-gen-6', {metric25:1})\">$250 Motorola G6</a> is the latest in the company’s <a href=\"https://gizmodo.com/moto-g-2014-review-a-phone-this-cheap-shouldnt-be-th-1635033146\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/moto-g-2014-review-a-phone-this-cheap-shouldnt-be-th-1635033146', {metric25:1})\">line of devices</a> serving <a href=\"https://gizmodo.com/moto-g-review-2015-a-great-phone-doesnt-have-to-cos-1722509063\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/moto-g-review-2015-a-great-phone-doesnt-have-to-cos-1722509063', {metric25:1})\">as a harbinger</a> of the inevitable: Pretty good might be good enough for everyone. Sure, it’s missing a few niceties, and looks like a generic slab of plastic, but those faults are easy to ignore for under $300. Did I mention it has a headphone jack?<br></p>",
            "<p>The Lenovo-owned Motorola has been working to make more affordable Android smartphones a compelling option, and has done pretty well so far. There are definitely cheaper phones on the market, <a href=\"https://gizmodo.com/motos-great-cheap-phones-are-back-now-with-a-face-id-k-1825371190\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/motos-great-cheap-phones-are-back-now-with-a-face-id-k-1825371190', {metric25:1})\">even from Motorola itself</a>. The company makes the <a href=\"https://gizmodo.com/motos-great-cheap-phones-are-back-now-with-a-face-id-k-1825371190\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/motos-great-cheap-phones-are-back-now-with-a-face-id-k-1825371190', {metric25:1})\">budget E4 and E4 Plus</a>, priced well below the G6’s $250 price tag. </p>",
            "<p>The <a href=\"https://gizmodo.com/the-moto-g4-is-a-phone-caught-between-cheapness-and-gre-1783912234\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-moto-g4-is-a-phone-caught-between-cheapness-and-gre-1783912234', {metric25:1})\">Moto G line</a> of smartphones represents the company’s mid-range tier, which means you can expect a slightly bigger and better device, but nothing like the company’s flagship Moto Z line, which features a much faster processor and supports the company’s <a href=\"https://gizmodo.com/motorola-wont-give-up-on-modular-smartphones-no-matter-1826584390\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/motorola-wont-give-up-on-modular-smartphones-no-matter-1826584390', {metric25:1})\">Moto Mod phone add-ons</a>. Still, $250 is $250, and you get what you pay for. So let’s run through the trade offs you’ll be faced with if you decide to go cheap.</p>",
            "<p>The G6, running a near-stock Android 8.0, has an all-glass body made of Corning’s Gorilla Glass 3. Unfortunately it feels more like plastic with a few coats of gloss on top. It’s slippery, and prone to collecting an unsightly amount of fingerprints. Its thin power button and volume rocker aren’t as tactile as they need to be, and make it difficult to tell when you’ve actually pressed them. Its home button is an oblong capacitive fingerprint sensor that supports left and right swiping to go back and access recent apps, respectively. </p>",
            "<p>It’s got a pair of rear cameras, one 12-megapixel and one 5-megapixel, though the latter is used in service of photo effects like a hit-or-miss portrait mode (that can’t properly blur around my bald head for some reason) and selective color effects. It’s an expensive gimmick to have, one I’d rather replace with a lens capable of optical zoom. But hey, everyone loves portrait mode, I guess. There’s also an 8-megapixel front-facing camera for your standard-fare selfie. The camera app supports an assortment of features like filters and Google Lens. But your photos won’t make any great impressions, and so-so low-light performance means your images will be grainier than you’d like. It’s also pretty sluggish to start, and the slight delay from tapping the shutter button is too long for my liking.  </p>",
            "<p>There’s no wireless charging support, nor is there NFC. Wireless charging might be a luxury, but removing connectivity options like NFC, used to pair with accessories, share data with people, and pay for things using your smartphone seems like a mistake.</p>",
            "<p>Also don’t expect any serious waterproofing. The G6 opts for a “water repellent nano-coating” to protect it from random splash damage. But it won’t help after a few minutes submerged.</p>",
            "<p>Yes, you can play <em>PUBG</em> (on the lowest graphical setting) and whatever other game captures your fancy, but don’t expect any stunning visuals. Also, expect a scorching hot phone after a few minutes of stalking opponents through the woods. Games designed to run at the more common 16:9 aspect ratio suffer from justification to the left of the display, leaving a small black bar where the extra real estate is.<br></p>",
            "<p>It sounds like I’m ripping on it, but those gripes are compared to much pricier phones! The G6 is actually pretty good at being a decent smartphone, especially for the price. A good screen, enough room for apps and photos, and USB-C support add up to a smartphone that seeks to excel at what people care about most, and focuses on the fundamentals before adding (or not adding) on extras. There’s 32GB of built-in storage to work with and some breathing room thanks to a microSD card slot. There’s a USB-C port, along with a headphone jack, two popular interfaces your thousand-dollar iOS device doesn’t have (and desperately needs). It’s got a 5.7-inch 2220 x 1080  display (that gives it an 18:9 aspect ratio), and Snapdragon 450 processor.</p>",
            "<p>Instead of adding a garish skin or suite of custom icons, the G6's customization comes in the form of its Moto Actions app. The gesturing feature lets you activate often used features—like turning on the flashlight, opening the camera app, or silencing your phone—by flicking your wrist or flipping your phone upside down. Since the company introduced the feature in its beloved Moto X, it’s been my favorite thing about the company’s devices. </p>",
            "<p>I’m not saying the G6 should be your next smartphone. If you’ve got the cash, get yourself something with more oomph in the processing department. But the Motorola G6 is the perfect smartphone for those existing in a liminal space, who would rather avoid using a cripplingly slow device until their ship comes in. Break your iPhone? Don’t pay for another one when a new device is around the corner. Get a G6. Did your mom drop her flip phone in the ocean during her vacation? Send her a G6 instead of flowers. Your butterfingers teenager need a smartphone? Until they’re done sweating from all that puberty, give them a G6. It’s good enough that they won’t sweat the stuff cut to make it cheap.<br></p>"
        ]
    },
    {
        "title": "This Cheap Smartphone Has a Ridiculous Battery, and It Makes Me Want to Cry",
        "author": "Sam Rutherford",
        "text": [
            "<p>Battery life is <em>the</em> number one concern when people think about buying a new smartphone, to the point that if a phone had nearly double the longevity of even the most expensive flagship handsets, it would be easy to overlook some of its faults. But at some point deficiencies start to drag down the novelty of having a really big  battery, which is precisely the problem with the <a href=\"https://www.asus.com/us/Phone/ZenFone-4-Max-ZC554KL/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.asus.com/us/Phone/ZenFone-4-Max-ZC554KL/', {metric25:1})\">Asus ZenFone 4 Max</a>. This thing has one of the biggest batteries you can find in a smartphone—and it’s only $200! Yet budget components take all the fun out of it. <br></p>",
            "<p>I don’t feel like I ask for much when it comes to budget phones: I’m mainly looking for a solid build and quality components new enough to not make the handset feel dated. At first glance, the $200 ZenFone 4 Max seems to fit the bill. It’s got a mostly aluminum build with a big 5.5-inch screen, a built-in fingerprint sensor and even dual cameras in back, a feature that’s all the rage among phone makers nowadays. Asus also gave the ZenFone 4 Max a card tray with room for two nano SIMs and a microSD card, so you don’t have to choose between easy multi-country cell service and expandable storage.</p>",
            "<p>You even get capacitive touch buttons for Back and Recent apps, which would normally seem a bit weird in an Android ecosystem that’s slowly trying to kill off anything that isn’t onscreen nav buttons. However, considering all the room next to the ZenFone 4 Max’s front home button/fingerprint reader, I’ll take those touch buttons as a welcome addition. </p>",
            "<p>But there are other a number of features on the ZenFone 4 Max that feel off on a phone in 2017. Asus’ use of a micro USB port instead of USB-C is simply not OK, and saddling a display this big with a 1280 x 720 resolution is almost criminal. Say what you want about optimal pixel density, but when I hold the phone reasonable distance a from my face (one to one and a half feet), I shouldn’t be able to see how the screen’s big pixels make text and pictures look rough and jagged. </p>",
            "<p>Then there’s the ZenFone 4's clunky skin for Android Nougat (last year’s build of Android), which with its huge icons, pastel color palette and massive text looks like it was made for children or octogenarians—I can’t figure out which. (Thankfully you can partially address my last two complaints using the phone’s included theme app and adjust the font size setting.)</p>",
            "<p>And there’s the matter of the ZenFone 4 Max’s dual rear cameras. In bright light, the main 13-MP camera is fine, but at night you start to run into a lot of issues with noise, graininess, and a general lack of sharpness. But what really annoys me is the secondary 5-MP wide angle cam. In pretty much anything other than well-lit outdoor environments, its performance is disappointing. Shots come out very underexposed to the point where it’s hard to make out one object from another, and then you add in some significant fisheye distortion and you’d often left with a pic that’s not good enough to share anywhere. If you’re not going to make the second camera worth using, don’t put it on the phone at all.</p>",
            "<p>I should also mention the ZenFone 4 Max’s performance. Even on most budget phones today, there’s enough processing power to keep most people happy. However, when I can literally count up to three Mississippi between tapping the shutter and being able to take a second HDR photo, it makes me feel like I should just put the phone down and be like “Don’t worry, I’ll wait.”</p>",
            "<p>But this phone exists because of the giant battery, not because of an ugly display or bad cameras. Thanks to a whopping 5,000 mAh capacity, the ZenFone 4 Max lasted 16 hours and 13 minutes on our battery test, which is way longer than what we saw from the Samsung Galaxy S8 (9:12) and Galaxy Note 8 (10:21), and double the longevity of the LG G6 (7:28) and Moto Z2 Force (8:42). And since it’s actually pretty hard to kill the ZenFone Max 4 in a single day, Asus thoughtfully included a reverse charging feature (and a cable), so you can use the phone’s excess juice to recharge other devices like a camera or someone else’s less resilient handset. The only problem is that if those other devices use something besides micro USB port for charging, you’re going to have to carry around extra adapters. (That’s another reason Asus should have gone with USB-C). </p>",
            "<p>And for those who might think a phone with a battery this big would take a while to recharge, you’re partially right. If you use something other than the included charger, it’s a crapshoot. When I connected the ZenFone 4 Max to my work laptop for recharging, power transfer was as fast as molasses. However, when plugged into the wall, the ZenFone 4 Max went from 25 percent charge to 44 percent in 30 minutes, which might not sound quite as impressive as the Note 8's recharge rate, which went from 25 percent to 55 percent in the same time. But when you consider that the ZenFone 4 Max’s battery is 40 percent larger than the Note 8's 3500 mAh power pack, you realize that’s actually pretty good.</p>",
            "<p>So now we’re back to our original dilemma: how much is amazing battery life worth to you? If it wasn’t for the ZenFone 4 Max’s ridiculous longevity, its other flaws would have ruled it out completely. And even when you factor that 5,000 mAh battery back in, there’s at least three other phones in this price range I’d rather have. The <a href=\"https://www.motorola.com/us/products/moto-g-plus?cid=us:sem:fykhsw&amp;utm_source=Google&amp;utm_medium=PPC&amp;utm_campaign=Brand_MotoG_Exact&amp;utm_content=Moto_G5_Plus&amp;utm_term=moto_g5_plus&amp;gclid=EAIaIQobChMI9ZyV2Lra1gIVxEOGCh1ZGQm-EAAYASAAEgLkAPD_BwE&amp;dclid=CNS0x9m62tYCFVILNwodQdAN7w\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.motorola.com/us/products/moto-g-plus?cid=us:sem:fykhsw&amp;utm_source=Google&amp;utm_medium=PPC&amp;utm_campaign=Brand_MotoG_Exact&amp;utm_content=Moto_G5_Plus&amp;utm_term=moto_g5_plus&amp;gclid=EAIaIQobChMI9ZyV2Lra1gIVxEOGCh1ZGQm-EAAYASAAEgLkAPD_BwE&amp;dclid=CNS0x9m62tYCFVILNwodQdAN7w', {metric25:1})\">Moto G5 Plus</a> has a smaller screen, but its got way better performance, and it’s compatible with every major carrier, while the <a href=\"https://www.zteusa.com/blade/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.zteusa.com/blade/', {metric25:1})\">ZTE Blade V8 Pro</a> and <a href=\"https://store.hihonor.com/us/honor-6x\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://store.hihonor.com/us/honor-6x', {metric25:1})\">Honor 6X</a> are both more well rounded handsets that do a better job of making you care about budget phones with dual cameras. The ZenFone 4 Max’s battery life might be extraordinary, but the rest of the phone is anything but.</p>",
            "<p>Android 7.1 • 5.5-inch 1280 x 720 LCD screen • Qualcomm Snapdragon 430 CPU •  Adreno 505 GPU • 3GB of RAM, 32GB of storage • built-in fingerprint sensor • 8-MP front camera • 13-MP main rear camera/5-MP 120-degree wide angle secondary rear camera • 802.11b/g/n wi-fi • Bluetooth 4.1 • dual SIM+microSD card slots • micro USB port • headphone jack • 5,000 mAh battery with reverse charging • no water-resistance</p>"
        ]
    },
    {
        "title": "9 Things to Know About the Samsung Galaxy S8 and Bixby",
        "author": "Alex Cranz",
        "text": [
            "<p>Samsung’s Galaxy S8 is very important because as you probably know, Samsung is in a bit of trouble. The Note 7 explosions from last summer continue to haunt the company, and Samsung’s leadership is currently <a href=\"http://gizmodo.com/everything-we-know-about-the-insane-scandal-rocking-sam-1792492797\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'http://gizmodo.com/everything-we-know-about-the-insane-scandal-rocking-sam-1792492797', {metric25:1})\">embroiled in a scandal</a> that is, to put it gently, totally bananas. The company needs a big win lest it be consigned to the punchline of late night talkshow hosts. So let’s stop talking about how bad the last six months have been for Samsung, and let’s start talking about Samsung’s new phone, which goes on sale Thursday, March 30th, and starts shipping April 21st. It will retail for $750, while the larger S8 Plus will retail for $850.<br></p>",
            "<p>The Galaxy S8 looks like the phone Samsung has been trying to build for the last few years. Its display dominates the design unlike any other device available, and the integration of Bixby, its newly acquired AI assistant, lets Samsung compete with Google and Apple in a new and, at least for Samsung, unprecedented way.</p>",
            "<p>We’ve only spent a few precious moments with the device, and we’ll have a full review closer to its release date, but for now, here are nine things you should know about the Galaxy S8.</p>",
            "<p>Aspect ratios seem to be the rage this year for smartphone companies. First <a href=\"http://gizmodo.com/lg-g6-first-impressions-back-to-the-basics-1792653064#_ga=1.131581583.1400882675.1486143502\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'http://gizmodo.com/lg-g6-first-impressions-back-to-the-basics-1792653064#_ga=1.131581583.1400882675.1486143502', {metric25:1})\">LG announced the G6</a>, with its bizarre 21:9 aspect ratio, and now Samsung has the S8 and S8 Plus with their 18.5:9 ratio. That’s just a little wider than the traditional 16:9, when you’re holding it in landscape orientation. The extra width all comes out of the bezel, which has basically disappeared. There’s a tiny black bar at the top and bottom of the phone. The bezel remaining at the top of the device  hides the 8-megapixel front-facing camera. There’s also a tiny sliver of bezel on the bottom. In a briefing, a Samsung rep proudly boasted that 83 percent of the front of the device is screen.</p>",
            "<p>The S8 comes in two sizes, the 5.8-inch Galaxy S8 and the 6.2-inch Galaxy S8 Plus. Both are 2960 x 1440. For those who care, the S8 has a pixel density of 570 per inch, while the S8 Plus has a pixel density of 529 per inch. </p>",
            "<p>While we have no idea how that extra screen is going to affect battery life (more screen usually means less battery) the effect is striking. This <em>looks</em> like a very pretty phone from the front.<strong> </strong></p>",
            "<p>In addition to hacking away at the bezel, Samsung also killed the Home button. If you want a dedicated little nubbin on the front of your phone you can finger blindly while it’s still in your purse or pocket, then you’ll need to invest in another phone.<br></p>",
            "<p>The S8's Home button, as well as the Back and Menu buttons, are now entirely software based, as they are on the Google Pixel.</p>",
            "<p>Last year, Samsung had a very nice looking blue phone that suggested a little color was finally creeping into the phone market. Other phone makers followed suit—Apple even released a bright red phone earlier this month. <br></p>",
            "<p>Unfortunately, the new S8 will only be available in three colors in the US, and they’re a profoundly boring gray, black, and silver.</p>",
            "<p>Killing the bezel and the home button means there’s no room for a fingerprint scanner on the front of the S8. Rather than do away with the fingerprint scanner entirely (the S8 can also be secured with your eye iris or your face), Samsung moved the button to the back of the phone.<br></p>",
            "<p>It’s right next to the 12-megapixel rear camera, which means you’ll probably be getting greasy finger oil all over the camera lens as you blindly try to open your phone with a tap.</p>",
            "<p>One of the biggest surprises today is Dex, a dock you hook up to your monitor and keyboard that lets you turn the S8 into a tiny, slick, desktop computer. This is something Android phone makers have been promising us for years. Back in 2011 Motorola <a href=\"http://gizmodo.com/motorolas-atrix-android-phone-twin-cpu-cores-and-a-lap-5725505\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'http://gizmodo.com/motorolas-atrix-android-phone-twin-cpu-cores-and-a-lap-5725505', {metric25:1})\">even launched a phone with a dock that doubled as a laptop</a>. But <a href=\"http://gizmodo.com/motorola-quietly-kills-off-webtop-5949775\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'http://gizmodo.com/motorola-quietly-kills-off-webtop-5949775', {metric25:1})\">that thing was a failure</a>. It was slow and the desktop version of Android was unappealing and cheap feeling.<br></p>",
            "<p>The S8 has a super-fast, 10nm-based processor (depending on what country you live in, it’s a Snapdragon 835 or a Samsung-built processor unit) so it is, in many ways, faster than many of the processors found in ultra budget Windows and Linux PCs.</p>",
            "<p>Samsung’s S8 desktop computer experience seems very natural. You just drop the phone into the Dex dock, which uses NFC to to launch the desktop mode—no fiddling with plugging anything in. The desktop experience strongly resembles Windows—a nice change of pace from the <a href=\"http://gizmodo.com/samsungs-new-ipad-pro-is-just-fantastic-1793506966\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'http://gizmodo.com/samsungs-new-ipad-pro-is-just-fantastic-1793506966', {metric25:1})\">desktop version of Android on the Galaxy Tab S3</a>. And if you, like me, don’t really like Android for heavy-duty computing, then the Dex also has a virtual Windows 10 solution. That’s intended for businesses, which often  force their employees to stream Windows 10 from a central server, but it should work for regular people too.</p>",
            "<p>Samsung is now competing with the big boys when it comes to AI in a phone. Bixby is Samsung’s answer to Apple’s Siri and Google’s Assistant. Like those phone AIs, Bixby can be activated by voice or by touching an activation button (Samsung is very proud of its button).<br></p>",
            "<p>We’re not sure how smart Bixby is compared to Siri or Assistant just yet, but we do know it can translate 52 spoken languages. Siri does around 30. Google does not have an official estimate for how many languages Assistant translates, but it’s approximately the same number as Siri.</p>",
            "<p>Besides acting as a kind of universal translator, Bixby can also search for things via photo—something Siri is incapable of and Assistant struggles with. It also automatically delivers any requested information via a much more attractive card than the display that pop up when using Assistant or Siri.</p>",
            "<p>We won’t be sure how smart Bixby is until we get some more time with it, but on paper, it appears to be a worthy adversary to the two titans of mobile AI.</p>",
            "<p>Bixby’s image recognition ability appears to be pretty incredible. With a quick button press Bixby opens the camera and asks to be pointed at whatever needs identifying.<br></p>",
            "<p>We pointed the phone at a backpack and it instantly found bags a similar color. But Bixby is not infallible. We tried to get it to look at a Samsung Galaxy S8, at the time still a device made up of leaks and rumors, and it struggled to identify itself, and instead pulled up the ancient LG G2. </p>",
            "<p>Besides announcing a new phone and a new AI, Samsung also took the time to announce some VR news. Mobile VR is where most of the VR sales are happening, so it makes sense that Samsung would continue to embrace the medium—even if most consumers really haven’t. </p>",
            "<p>The two big updates are a controller for the Oculus-powered Gear VR headset, and an updated 360 camera. The old Gear 360 camera resembled a golf ball, but the new one looks more like a golf ball on a tee, as the stand is now built in.</p>",
            "<p>Meanwhile the Gear VR controller resembles another Android product—specifically, <a href=\"http://gizmodo.com/googles-vr-headset-is-so-comfortable-i-never-want-to-ta-1788778192\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'http://gizmodo.com/googles-vr-headset-is-so-comfortable-i-never-want-to-ta-1788778192', {metric25:1})\">Google’s Daydream controller</a>. It also seems to function like the Daydream controller: It’s got a touch pad for navigation and a trigger for blasting aliens or clicking on menus, as well as some spatial awareness.</p>",
            "<p>The Gear VR controller runs on Bluetooth and Samsung claims you will get nearly 30 to 40 days of use out of the two AA batteries inside, provided you only play about two hours a day. The controller will ship with all new Gear VR headsets, but Samsung promises a version sold independently for current Gear VR owners who want to upgrade. </p>",
            "<p>My personal favorite announcement today isn’t the bezel-free phone, or the Siri clone. It’s the work Samsung is doing in the smart home space. Samsung announced a bevy of smart TVs and appliances at CES back in January, and today it announced a <a href=\"http://gizmodo.com/how-to-buy-the-right-router-and-save-your-internet-1791514069\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'http://gizmodo.com/how-to-buy-the-right-router-and-save-your-internet-1791514069', {metric25:1})\">mesh router system</a>.<br></p>",
            "<p>There’s no word on pricing, but the Samsung Connect Home and Samsung Connect Home Pro are both 802.11 AC mesh routers with a Samsung SmartThings hub built in—the only difference being the Connect Home Pro has a larger 4x4 antenna versus the perfectly adequate 2x2 antenna in the regular connect. The built-in Samsung SmartThings hub connects all Samsung smart devices, as well as support for a ton of smart lights, shades, and thermostats.</p>",
            "<p>And to control all those devices you can use a Google Home or Amazon Echo, or you can use Bixby on your S8, or you can use the smart home app, which is integrated directly into the S8's notification menus.</p>",
            "<p>Smart homes rely on a unified ecosystem, and at the moment, Samsung appears to have the most robust one.</p>",
            "<p><strong>Update 11:47am EST:</strong> Samsung did not initially announce price. Updated to add price.<br></p>"
        ]
    }
]