[
    {
        "title": "\n\t\tNokia 7.1 vs. Honor 8X vs. Moto G6: Budget phone battle royale\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>If you’re shopping for a new Android smartphone and you don’t want to spend too much, then you’re spoiled for choice right now. There are lots of attention-worthy options on the market that won’t break the bank. The Moto G6 is probably the best known, but the Honor 8X has an awful lot to offer, and the Nokia 7.1 is an exciting new contender.</p>",
            "<p>We decided to pit these three relatively <a href=\"https://www.digitaltrends.com/mobile/best-cheap-smartphones/\">cheap phones</a> against each other to find out which is best in various categories. In the end, there can be only one winner.</p>",
            "<p>These three phones are very different in the processor department. The Moto G6 trails the pack with a Qualcomm Snapdragon 450, the Honor 8X is faster with Huawei’s Kirin 710 inside, but the Qualcomm Snapdragon 636 in the Nokia 7.1 is the best performer. The G6 offers 32GB of storage with 3GB of RAM, or 64GB of storage with 4GB of RAM — we definitely recommend the slightly more expensive, higher capacity model if you can get it. Honor’s 8X is backed by 4GB of RAM with 64GB of storage or 6GB of RAM with a whopping 128GB of storage. The Nokia 7.1 has 4GB of RAM and 64GB of storage. All three have a MicroSD card slot for expansion. The only one we have minor qualms about in the performance department is the lowest capacity Moto G6, which isn’t as smooth as we’d like when switching between apps.</p>",
            "<p>All three of these phones have decent sized batteries in them that will see you through a normal day with change. The Honor 8X has the biggest battery by a distance, but it also has a much bigger display, so we expect that to balance out. We’re pleased to see fast charging support out of the box for the Moto G6 and Nokia 7.1, but the Honor 8X loses points here. Sadly, wireless charging hasn’t filtered down to budget phones yet.</p>",
            "<p><strong>Winner: Nokia 7.1</strong></p>",
            "<p>A glance at these phones is enough to make you realize how far budget phone design has come in the last couple of years. We’re seeing design trends like glass backs, metal frames, and highlights, and <a href=\"https://www.digitaltrends.com/mobile/bezel-less-phone-comparison/\">shrinking bezels</a> reach well beyond the top tier now. It used to be easy to pick the budget phone out of a lineup, but that’s no longer the case. The Moto G6 is the oldest phone here and it shows. We’ve never been keen on the big, signature round camera module on the back and it still has sizable bezels with a fingerprint sensor on the front. Both Nokia and Honor have shrunk the bezels right down, <a href=\"https://www.digitaltrends.com/mobile/why-are-android-phone-makers-embracing-the-notch/\">embraced the notch</a>, and moved the fingerprint sensor onto the back.</p>",
            "<p>We’re fans of the bright red finish on the Honor 8X, which dances in the light, and it looks nice in blue, too, but it is important to note that this is a very big phone that can be tricky to manage one-handed. The Nokia 7.1 has adopted the notch, but that allows for a relatively large screen in a compact device and we love the copper highlights in the white “steel” version. Both the Honor 8X and the Nokia 7.1 are beautiful budget phones, but Nokia edges the win.</p>",
            "<p><strong>Winner: Nokia 7.1</strong></p>",
            "<p>While the Honor 8X wins on size, it also has the least sharp display here, but the quality is good. The Moto G6 is a decent middle ground, though we did feel it lacked brightness during our testing. The Nokia 7.1 runs away with this category. The 5.8-inch PureDisplay in the Nokia 7.1 has a wide 19:9 aspect ratio and support for HDR10, which is a real rarity in budget phones. It even upscales standard definition content and adjusts, not just brightness, but also contrast to match your environment and stay legible. If size is the most important thing to you, then the Honor 8X is going to be your pick, but the best display here belongs to the Nokia 7.1.</p>",
            "<p><strong>Winner: Nokia 7.1</strong></p>",
            "<p>Another trend that has filtered down to budget phones is dual lens cameras. The Moto G6 pairs a 12-megapixel lens with a 5-megapixel lens, as does the Nokia 7.1. Both also have 8-megapixel front-facing cameras. The Honor 8X is a little different, pairing a 20-megapixel and 2-megapixel lens on the back and boasting a 16-megapixel selfie-camera. The adoption of dual lenses allows for a better bokeh effect, where your subject is in sharp relief and the background is blurred. All three offer support for HDR, but the Zeiss optics and speedy phase detection autofocus in the Nokia 7.1, give it an edge. You can also take shots with the front-facing and rear cameras simultaneously with “bothie” mode on the Nokia. The Honor 8X is inconsistent, but when it nails a shot it does really well and it offers good bokeh, slow-motion video, and a night mode for low-light shots. Both are generally better than the Moto G6, but we need more time with the Nokia 7.1 to decide whether it’s better than the Honor 8X.</p>",
            "<p><strong>Winner: Tie between Nokia 7.1 and Honor 8X</strong></p>",
            "<p>We used to appreciate the extras that Motorola added to its phones, and it tended to exercise a light touch in the past, but with the Moto G6 we saw more bloatware creep in on top of Android 8.0 Oreo and updates have begun to slow under Lenovo’s watch. The Honor 8X comes with the slightly newer Android 8.1 Oreo, but it has the EMUI on top, which can take some getting used to. The Nokia 7.1 is an Android One phone, which means it runs <a href=\"https://www.digitaltrends.com/mobile/what-is-stock-android/\">stock Android</a> as Google intended. It is launching with Oreo, but <a href=\"https://www.digitaltrends.com/mobile/android-9-pie-review/\">Android 9.0 Pie</a> update is scheduled for the end of November and it’s guaranteed to get monthly security updates for at least three years and version updates for at least two years.</p>",
            "<p><strong>Winner: Nokia 7.1</strong></p>",
            "<p>We like Moto Actions on the Moto G6, which offers some useful gesture shortcuts such as the ability to turn the phone over to mute it. The Honor 8X has a handy comfort mode that <a href=\"https://www.digitaltrends.com/mobile/does-blue-light-ruin-sleep-we-ask-an-expert/\">reduces blue light from the screen</a>, which is ideal when you’re reading in bed. There are also A.I. options in the camera, though we’re not convinced that the AI always improves shots. The Nokia 7.1 is mercifully free of gimmickry and bloatware, with the HDR display taking top billing as a standout feature that should attract to you to this phone.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The base model of the Moto G6 is a very reasonable $250. We’re not sure about the price for the Honor 8X as it has yet to get a U.S. or European release, though based on prices elsewhere we think it will be between $200 and $280. If you import there might be some other costs to pay. The Nokia 7.1 is a bit more expensive at $350, but it’s widely available at Best Buy stores and from a number of online retailers.</p>",
            "<p>It has the best design, the best display, the fastest performance, and offers the best software experience: Picking the Nokia 7.1 as our winner is easy, but it also costs significantly more than the Moto G6 and the Honor 8X. The good news here is that all three are decent phones that represent great value for money. The days where Moto’s G series ruled the budget roost are gone, because we’d place it last here, though if you live outside the U.S. and can get your hands on a <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-plus-review/\">Moto G6 Plus</a>, it’s a better match for these contenders.</p>"
        ]
    },
    {
        "title": "\n\t\tMoto E5 Plus vs. E5 Play: Which budget phone is the better value?\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>There’s no doubt about it: Lenovo-owned Motorola makes an excellent budget phone. This year, the smartphone manufacturer released four new budget phones: The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-review/\">Moto G6 Plus</a>, G6 Play, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-e5-plus-review/\">E5 Plus</a>, and E5 Play. While Moto’s G-series tends to get the lion’s share of coverage, the E5 Plus and E5 Play are impressive phones in their own right.</p>",
            "<p>Although the Moto E5 Plus and E5 Play share many of the same specs, there are a few key differences between the two. Do these differences make the Moto E5 Plus worth the extra money? We put the two head-to-head to find out.</p>",
            "<p>At first glance, the differences between the Moto E5 Plus and E5 Play seem minimal. Look closer, however, and you’ll find those small differences start to add up in the favor of the Moto E5 Plus.</p>",
            "<p>First and foremost are the differences in storage and RAM. On the Moto E5 Play, you’ll find a paltry 16GB of onboard storage and 2GB of RAM. The Moto E5 Plus, on the other hand, ships with 32GB of storage and a less anemic 3GB of RAM.</p>",
            "<p>Since Android 8.0 Oreo uses upwards of 10GB of storage, the Moto E5 Play has very little room left to spare. And with just 2GB of RAM, we’d expect to see some lag when multitasking on the Play model. On the other hand, the additional RAM on the Moto E5 Plus should keep things running a little more smoothly.</p>",
            "<p>In terms of battery capacity, the Moto E5 Plus wins by a long shot. With a 5,000mAh battery, we expect the Moto E5 Plus to have no problem getting the most demanding users through an entire day. If the phone is anything like the Moto E4 Plus, most people will have no problem making it through two days.</p>",
            "<p>Although the battery on the Moto E5 Play is significantly smaller at 2,800mAh, we still think it should see the average person through the day. The E5 Play also has an additional perk you won’t find on the Plus: An interchangeable battery. Power users will love having the option to hot swap batteries if necessary.</p>",
            "<p>You’ll also find a difference in charging speed between the two phones. While both the Moto E5 Plus and E5 Play have a fast-charging option, the Plus model features Lenovo’s proprietary TurboCharge technology.</p>",
            "<p>In terms of performance and battery, the Moto E5 Plus takes the category by a wide margin. While you should be able to get by on the Moto E5 Play, the upgraded hardware on the E5 Plus will make the experience much less frustrating.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/32d677abc3ada7cd9ec7c76a2e9aa6b9381aeea6/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto E5 Plus</a></strong></p>",
            "<p>Although the Moto E5 Play and E5 Plus share a lot of the same specs, design is one key area where the two diverge. While the Moto E5 Play has the polycarbonate body we’ve come to expect from a budget phone, the design of the E5 Plus is much more refined.</p>",
            "<p>The Moto E5 Plus features a 6-inch IPS display with reduced bezels. Flip the phone over and you’ll find a gorgeous glass body with a centered camera lens above the Moto logo. While the glass body on the Moto E5 Plus is stunning, there’s one big caveat: The body is constructed out of polymer glass as opposed to Gorilla Glass or other hardened glass. Although we assume the decision to use polymer glass was in order to keep the price down, the decision comes at the expense of durability.</p>",
            "<p>On the Moto E5 Play, you’ll find a design that’s much more reminiscent of a budget phone. The Play features a 5.2 inch LCD screen with some pretty chunky bezels. When you flip the phone over, you’ll find a pretty utilitarian polycarbonate shell covering the interchangeable battery. While it’s definitely not as sleek as the Moto E5 Plus, the E5 Play is much more likely to weather an accidental drop.</p>",
            "<p>Although both phones have some hits and misses in terms of design overall the Moto E5 Plus is a much more attractive phone. In terms of durability, however, we’re concerned the polymer glass body on the E5 Plus. You’ll want to snag a case if you opt for the E5 Plus.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/32d677abc3ada7cd9ec7c76a2e9aa6b9381aeea6/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto E5 Plus</a></strong></p>",
            "<p>When you compare the front of the Moto E5 Plus to the E5 Play, the first thing you’ll notice is the size difference. The E5 Plus features a massive 6-inch display, while the E5 Play sports a smaller 5.2-inch display. While you’d expect that difference in size to translate into a larger overall footprint for the E5 Plus, its reduced bezels mean the size difference actually isn’t that significant.</p>",
            "<p>Size isn’t the only difference, though. The Moto E5 Plus features an IPS display, while the E5 Play ships with a TFT LCD screen. The IPS display boasts more vibrant colors and better viewing angles. There isn’t much difference in resolution. The E5 Plus has a 1,440 x 720 pixel resolution, which gives it a pixel-per-inch density of 268. The E5 Play sports a 1,280 x 720-pixel resolution, which means it has a slightly sharper pixel density of 282, but that’s only because the screen is smaller. Make no mistake, the display in the E5 Plus is superior.</p>",
            "<p>Calling this round is easy: The larger IPS display on the Moto E5 Plus makes it the clear winner.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/32d677abc3ada7cd9ec7c76a2e9aa6b9381aeea6/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto E5 Plus</a></strong></p>",
            "<p>You’ll find a 12-megapixel rear camera with LED flash on the E5 Plus, while the E5 Play makes do with an 8-megapixel shooter. They both have an f/2.0 aperture, so don’t expect the phones to do great in low-light situations, but they should be fine in outdoor settings.</p>",
            "<p>On the front, you’ll find an 8-megapixel camera with an f/2.2 aperture on the E5 Plus, while the E5 Play sports a basic 5-megapixel selfie camera.</p>",
            "<p>Both phones feature pretty standard camera software. You’ll be able to shoot slow-motion videos, take burst shots, and use the built-in QR code scanner. One thing that is missing are beauty filters, but the feature is so hit-or-miss on most phones that we don’t see it as an important omission.</p>",
            "<p>The E5 Plus is clearly superior in the camera department.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/32d677abc3ada7cd9ec7c76a2e9aa6b9381aeea6/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto E5 Plus</a></strong></p>",
            "<p>In terms of software, there’s no difference between the Moto E5 Plus and E5 Play. Both phones will ship with Android 8.0 Oreo. Although Android P is scheduled to be released in a few months, don’t expect to see it on the Moto E5 Plus and E5 Play: A representative for Lenovo told Digital Trends that neither phone is scheduled to be updated to Android P.</p>",
            "<p>Although you may see a smoother overall experience on the Moto E5 Plus due to its extra gigabyte of RAM, the software on both phones is exactly the same. Since we’re only judging software in this category, we’ll call this category a tie.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>Since Moto phones tend to ship with a near stock version of Android, there aren’t a ton of special features to explore. Two features of note are Moto Actions and Moto Voice.</p>",
            "<p>Moto Actions allows you to configure a pretty robust set of gestures on the Moto E5 Plus and E5 Play. For example, if you want to turn on Do Not Disturb mode, you simply need to flip the phone over. As for Moto Voice, the feature allows you to use voice commands to initiate tasks like finding your phone or opening an app.</p>",
            "<p>both phones offer the same special features, so this round is a tie.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>Both the Moto E5 Plus and E5 Play are budget phones that should be reasonably priced. While we don’t have exact pricing on either model yet, Lenovo typically uses the Play moniker on its least-expensive phones.</p>",
            "<p>Even though we’re anticipating the Moto E5 Plus to be the more expensive of the two phones, we believe the small premium will definitely pay off in the long run.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/32d677abc3ada7cd9ec7c76a2e9aa6b9381aeea6/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto E5 Plus</a></strong></p>",
            "<p>Both the Moto E5 Play and E5 Plus look to be good budget phones for 2018. But we’re going with the Moto E5 Plus. While it’s likely to be a little more expensive than the E5 Play, the extra features add a lot of value that we believe outweighs the difference in price.</p>"
        ]
    },
    {
        "title": "\n\t\tMoto E5 Plus vs. Moto E4 Plus: Battle of the ultra-budget Motos\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>The Moto G series may make the most headlines when it comes to Motorola’s budget handset lineup, but there’s another series that offers arguably even better value for money — the E-series.</p>",
            "<p>At the same time it unveiled the new Moto G6, the company also announced the new <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-e5-plus-review/\">Moto E5 Plus</a>. How does it stack up against last year’s Moto E4 Plus? Is it really much of an upgrade? We put the two phones head to head to find out.</p>",
            "<p>The first thing to notice about a new phone is how it performs. While the Moto E4 Plus features a MediaTek MT6737, the Moto E5 Plus instead went with a Qualcomm Snapdragon 435 processor. The two chips perform similarly, but the Snapdragon 435 should be slightly faster than the MediaTek chip. Both phones feature 3GB of RAM. When it comes to storage, the new Moto E5 Plus features 32GB, while the older device offers either 16GB or 32GB.</p>",
            "<p>Both of these phones feature pretty huge batteries, too. You get a 5,000mAh battery in both the Moto E4 Plus and the Moto E5 Plus, and it should get you through more than a day of solid use. Then there’s charging, and the new Moto E5 Plus boasts 15W TurboPower, which should get you 6 hours of use in 15 minutes of charging. The Moto E4 Plus, on the other hand, offers 10W “rapid charging,” so the newer phone should charge a little quicker.</p>",
            "<p>The Moto E4 Plus and Moto E5 Plus are similar — but we expect the Moto E5 Plus to perform a little better, and charge a little faster.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/32d677abc3ada7cd9ec7c76a2e9aa6b9381aeea6/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto E5 Plus</a></strong></p>",
            "<p>Motorola has updated its design sensibility for 2018, and the new phone looks much more modern. Like other Moto phones, it features an 18:9 aspect ratio, plus it offers a glass back and the now standard large camera module on the back. The glass back is something that helps make the phone look much more modern — the Moto E4 Plus uses metal instead.</p>",
            "<p>One major difference between these two phones is that the Moto E4 Plus retains a home button under the display, while the Moto E5 Plus instead uses software buttons and moves the fingerprint sensor to the back. Thankfully, both phones have a headphone jack, and both have a MicroUSB port, too — though we hope Motorola will move to USB-C in the next iteration.</p>",
            "<p>When it comes to durability, we think it’s likely that the Moto E4 Plus will be the tougher option. Neither of the two have water-resistance, but given the metal back on the Moto E4 Plus compared to the glass on the Moto E5 Plus, it should fare better when dropped.</p>",
            "<p>We think the Moto E5 Plus is a much better-looking phone, but the Moto E4 Plus is probably slightly more durable.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/32d677abc3ada7cd9ec7c76a2e9aa6b9381aeea6/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto E5 Plus</a></strong></p>",
            "<p>Both the Moto E4 Plus and the Moto E5 Plus feature a 720p display, but considering the aspect ratio on the Moto E5 Plus, 720p translates to a slightly different resolution. They also feature different screen sizes — so the pixel density is also a bit different.</p>",
            "<p>For starters, the Moto E4 Plus offers a 5.5-inch display with a resolution of 1,280 x 720 pixels, which translates to a pixel density of around 267 pixels per inch. The Moto E5 Plus, on the other hand, offers a 6-inch display with a resolution of 1,440 x 720 pixels, giving it a pixel density of 268.</p>",
            "<p>Given the fact that the pixel density is pretty much the same, the larger screen size makes the Moto E5 Plus the winner here.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/32d677abc3ada7cd9ec7c76a2e9aa6b9381aeea6/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto E5 Plus</a></strong></p>",
            "<p>Both of these phones feature the Moto-style camera module, but the cameras are slightly different. The camera on the Moto E4 Plus comes in at 13 megapixels with an aperture of f/2.0, while the Moto E5 Plus’ camera comes in at 12 megapixels, also with an f/2.0 aperture. In general, the E5 Plus offers more features than the E4 Plus, including phase detection autofocus, HDR, and more. The front facing camera on the E4 Plus comes in at 5 megapixels, while the E5 Plus steps things up to 8 megapixels.</p>",
            "<p>We’re going to have to wait and see just how the camera on the Moto E5 Plus performs in the real world, but it’s likely to be an improvement over its predecessor. While we expect the Moto E5 Plus to perform better, despite its lower megapixel count, budget handsets can sometimes surprise you in terms of how poor their cameras are. We’ll call this a tie for now.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The Moto E4 Plus ships with Android 7.1.1 Nougat, while the Moto E5 Plus instead ships with the newer <a href=\"https://www.digitaltrends.com/mobile/android-o-news/\">Android 8.0 Oreo</a>. We don’t expect the Moto E4 Plus to get updated to Android 8.0 anytime soon, and Motorola has outright said that the E5 Plus won’t be getting any major software updates. In other words, if you’re looking forward to <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android P</a>, neither of these two phones are for you. The phones will, however, still get security updates.</p>",
            "<p>Moto phones feature almost stock Android, but the company does add a few extra features to the software. For example, the phones have Moto Actions, which allow for you to open apps and control software through gestures — like double twisting your wrist to open the camera.</p>",
            "<p>Given the fact that the Moto E5 Plus features a newer version of Android, it’s the winner here.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/32d677abc3ada7cd9ec7c76a2e9aa6b9381aeea6/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto E5 Plus</a></strong></p>",
            "<p>When it comes to special features, there really isn’t much to report. They both feature Moto Actions — though given the fact that the Moto E4 Plus has a home button, it offers one-button navigation, meaning you can use gestures to control the phone rather than using the software buttons. Both phones offer other Moto Actions, and they could be helpful to some users.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The Moto E5 Plus comes in at $290 while its predecessor is available for $180. Although the specs and design have been updated for 2018, the steep price increase is tough to swallow.</p>",
            "<p>The Moto E5 Plus is simply the better phone here. It’s more powerful, has a more attractive, modern design, and boasts a larger display. Of course, that doesn’t mean the Moto E4 Plus isn’t worth buying — and if your budget is tight then look out for an E4 Plus price drop when the E5 Plus lands.</p>"
        ]
    },
    {
        "title": "\n\t\tMoto E5 Plus and Play are solid budget phones that won’t get Android Pie\t",
        "author": [
            "\n\t\t\t\t\t\tBrenda Stolyar\t\t\t\t\t"
        ],
        "text": [
            "<p>The Moto G series may steal all the kudos when it comes to Motorola’s budget lineup, but there’s a handset that arguably offers even better value for the money than the <a href=\"https://www.digitaltrends.com/android/lenovo-moto-g6-news/\">new Moto G6</a> — the also-new Moto E5. Motorola has finally take the wraps off of the new E-series, including the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-e5-plus-review/\">Moto E5 Plus</a> and Moto E5 Play, and the standard Moto E5.</p>",
            "<p>The new phones offer decent specs and performance at an exceptionally low price. Here’s everything you need to know about the new Moto E5, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-e5-plus-review/\">Moto E5 Plus</a>, and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-e5-play-review/\">Moto E5 Play</a>.</p>",
            "<p>Both the Moto E5 Play and Moto E5 Plus have been available in the U.S. for some time, but now the standard Moto E5 will be joining those devices. It is now available from Best Buy, and will also be offered by Target starting on October 14 and Walmart on October 15. It costs $100.</p>",
            "<p>The Moto E5 Play and Moto E5 Plus aren’t available unlocked, but can be purchased through a variety of carriers — all of which charge different prices. It’s also important to note that on the Moto E5 Play, whether or not the fingerprint sensor is included depends on the carrier.</p>",
            "<p>The most recent carrier to offer the E5 Plus and E5 Play<a href=\"https://www.t-mobile.com/cell-phone/motorola-moto-e-play-5th-gen\" target=\"_blank\" rel=\"noopener\"> is T-Mobile</a> — a gray E5 Play and blue E5 Plus. The E5 Play will cost you $150 or you can opt to finance it for $6 down and $6 per month for 24 months, but it doesn’t come with a fingerprint sensor. As for the <a href=\"https://www.t-mobile.com/cell-phone/motorola-moto-e-plus-5th-gen\" target=\"_blank\" rel=\"noopener\">Moto E5 Plus</a>, you can purchase it in full for $225 or put $9 down and pay $9 per month for 24 months.</p>",
            "<p>You can also find the Moto E5 Plus at Boost Mobile and Cricket Wireless. On Boost Mobile, it will cost you $150, while on Cricket, it costs $180. It will cost you $288 on Sprint.</p>",
            "<p>If you want to pick up the Moto E5 Play, you can find it at on a number of prepaid carriers in the U.S., including Verizon Wireless, Boost Mobile, Cricket Wireless, and Virgin Mobile.</p>",
            "<p>At Verizon, you you can pick up the <a href=\"https://www.verizonwireless.com/prepaid/smartphones/moto-e5-play-prepaid/\">E5 Play for just $70</a>. Under Cricket Wireless, it’s known as the Moto E5 Cruise and will only cost you $40 — if you sign up for a new line or upgrade your existing device. As for Boost Mobile, the E5 Play goes for $80. It’s also pricier on Xfinity Mobile at $120. At Best Buy, it ranges from $95 to $130 depending on the carrier it’s locked in with.</p>",
            "<p>Not in the U.S.? You can check out the <a href=\"https://blog.motorola.com/2018/04/19/unlimit-yourself-with-the-new-moto-g6-and-moto-e5/\">Moto website</a> to find details for your country.</p>",
            "<p>The Moto E5 Plus and Moto E5 Play feature slightly different designs. While the E5 Plus looks similar to the new Moto G6, with its 18:9 aspect ratio, the E5 Play features a slightly older-looking design — which one might expect from such an inexpensive phone. The standard Moto E5’s design is similar to the Moto E5 Plus, but is a little smaller.</p>",
            "<p>All of the phones feature the recently adopted and now standard Motorola camera bump on the back, and they both also offer a rear-mounted fingerprint sensor embedded in the Motorola logo. The display on the Moto E5 Plus comes in at 6 inches with a resolution of 1440 x 720, while the E5 Play’s display comes in at 5.2 inches with a 720p resolution. The standard Moto E5’s display is 5.7 inches with a 720p resolution.</p>",
            "<p>Another thing that users of the Moto E5 Play might like is the fact that it has a removable back and battery. It’s the only new Moto phone that can do that, which means you can carry extra batteries to use if you need them.</p>",
            "<p>While different, they’re definitely not bad-looking phones. They both come in a range of different colors, too, which is a nice touch.</p>",
            "<p>Under the hood, the phones are decidedly budget-focused — but that doesn’t mean that they’re no good. The standard Moto E5 comes with the Qualcomm Snapdragon 825 processor, along with 2GB of RAM and 16GB of storage — though thankfully there’s a MicroSD card slot for those that want to expand upon that storage. The battery capacity on the phone sits in at 4,000mAh, while the rear-facing camera has a resolution of 13 megapixels.</p>",
            "<p>The Moto E5 Plus features a Qualcomm Snapdragon 435 processor, coupled with 3GB of RAM and 32GB of storage — though if you want to expand upon that storage, you can do so via the MicroSD card slot. It also has an absolutely massive 5,000mAh battery, which is pretty huge. The device also offers a 12-megapixel rear-facing camera with an aperture of f/2.0, along with an 8-megapixel front-facing camera.</p>",
            "<p>The Moto E5 Play features either a Snapdragon 425 or 427 processor, coupled with 2GB of RAM and 16GB of storage. Like the E5 Plus, the E5 Play features a MicroSD card slot, so you can expand on that storage by up to 128GB if you choose. Unlike the E5 Plus, the E5 Play’s battery isn’t huge — but it’s not tiny either. The 2,800mAh battery should get you through a day of use pretty easily. The E5 Play also offers a slightly lower-resolution camera. The rear-facing camera comes in at 8 megapixels, while the front-facing camera is 5 megapixels.</p>",
            "<p>The software is set to be one of the major frustration points for this phone. Why? It won’t be updated. While the device does ship with Android 8.0 Oreo, Motorola says that it will not be updating any of the Moto E5 phones with any new versions of Android, so if you’re looking forward to <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android P</a>, then this may not be the phone for you.</p>",
            "<p><em>Updated on October 8, 2018: The standard Moto E5 is coming to the U.S.</em></p>"
        ]
    },
    {
        "title": "\n\t\tMoto G6 vs. Honor 7X: Which is the better budget phone?\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>The Moto G series from Lenovo-owned Motorola has dominated the budget smartphone scene for a few years now, but we were blown away by the amazing value offered by the Honor 7X last year.</p>",
            "<p>Now it’s 2018 and the Moto G6 has been unveiled with some nifty extras and a modern makeover. How does one of the best budget options from last year stand up to it? We decided to compare the two to find out.</p>",
            "<p>The Moto G6 has Qualcomm’s Snapdragon 450 processor inside, and that’s backed up by 3GB or 4GB of RAM. We expect it to be a smooth performer that should meet most people’s needs. The Honor 7X is packing a HiSilicon Kirin 659 processor and, once again, comes with 3GB or 4GB of RAM. We found it to be generally zippy, though it occasionally struggled with graphically challenging games. We need some more hands-on time with the G6, but benchmarks so far reveal pretty similar performance for these phones. Both come with 32GB or 64GB of storage on board and room to expand via a MicroSD slot.</p>",
            "<p>With a 3,000mAh battery, the Moto G6 should have plenty of stamina, and when it’s time to chargeit,  Motorola’s TurboPower technology can deliver up to 15W, giving you hours of battery life in minutes. The Honor 7X has an even bigger 3,340mAh battery, but it doesn’t support fast charging, so it will take considerably longer to charge up than the G6. Sadly, wireless charging has not reached the budget end of the market yet. This one’s closer than you might expect, so we’re going to call it a tie for now.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>With that big, rounc signature camera module on the back, you instantly know that the Moto G6 is a Motorola phone. The back is made of curved glass. and there’s still a recessed glass fingerprint sensor on the front, though the bezels have been slimmed down and the screen elongated compared to last year’s Moto G5. The best design change is the switch to USB-C for the charging port, which is reversible and allows for faster charging. The glass is not going to be particularly durable, but there is a <a href=\"https://www.digitaltrends.com/mobile/ask-an-expert-waterproof-phones-mwc-2017/\">P2i water-repellent coating</a> that should guard against rain and splashes.</p>",
            "<p>The Honor 7X has a curved aluminum body with two camera lenses at the top of the back and an indented fingerprint sensor further down. The front of the phone is all glass with the Honor logo on the bottom bezel. In addition to the tougher metal body, Honor has designed air pockets into the corners to reduce the risk of drop damage. Unfortunately, the 7X lacks water resistance and still relies on a Micro USB port for charging. Both phones have a 3.5mm audio jack.</p>",
            "<p>This is a narrow win for the G6, but some people will prefer the design of the Honor 7X, so try to get hands on with them before you decide.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/f20059bf36aede15debccec8ace31d468d9a343e/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto G6</a></strong></p>",
            "<p>This neck-and-neck competition doesn’t get any clearer when we move on to display. The Moto G6 has a 5.7-inch IPS LCD with a resolution of 2,160 x 1,080 pixels, which translates to 424 pixels per inch. The Honor 7X has a 5.93-inch IPS LCD, also with a resolution of 2,160 x 1,080 pixel, which translates to 407 pixels per inch. The 18:9 aspect ratio is standard now, even for budget phones. The G6 is slightly sharper, but slightly smaller. Both are decent and perfectly readable, but lack the brightness levels you’ll find in more expensive phones.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The deadlock continues as we find dual lens cameras in both these phones. The Moto G6 pairs a 12-megapixel lens with a 5-megapixel lens, while the Honor 7X opts for a 16-megapixel and 2-megapixel combo. Both have 8-megapixel front-facing cameras. The dual lens setup allows for portrait modes and a bokeh effect that blurs the background, though, as you’d expect, neither of these phones achieves it with the same style as the latest flagships. We need a bit more time to see how good the Moto G6 camera is, but it should be slightly better than the camera in the 7X.</p>",
            "<p>One clear advantage with the G6 is the ability to record 1080p video at 60 frames per second. It’s also capable of slow motion and time lapse videos. The Honor 7X can only manage 1080p at 30 frames per second and lacks the slow motion option.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/f20059bf36aede15debccec8ace31d468d9a343e/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto G6</a></strong></p>",
            "<p>If you opt for the Moto G6, then you’ll enjoy the latest Android 8.0 Oreo out of the box. It’s a near stock Android experience, with just a few handy extras thrown in on top, such as Moto Actions, which enables gestures like the ability to wave your hand over the screen to see notifications. Motorola has already said that the Moto G6 will be upgraded to <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android P</a> when it comes out.</p>",
            "<p>By contrast the Honor 7X shipped with Android 7.1 Nougat and EMUI 5.1 over the top, which was a definite weak spot for the phone. It has since been updated to Oreo with EMUI 8.0, which is a major improvement, but it’s still a big step removed from the near stock Android on the G6 and definitely packs more bloatware. We don’t know if the Honor 7X will ever get Android P.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/f20059bf36aede15debccec8ace31d468d9a343e/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola \">Moto G6</a></strong></p>",
            "<p>There isn’t much to speak of in the special features department. The inclusion of dual lens cameras is probably the headline for budget phones like this. Both also offer some handy extras in the software, but there’s nothing that gives one a clear edge over the other.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>If you want to buy a Moto G6, then you’ll need to cough up $250. The Honor 7X is $50 cheaper at $200. The Moto G6 will work on all the major carriers, but it’s important to note that the Honor 7X lacks CDMA support, so it’s no use to you if you’re on Verizon or Sprint. We think $50 is quite a big gap at this end of the market, so this is an important win for the Honor 7X.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/06db4fd1f5461b3b9f13d636ace0349a8f137b44/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Honor\">Honor 7X</a></strong></p>",
            "<p>This was a surprisingly close contest considering that the Honor 7X came out at the tail end of last year and costs a full $50 less than the Moto G6. With the update to Oreo, the Honor 7X is still a compelling bargain. Budget aside, we think the Moto G6 is a slightly better phone, chiefly because we prefer the software and the camera, but the fast charging and USB-C are also important.</p>"
        ]
    },
    {
        "title": "\n\t\tMotorola Moto G7: Here’s everything we know\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Each spring, Lenovo wows us with its Moto G budget phone lineup, and it looks like 2019 will be no exception. We’re now much closer to seeing the new collection, and rumors are solidifying around specific leaks. Here’s everything we know about the Moto G7.</p>",
            "<p>The mother of leaks has befallen Motorola — it’s own Brazilian website has accidentally leaked the specs for the entirety of the upcoming Moto G7 range. <a href=\"https://www.cnet.com/es/analisis/motorola-moto-g7-primer-vistazo/\">According to CNET en Espanol</a>, the website accidentally published the whole range some time on the evening of January 22.</p>",
            "<p>So what have Motorola fans got to look forward to? Four models of the Moto G7 were advertised, and the Moto G7, G7 Play, and G7 Power all come equipped with the Snapdragon 632. The lone exception, the Moto G7 Plus, gets the more powerful Snapdragon 636 instead. The G7 and the G7 Plus will share a base storage of 64GB and 4GB of RAM, while the Play and Power will come with 32GB, and 2GB and 3GB of RAM respectively. All four models will have support for Micro SD cards.</p>",
            "<p>In terms of battery size, the only outlier is the Moto G7 Power, which comes with a hefty 5,000mAh battery capacity — hence the “Power” name. The other three models should be able to make do with 3,000mAh batteries.</p>",
            "<p>These leaks really put the cat amongst the pigeons, and finally help to pin down what’s been a tumultuous series of leaks for the G7 range. Whispers and rumors have been wildly inconsistent on the specs for the G7, from a <a href=\"https://browser.geekbench.com/v4/cpu/11683248\">rogue Geekbench result</a> that alleged the Snapdragon 625, and 3GB of RAM, to older filings with the Federal Communications Commission indicated both the G7 and G7 Plus would come with the Snapdragon 660, and come with 4GB of RAM.</p>",
            "<p>Even older hardware rumors on the upcoming Moto G7 and G7 Plus gleaned from the FCC website can also apparently be put to bed. These two hinged on listings for two model numbers,  <a href=\"https://fccid.io/IHDT56XR3\">XT1952-2</a> and <a href=\"https://fccid.io/IHDT56XN3\">XT1965-3</a>, which were believed to be the G7 and G7 Plus. The filings suggested the G7 and G7 Plus phones would have nearly identical specs. Both appear to have a Snapdragon 660 processor, 4GB of RAM, and 64GB of storage as a base option.</p>",
            "<p>According to the major leak from Motorola Brazil’s website, we can expect the Moto G7 to come with dual 12-megapixel and 5-megapixel lenses on the back of the phone, and an 8-megapixel selfie lens around the front. The G7 Play and G7 Power only rock a single rear sensor — a 13-megapixel and a 12-megapixel lens respectively — and share the same 8-megapixel selfie lens. The Moto G7 Plus is likely to be the photo juggernaut of the range, with a dual 16-megapixel and 5-megapixel selfie setup. There’s unfortunately no word on the rear camera setup on the Plus model yet, but we expect it to surpass the Moto G7’s setup.</p>",
            "<p>January 2019 saw the biggest leak yet, with <a href=\"https://www.androidauthority.com/motorola-moto-g7-specs-2-945821/amp/\">Motorola Brazil</a> accidentally releasing the Moto G7 range’s pages early.</p>",
            "<p>The leak confirms most of what we’d expected to be the case on the design front. Both the G7 and the G7 Plus will come with a 6.24-inch display and a 2,270 x 1,080-pixel resolution. The G7 Play will be the smallest with a 5.7-inch display and a 1,512 x 720 resolution, while the G7 Power will rock a 6.2-inch screen and a 1,520 x 720 resolution. Expect IPS LCD displays on all four.</p>",
            "<p>In December 2018, <a href=\"https://www.droidshout.com/moto-g7/\">Droid Shout</a> gave us our first glimpse of what we believe to be the entire Moto G7 lineup. It shows all four phones have a similar aesthetic, though the notch appears to be different on the regular Moto G7. While it may be a bit of a surprise the Lenovo would add the notch to the least expensive Play version of its budget phone, a leaked image from a Federal Communications Commission filing confirms the screen design.</p>",
            "<p>These images of the Moto G7 Play show a phone without the teardrop notch suggested for the G7 and G7 Plus, and also look to be using a plastic back, rather than a glass one. We’d expect nothing less of the more budget-focused G7 Play though, so it’s unlikely to be a deal-breaker for most buyers. The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-play-review/\">G6 Play</a>‘s chunky bezels have been slimmed down for the G7 Play, with a much smaller forehead and chin. According to the ruler in the first image, the Moto G7 Play looks to be a smaller overall package than the G6 Play. There’s still only a single-lens camera on the back, but it will come with a USB-C port.</p>",
            "<p>The Moto G7 and G7 Plus will sport a similar look. Renders of the phones, courtesy of Slashleaks, show the phones are a big departure from 2018’s <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-review/\">Moto G6</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-plus-review/\">G6 Plus</a>.</p>",
            "<p>Like their predecessors, the front of the G7 and G7 Plus appear to be all display, but now come with the addition of a notch and the removal of the front-facing fingerprint scanner. While it looks like the chin bezel will make a return appearance on the 2019 smartphones, the top bezel has been replaced with a teardrop notch.</p>",
            "<p>Both the G7 and G7 Plus appear to have a glass backplate, though it doesn’t look like there will be wireless charging. A prominent dual-camera array and fingerprint sensor sit toward the top center of the phones.</p>",
            "<p>Typically, we see three different G-Series phones each year. In addition to the standard handset, Lenovo creates a Plus model with higher-end specs, and a less-expensive Play edition. So should we expect this same in 2019? Definitely — and more. <a href=\"https://www.androidauthority.com/motorola-moto-g7-specs-2-945821/amp/\">Motorola Brazil’s leak</a> has confirmed Evan Blass’s statement that we’d see four models this year.</p>",
            "<p>In October 2018, respected mobile leaker Evan Blass tweeted we could expect to see four versions of the upcoming Moto G7. In addition to the typical players, Blass said there would also be a special Power Edition.</p>",
            "<p>Previously, <a href=\"https://www.mysmartprice.com/gear/moto-g7-plus/\">My Smart Price</a> posted a story stating there would only be two versions of the upcoming smartphone: The Moto G7 and Moto G7 Plus. That story seems to be wrong, as <a href=\"https://apps.fcc.gov/oetcf/eas/reports/ViewExhibitReport.cfm?mode=Exhibits&amp;RequestTimeout=500&amp;calledFromFrame=Y&amp;application_id=K%2B%2BgaT0uswtT3nuwIHEdlw%3D%3D&amp;fcc_id=IHDT56XR2\">FCC certification</a> for the Moto G7 Play has surfaced. This means we’ll likely see the Moto G7, G7 Plus, and G7 Play, as with most other years.</p>",
            "<p>When should we expect to see the 2019 Moto G-series lineup? Tradition dictates an April or May announcement, but the latest rumors pin the Moto G7 range as being revealed in February, well ahead of the usual schedule. According to <a href=\"https://www.androidpit.com.br/moto-g7-evento-lancamento-brasil\">a Brazilian news site</a>, the Moto G7 will be revealed in early February in Brazil ahead of MWC, which is scheduled for late February. According to that same website, Motorola’s phones have traditionally done well in the South American country, which may explain why it’s keen to launch there first. With February coming up us soon, expect to hear more about this.</p>",
            "<p>Pricing is a crapshoot at this point. Typically, Lenovo has kept all of the G-series phones firmly in budget phone territory, but things changed in 2018 when it smacked a nearly $300 price tag on the Moto G6 Plus. When we have a better idea of pricing, we’ll provide an update.</p>",
            "<p>Although many manufacturers choose to use older versions of Android in their budget phones, Lenovo typically bucks that trend. According to Android Authority and several other sites, the upcoming Moto G7 range will ship with <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a>. This has since been confirmed by <a href=\"https://www.androidauthority.com/motorola-moto-g7-specs-2-945821/amp/\">Motorola Brazil’s major leak</a>.</p>",
            "<p>In addition to Motorola’s near-stock version of Android on its G-series smartphones, there are a few additional features that are actually useful. We’d expect to see Moto Actions, Motorola’s awesome gesture interface, make an appearance on the upcoming G7 phones, as well as Moto Voice.</p>",
            "<p><i>Updated on January 24, 2019: Motorola Brazil accidentally reveals the entire Moto G7 range early.<br>\n</i></p>"
        ]
    },
    {
        "title": "\n\t\tMoto G6 vs. Moto G6 Play: Is the G6 worth the extra cash?\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>The Moto G series has long been hailed as one of the best ways to get an excellent phone at a decent price, and the all-new Moto G6 and Moto G6 Play seem to be no exception to that rule. The new phones boast a modern design, improved specs, and more — all at a pretty good price.</p>",
            "<p>But which one is better for your situation? Is the slightly more expensive Moto G6 the one to go for, or should you stick with the slightly cheaper Moto G6 Play? We put the two phones head to head to find out.</p>",
            "<p>Both the <a href=\"https://www.digitaltrends.com/android/lenovo-moto-g6-news/\">Moto G6 and the Moto G6 Play</a> feature decent specs for the price, but one of them is clearly more powerful than the other. While the Moto G6 Play features a Snapdragon 427 processor coupled with either 2GB or 3GB of RAM, depending on the region, the standard Moto G6 steps things up a little to a Snapdragon 450 processor coupled with either 3GB or 4GB of RAM. Safe to say, if you’re looking for performance then the standard Moto G6 is the device to go for here.</p>",
            "<p>While the standard Moto G6 will likely be the better performer, the G6 Play may be the better option for battery life. The Moto G6 comes with a very respectable 3,000mAh battery, but the G6 Play steps things up to a 4,000mAh battery. With a lower-resolution display, that should translate into a much longer battery life.</p>",
            "<p>The standard Moto G6 may feature a smaller battery, but it will charge faster. The device features 15W TurboPower Charging, which should charge quicker than the Moto G6 Play’s 10W Fast Charging.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/f20059bf36aede15debccec8ace31d468d9a343e/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto G6</a></strong></p>",
            "<p>The Moto G6 and Moto G6 Play feature similar designs, but they’re not totally the same. On the front, both offer a 5.7-inch display with an aspect ratio of 18:9. While the standard Moto G6 offers a fingerprint sensor and home button under that display, the Moto G6 Play instead moves its fingerprint sensor to the back of the phone. Both phones come in Black or Deep Indigo colors.</p>",
            "<p>Unfortunately, neither of these phones are water resistant, though they do offer a so-called “water repellent coating.” That should help for things like a bit of rain, but don’t drop the phones in the pool or bath — they may not make it out alive. They should fare similarly in drops — both phones feature glass backs, which Motorola says helps make the phones cheaper.</p>",
            "<p>These phones are extremely similar when it comes to design and durability.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>Both of the phones feature a 5.7-inch display with an aspect ratio of 18:9, and they’re both <a href=\"https://www.digitaltrends.com/mobile/amoled-vs-lcd-which-screen-is-best-for-your-phone/\">LCD displays</a>. The display on the standard Moto G6, however, offers a much higher resolution. The phone’s resolution comes in at 2160 x 1080 pixels, with a pixel density of around 424. The Moto G6 Play, on the other hand, features a display with a resolution of 1440 x 720 pixels, which equates to a pixel density of 282.</p>",
            "<p>The resolution is the only way in which these displays differ, so it’s clear that the display on the Moto G6 is quite a bit better.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/f20059bf36aede15debccec8ace31d468d9a343e/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto G6</a></strong></p>",
            "<p>One of the biggest points of difference between these two phones is the camera. While the Moto G6 Play features a single-lens camera, the Moto G6 steps things up to a dual-sensor camera.</p>",
            "<p>Let’s start with the Moto G6. As mentioned, it offers a dual-sensor camera, with the primary sensor sitting in at 12 megapixels, and the secondary sensor coming in at 5 megapixels. The camera features an aperture of f/1.8, which should help make for slightly better low-light shots than the the Moto G6 Play. The front-facing camera comes in at 8 megapixels.</p>",
            "<p>The camera on the Moto G6 also offers some cool extra features, like a portrait mode, object recognition, face filters, and more.</p>",
            "<p>Speaking of the Moto G6 Play, it offers a single-lens main camera that comes in at 13 megapixels with an aperture of f/2.0, while the front-facing camera comes in at 5 megapixels. The Moto G6 Play doesn’t match all the same features as the standard Moto G6, but it still boasts things like face filters, and it has phase detection autofocus.</p>",
            "<p>We’ll have to wait and see just how those stats translate into photos and video in the real world, but the Moto G6 looks a lot better on paper.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/f20059bf36aede15debccec8ace31d468d9a343e/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto G6</a></strong></p>",
            "<p>While there was once a time when Motorola could be considered among the best companies in terms of software updates, that seems to be changing. Thankfully, the Moto G6 and Moto G6 Play will get updated — unlike the new Moto E — but Motorola says they’ll only get one or two updates. In other words, the phones ship with Android 8.0 Oreo, and they should eventually make it to <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android P</a>, but there isn’t much of a guarantee that you’ll get any updates beyond that.</p>",
            "<p>Generally speaking, Motorola sticks with a relatively stock version of Android, though it adds a few features that some might find useful. For example, the standard Moto G6 features one-button navigation, which means you can use gestures on the home button to control the phone. There’s no real difference between these phones in the software department.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>In terms of special features, the two phones are pretty similar. They do offer some nice features, though — such as Moto Actions, which allow you to access different apps through gestures. For example, you can access the camera by double twisting your wrist. They also offer Moto Voice, which uses “Show Me” as the trigger word. For example, you can say “show me Chrome” to open Google Chrome, or “show me the weather” to see the weather.</p>",
            "<p>Still, features like this aren’t specific to one of the phones — so this one’s another tie.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The Moto G6 and Moto G6 Play are both inexpensive phones, but they come at a slightly different cost. The standard Moto G6 comes in at $250, while the Moto G6 Play costs a slightly cheaper $200.</p>",
            "<p>Both of the phones will be available for purchase starting in Spring.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/f676db77a65f2f944552d6f22e13293ad39c9076/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto G6 Play</a></strong></p>",
            "<p>No surprise here — the Moto G6 is simply a better device. But, it’s also a little more expensive. If you don’t care about the extras, then it may be worth simply sticking with the Moto G6 Play and saving $50. But if you have the extra money to spare, we recommend going for the more powerful Moto G6 — it’s faster, has a much sharper display, and boasts a more versatile camera.</p>"
        ]
    },
    {
        "title": "\n\t\tMoto G6 vs Nokia 7 Plus vs Honor 7X camera shootout\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p>The best camera we can own is the one that performs superbly when we need it most. Often, this can be in a situation that demands speed, and not one that’s all about composition, art, and attention to detail. We want the best results possible, in the easiest way imaginable, without having to mess around. After all, a smartphone is supposed to be user friendly and convenient, so why can’t the same be asked of the camera?</p>",
            "<p>Motorola wanted to demonstrate how fast and effective the new <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-review/\">Moto G6’s</a> camera is, so it invited us along to — where else — a race track in the U.K. to prove it. Except we didn’t turn up with just our racing booties and a Moto G6. We brought the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/nokia-7-plus-review/\">Nokia 7 Plus</a> and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/honor-7x-review/\">Honor 7X</a> along for the ride. All three of these phones <a href=\"https://www.digitaltrends.com/mobile/best-cheap-smartphones/\">cost half that</a> of even the cheapest flagship phone, and represent great value for money, but how do the cameras perform in a situation that demands speed? Let’s take a look.</p>",
            "<p>How do the cameras compare on paper? The $250 <a href=\"https://www.motorola.com/us/products/moto-g-gen-6\">Moto G6</a> has an f/1.8 aperture, dual-lens rear camera with 12-megapixel and 5-megapixel sensors. The video camera shoots at 1080p, and there are various special modes including Spot Color, a Cutout mode, and Portrait Mode, plus an 8-megapixel selfie camera. It’s worth noting the Moto G6 and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-plus-review/\">Moto G6 Plus</a> share the same camera specifications, so the results here should be comparable.</p>",
            "<p>The 300 British pound/$390 <a href=\"https://www.nokia.com/en_gb/phones/nokia-7-plus\">Nokia 7 Plus</a> has a 12 megapixel, f/1.75 aperture main lens and a second 13-megapixel, f/2.6 aperture lens. Both have Zeiss optics, and the camera has a portrait-style mode called Live Bokeh, as well as the cool Bothie mode that takes a photo with the front and rear camera simultaneously. The selfie camera packs 16 megapixels, and the video mode is enhanced with Nokia’s Ozo triple microphone array. This phone is sadly not available in the U.S. yet.</p>",
            "<p>Finally, the <a href=\"https://www.hihonor.com/us/product/10001933050073.html\">Honor 7X</a> is the oldest phone here, having been released late last year, but it’s still a great device with a strong camera, especially for just $200. The rear camera has two lenses — a 16 megapixel, f/2.2 aperture sensor, and a 2-megapixel, f/2.9 aperture sensor — and although the specs can’t quite match the other two here, the app has plenty of features including portrait and bokeh modes.</p>",
            "<p>Speed is of the essence on an “experience day,” like the one we attended. There isn’t much time for taking photos, so you just want to get on with it when the time comes. However, if the picture ends up being rubbish, it’ll be time wasted and moments missed. The camera app is an important part of this process.</p>",
            "<p>The Moto G6’s camera app is very simple, and it really is the fastest here. There are three buttons for the stills, video, and options menu above the shutter release. In the menu you tap the option you want, then hit the stills camera button to return to normal. It doesn’t always make sense though, as the Manual mode is not under the options menu, but in a separate button along the top of the display. We love the helpful shortcut that lets you shake the phone to quickly open the camera app from the lock screen, which secured its win.</p>",
            "<p>The Nokia 7 Plus’ app is also simple, with a few options hidden under the menu button in the top left of the screen. The Nokia has a 2x lossless zoom feature, which the Moto G6 and 7X don’t have. The Honor 7X has the most complex and feature rich camera app. Slide the screen left or right to show all the options, and there’s quick access to portrait and aperture modes along the top of the screen.</p>",
            "<p>The Nokia 7 Plus was more stable, but slower to open than the Moto G6. Finally, due to its complexity, the Honor 7X needs you to be familiar with how to use the camera ahead of time to get the best from it, but once you are, it’s a powerful companion.</p>",
            "<p><strong>Winner: Moto G6</strong></p>",
            "<p>Bedford Autodrome is the home of <a href=\"http://www.palmersport.com/\">Palmer Sport</a>, and we were there to drive the company’s <a href=\"http://www.palmersport.com/our-cars/renault-clio-cup-racer.aspx\">Renault Clio Cup Racer</a>, and an <a href=\"http://www.palmersport.com/our-cars/formula-3000.aspx\">F3000 single-seat racing car</a>. The brightly colored Clio’s were up first, and we took two pictures of the cars, one as a two-shot and another of the grid with the garages in the background.</p>",
            "<p>Six very different photos are produced. The Moto G6 is the only phone that automatically activated HDR, and it really shows in both images. In the shot of the two cars, you can see more detail in the wheel arches and the front valance, and while the sky isn’t so richly blue as the Nokia’s photo, it’s a beautiful picture. The Honor 7X washes out the yellow cars too much, and you can’t see much in the shadow of the garages in the second picture either.</p>",
            "<p>In the Moto G6’s HDR-enhanced photo you can clearly see into the back of the garage and make out stacks of tires. This is at the expense of some realism in the track surface’s color, and a blue sky that’s too light. We don’t like the almost purple sky in either of the Honor 7X’s photos.</p>",
            "<p>The Nokia 7 Plus produces the photos with the best balance. The sky and the track surface look like they did on the day, and there’s enough detail in the garages to show what’s there. Best of all, the colorful livery on the cars is well separated, and the yellow pops in the image.</p>",
            "<p><strong>Winner: Nokia 7 Plus</strong></p>",
            "<p>This is a bokeh mode test, and again the results are really different, emphasizing how important reliability is in many situations where we use our phones as cameras. The Nokia 7 Plus still has some problems with its Live Bokeh mode. Here, it actually focused on the car’s seats and not the mirror, despite giving us a “Depth Success” message at the time. It’s a perfect example of the camera not giving us the picture we wanted, in a situation that we’re unable to replicate, and it’s a shame because the photo is excellent otherwise.</p>",
            "<p>With the Nokia out of the running, it’s down to the Moto G6 and the Honor 7X. The Motorola phone really focuses in on the mirror, blurring out the background almost entirely, including the mirror’s actual support. The Honor 7X does it much better. You can still read the Palmer Sport logo on the side of the car, and there are details on top of the mirror itself almost missing from the Moto G6’s picture.</p>",
            "<p><strong>Winner: Honor 7X</strong></p>",
            "<p>Another two photos of the same subject, from different angles. The cockpit is shot facing the bright sunlight outside the window, while the entire car is taken with the sun behind us.</p>",
            "<p>Let’s begin with the Nokia. Once more, it fails to capture the photo we expected. The background is more in focus, along with the tire sidewalls, than the instrument cluster at the center of the image. In all these photos, we tapped the same section for focus and exposure, and it’s a surprise to see it like this.</p>",
            "<p>The Moto G6 and the Honor 7X both managed to focus on the car’s interior, but both struggled with the challenging light. The roll bar in the Honor 7X’s photo is jet black, but almost grey in the G6’s, while the interior in the photo is considerably clearer and more detailed. Similarly, the tire sidewalls are also detailed, but the area by the door in the top right is overexposed and washed out. Neither picture is great, so this one is a tie.</p>",
            "<p>How about the photo of the car itself, can it break the tie?</p>",
            "<p>The Nokia 7 Plus still has problems knowing where to focus, and there is some blur in the photo around the edges. The Moto G6 handles the color and contrast in a similar way to the Nokia 7 Plus, and produces a sharper more pleasing photo. The Honor 7X actually takes the sharpest photo out of the three, and we prefer the shade of blue in its photo too. This gives it the win here.</p>",
            "<p><strong>Winner: Honor 7X</strong></p>",
            "<p>This is a much closer race (sorry), and it’s the Honor 7X that loses out first due to the reds becoming more pink that they were in reality. The Nokia and the Moto G6 are very close, and it’s almost impossible to pick between them.</p>",
            "<p>However, the deeper you look into the Nokia’s photo the sharper the details are. Despite this, the Moto G6’s photo is still one we’d be very happy with, as it captured the regimented line-up of the cars in a visually-interesting way. Forced to pick a winner, we’d go for the Nokia.</p>",
            "<p><strong>Winner: Nokia 7 Plus</strong></p>",
            "<p>Who wouldn’t want a celebratory selfie after a day of being a racing driver? Using portrait mode all three cope in different ways with the bright background and the challenge of isolating the helmet and the face. The Honor 7X very effectively blurs the background around the helmet, and keeps the color and brightness balance just right for the subject’s face. The background is slightly overexposed, but the racing car in the background is still visible, giving the scene further context.</p>",
            "<p>The environment is even more clear in the Moto G6’s photo, and the color balance is beautiful. Just look at the red car and the blue sky against the black race suit. It’s a shame the portrait effect took away the edge of the visor; but we think this may be because the subject’s angle is different to the Honor 7X’s photo.</p>",
            "<p>The Nokia 7 Plus is somewhere in-between. The background is overexposed, but the racing car is red and obvious in the photo, while the portrait mode isolates the helmet well. However, because the background is overexposed, detail is lost around the left-hand side of the helmet. The race suit is also quite grey. It’s probably slightly more realistic, but the Moto G6’s photo, even with the less effective edge blur, is the one we’d want to share.</p>",
            "<p><strong>Winner: Moto G6</strong></p>",
            "<p>We also shot some quick panning videos showing the cars going round the track with each device, and also shot our main video above on the Moto G6.</p>",
            "<p>The Nokia easily beat the <a href=\"https://www.youtube.com/watch?v=QUrphLgHlF8&amp;feature=youtu.be\">Honor 7X</a> and the <a href=\"https://www.youtube.com/watch?v=lnMyalbJs2g&amp;feature=youtu.be\">Moto G6</a> here, with a smoother, steadier, and more detailed video. However, it was the audio that really surprised. The Nokia 7 Plus has three microphones with special tuning, and the performance was superb, giving the scene real emotion. It was far more representative of the car’s sound.</p>",
            "<p><strong>Winner: Nokia 7 Plus</strong></p>",
            "<p>The Nokia 7 Plus won three categories, while the Moto G6 and the Honor 7X took two. While this technically gives the Nokia 7 Plus the overall win, the photo categories it lost were failures, which is much worse than producing a less impressive shot. We noted problems with the bokeh mode in our review, and no software update has arrived to cure this between then and now, and this test shows how photos can be ruined by such issues. It’s impossible to recommend a phone that may let you down when you need it most.</p>",
            "<p>The surprise here is the Honor 7X, which not only took two categories, but also came very close to winning in two others. It’s the cheapest and oldest phone here, so to outperform these two at all shows how accomplished Honor is at producing great cameras. The Moto G6 also took some excellent photos, and we enjoyed using features like Spot Color to produce some fun images that would be more time consuming to make with the other devices. What’s more, it was definitely the fastest to take each photo thanks to that gesture shortcut.</p>",
            "<p>Here’s our complicated conclusion. The most expensive phone is the best for photos and video, except when it’s not at which time it’s the absolute worst, and the cheapest phone is the best all-rounder. In the middle is the Moto G6, a phone that you won’t be unhappy with at all. Plus, Motorola really did prove it has the fastest camera app here, with its shake-to-wake feature. All that said, it’s very hard to argue against the Honor 7X when it costs so little.</p>"
        ]
    },
    {
        "title": "\n\t\tMoto G6 vs. Moto G5: Is it time to crown a new budget king?\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Motorola’s range of budget kings has a new model with <a href=\"https://www.digitaltrends.com/android/lenovo-moto-g6-news-version-1524073369/\">the arrival of the Moto G6</a> smartphone. But how does the new model compare to the last major installment in the Moto G line, the <a href=\"https://www.digitaltrends.com/android/lenovo-moto-g5-news/\">Moto G5</a>? Though the Moto G5 was never officially released in the U.S., it was still a massive hit around the world. With the new G6 in the wings, how do the two measure up? We took a look to find out.</p>",
            "<p>We didn’t review the Moto G5, due to the aforementioned lack of a U.S. release, but the G-range has generally brought quite zippy performance for a budget handset. We were impressed with the last release, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lenovo-moto-g5s-plus-review/\">Moto G5S Plus</a>. While it certainly doesn’t pack flagship-level performance, the Snapdragon 430 in the Moto G5 is reliable and quick to respond. The Moto G6 is packing the more powerful Snapdragon 450, and offers the option of more RAM, which will give the G6 an edge in multitasking.</p>",
            "<p>The G6 also has a larger battery than the G5, rising to 3,000mAh from the G5’s 2,800mAh. Wireless charging is a no-go, but that’s not unexpected on a budget phone. Charging speeds via the USB-C port on the G6 are also faster. Motorola’s <a href=\"https://www.motorola.com/us/products/turbopower\">TurboPower Charging</a> jumps to 15W, giving enough power for six hours of charge in just 15 minutes. The Moto G5 can still charge fairly quickly via its less convenient Micro USB port, but speeds are capped at 10W. Of course, you have to use the right charger to get those speeds.</p>",
            "<p>The Moto G6 is a straight upgrade in every single aspect. The newer model is the clear winner here.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/a069ea899c8d95d625abfbf1ac685a71dab969c2/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto G6</a><br>\n</strong></p>",
            "<p>We had some criticisms of the look of the Moto G5 Plus when it was first released, and those criticisms apply to the smaller G5 too. The chunky bezels and rounded style make the G5 look like a much older phone, and while we don’t expect supercar-levels of attractiveness in our budget phones, we do expect a high level of style in 2018. Thankfully, this seems to have been rectified with the Moto G6. The G6 is packing the 18:9 aspect ratio that’s becoming increasingly common, and while the phone isn’t truly <a href=\"https://www.digitaltrends.com/mobile/bezel-less-phone-comparison/\">bezel-less</a>, the bezels are much reduced while still retaining a style that’s very Moto G and still modern. You’ll also find the fingerprint sensor around the front of both phones.</p>",
            "<p>As you might expect for a budget phone, neither has any significant water-resistance, with a “water-repellent” coating being the only real protection against liquids. In terms of physical durability it’s more of a toss-up. The Moto G5 is covered in a fairly flimsy metal, and it’s debatable whether that metal will fare better than the glass on the back of the G6. Glass is prone to shattering, but that risk can be stymied with a good case.</p>",
            "<p>We’re still torn on the durability issue, but we think it’s clear that the Moto G6 is by far the more attractive phone here. The G6 takes it.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/a069ea899c8d95d625abfbf1ac685a71dab969c2/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto G6</a><br>\n</strong></p>",
            "<p>Both these phones pack IPS LCD screens with Full HD 1080p screens, and they’re both colorful, sharp, and more than good enough for a budget phone. Outside of that, there’s little else in common with these two phones. The Moto G6’s 5.7-inch display covers significantly more of the phone’s front than the G5’s 5-inch display, while the G6’s 18:9 aspect ratio also gives it a longer screen. In displays, bigger is often better, and although the G6’s display isn’t quite as sharp as the G5’s (due to the larger coverage and similar resolution), it’s not a big enough difference to be able to see with the naked eye.</p>",
            "<p>The Moto G6 gives you a bigger screen that’s oh-so 2018, and it wins this category.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/a069ea899c8d95d625abfbf1ac685a71dab969c2/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto G6</a><br>\n</strong></p>",
            "<p>In terms of video, the Moto G6 has one-upped the G5 with 1080p recordings at 60 frames per second. The G5 can only manage 30 fps at that same resolution. There’s also support for slow motion recording on the G6, and a time lapse feature.</p>",
            "<p>While we haven’t spent much time with the Moto G6 ‘s camera yet, we’re reasonably sure that it’ll turn out to be the superior of the two.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/a069ea899c8d95d625abfbf1ac685a71dab969c2/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto G6</a><br>\n</strong></p>",
            "<p>Motorola is known for shipping its phones with a version of Android <a href=\"https://www.digitaltrends.com/mobile/what-is-stock-android/\">reasonably close to stock</a>, and there’s no difference here in that regard. However, you will find an updated version of <a href=\"https://www.digitaltrends.com/mobile/android-o-news/\">Android 8.0 Oreo</a> on the Moto G6, while the Moto G5 is currently stuck on the older <a href=\"https://www.digitaltrends.com/mobile/android-7-nougat-when-do-you-get-it/\">Android 7.0 Nougat</a>. While an update is planned for the G5, <a href=\"https://www.digitaltrends.com/mobile/android-oreo-when-do-you-get-it/\">there’s no sign of it yet</a>.</p>",
            "<p>Going forward, Motorola has stated that the G6 will receive an update to <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android P</a>, and up to two years of update support — since the G5 is already partway through its update lifespan, similar support is unlikely.</p>",
            "<p>While there’s nothing wrong with the version of Android on the G5, the G6 has all the latest features and is more likely to be supported for longer. The Moto G6 wins here.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/a069ea899c8d95d625abfbf1ac685a71dab969c2/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Motorola\">Moto G6</a><br>\n</strong></p>",
            "<p>Since both of these phones are close to stock Android you might think there won’t be much in the way of special Motorola-added features. But you’d be wrong. Features like Moto Actions allow you to use physical gestures with your phone to open specific apps — like double-twisting your wrist to open your camera — while Moto Voice allows you to access some phones features or open apps with the phrase “Show me”.</p>",
            "<p>These features have been pretty standard across most recent Motorola phones, and at this point we’re not aware of any additional features that could separate them. This is a tie.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>Both of these phones are inexpensive budget beasts with a lot to offer. The Moto G6 will be available in May, with prices starting from $250. The Moto G5 didn’t officially launch in the U.S., but that doesn’t mean you can’t buy an <a href=\"https://www.amazon.com/Motorola-Unlocked-International-Version-Warranty/dp/B071DR8Y6X/?tag=dt-incontent-btn-20\">international variant from Amazon</a>, and current pricing has it at a paltry $160. That’s a real bargain for a phone that’s this good.</p>",
            "<p><strong>Winner: <a href=\"https://www.digitaltrends.com/go/e3c548808a903436b9745de0a336078d133f3494/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Moto G5</a><br>\n</strong></p>",
            "<p>We would have really been questioning Motorola if this had been the other way around. While the Moto G5 is still a great budget phone with a lot to offer, it really is outpaced and outshone by the upgraded design and innards of the Moto G6. The newer phone is the clear winner in this bout, and we’re eagerly awaiting more time with the Moto G6 to find out exactly what it’s capable of.</p>"
        ]
    },
    {
        "title": "\n\t\tYour ultimate guide to Motorola’s 2018 smartphone lineup\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Another year, another Motorola upgrade cycle. With so many upgrades, Motorola’s lineup can get a little confusing, even for those of us who live and breathe in the mobile world. With Moto models ranging from E to G to Z, you’d be forgiven for thinking you’d dropped into an episode of <em>Sesame Street</em>, rather than a list of Motorola’s latest and greatest.</p>",
            "<p>But fear not, we’re here to help. We’ve delved deep into the details of each of Motorola’s latest phones to make sure that you know exactly what you’re getting in terms of budget, design, or needs. We’ll be going from the cheapest budget device, the Moto E5 Play, all the way to the Motorola flagship, the Moto Z3.</p>",
            "<p>If you’re looking for a Motorola phone from 2017, check out our <a href=\"https://www.digitaltrends.com/mobile/motorola-mobile-lineup-guide/\">guide on Motorola’s 2017 phones</a>.</p>",
            "<p><strong>Pricing:</strong> <a href=\"https://www.motorola.com/us/products/moto-e-gen-5\">Around $100</a></p>",
            "<p><strong>Who it’s for: </strong>Anyone who wants a basic but reliable large-screen smartphone for very little money.</p>",
            "<p>It’s not common for Motorola to bring the entirety of one of its ranges to the U.S., so imagine our surprise when it turned out that the Motorola Moto E5 would be coming to U.S. shores after all, joining its E-range 5th-gen comrades.</p>",
            "<p>The Moto E5 is the cheapest of Motorola’s E5 range, coming in <a href=\"https://www.bestbuy.com/site/simple-mobile-moto-e5-gray/6288012.p?skuId=6288012\">at just $100</a> for a phone on Simple Mobile. It’s well sized, with a 5.7-inch screen in an 18:9 aspect ratio, and a 720p resolution. You’ll find a decently powered Qualcomm Snapdragon 425, along with 2GB of RAM. There’s a tiny 16GB of onboard storage, but you can boost that with a MicroSD card. That’s backed up by a big 4,000mAh battery that should give some long-lived battery life. There’s an 8-megapixel lens on the back, and a 5-megapixel selfie shooter.</p>",
            "<p>However, like the other variants in the Moto E5-range, it won’t get an <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a> upgrade.</p>",
            "<p><strong>Pricing: </strong><a href=\"https://www.motorola.com/us/products/moto-e-play-gen-5?\" data-affiliate-link=\"1\" data-affiliate-name=\"Motorola\">Around $130</a></p>",
            "<p><strong>Who it’s for:</strong> Someone who needs a basic, cheap smartphone.</p>",
            "<p>The Moto E Series has always been Motorola’s bargain budget tier of smartphones, but don’t let that put you off. The specs are modest, as you’d expect: A Snapdragon 425 or 427 processor (depending on the carrier you buy it from), as well as 2GB of RAM and 16GB of storage, with an optional MicroSD slot for more storage. The draw here is the upgraded looks and display — slim bezels and a 5.2-inch screen with a 1280 x 720-pixel resolution — and though it does have a plastic back panel, it’s removable so you can replace the sizeable 2,800mAh battery if needed. It ran decently in our review, and the 8-megapixel rear camera and 5-megapixel front-facing camera proved capable enough for the price — but avoid low lighting conditions if you want to take pictures.</p>",
            "<p>Unfortunately, Motorola has ruled out an <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a> upgrade for this phone, so that’s something to keep in mind if you like to be up-to-date.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-e5-play-review/\">Moto E5 Play review </a></p>",
            "<p><strong>Pricing: </strong> <a href=\"https://www.motorola.com/us/products/moto-e-plus-gen-5?\" data-affiliate-link=\"1\" data-affiliate-name=\"Motorola\">Around $180</a></p>",
            "<p><strong>Who it’s for: </strong>Someone who needs a lot of battery life, but isn’t bothered about processing power.</p>",
            "<p>We loved the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-e4-plus-review/\">Moto E4 Plus</a>, and it seems that the follow-up will include that phone’s greatest asset — the fantastic battery life. The Moto E5 Plus is packing an enormous 5,000mAh battery that will likely be able to last upwards of two days thanks to the energy-sipping Snapdragon 435, while still providing plenty of power and storage with 3GB of RAM and 32GB of internal storage (with the option of MicroSD card expansion). Like the Play version, the looks have been upgraded, with slim bezels and a cool polymer glass back panel. It also has a huge 6-inch display with a 1440 x 720-pixel resolution, as well as a capable camera suite — a 12-megapixel lens on the back and an 8-megapixel on the front.</p>",
            "<p>Unfortunately, like the E5 Play, this phone will definitely not be receiving an <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a> upgrade — which may be a deal-breaker for some.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-e5-plus-review/\">Moto E5 Plus review</a></p>",
            "<p><strong>Pricing:</strong> <a href=\"https://www.motorola.com/us/products/moto-g-play-gen-6?\" data-affiliate-link=\"1\" data-affiliate-name=\"Motorola\">Starts at $200</a></p>",
            "<p><strong>Who it’s for:</strong> Someone who wants a good-looking and cheap midrange device that covers all the bases.</p>",
            "<p>The Moto G6 range comes to the U.S. in two flavors this year, and the Moto G6 Play is the cheapest of those models. You might not realize that at first glance since Motorola has finally gotten around to fully embracing the bezel-less trend we’ve seen slowly taking over the entire mobile industry. Slim bezels surround a huge 5.7-inch LCD screen running a 720p HD resolution. It’s not the sharpest around, but it’s good enough for this price. The whole phone is clad in a polymer glass, which throws some really nice reflections when the light hits it. You’ll also find the fingerprint sensor around the back of the phone, which we definitely prefer to the front-mounted design Motorola has gone with before.</p>",
            "<p>Moving inside the phone, there’s a Snapdragon 427 along with 2GB of RAM and 16GB of storage, but there will also be a model with 3GB of RAM and 32GB of storage. You can also expand that storage on either model of the G6 Play with a MicroSD card. Performance is okay, but don’t expect the G6 Play to keep up with you if you need a powerful phone. Camera-wise, the G6 Play has the only single-lens setup in the G-range this year, and the single 13-megapixel lens held up well, though it still suffers from shutter lag. Still, this $200 phone is a good choice for the price, and it’s been confirmed to be getting an update to <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">Android 9.0 Pie</a>.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-play-review/\">Moto G6 Play review</a></p>",
            "<p><strong>Pricing: </strong> <a href=\"https://www.motorola.com/us/products/moto-g-family?\" data-affiliate-link=\"1\" data-affiliate-name=\"Motorola\">Starts at $250</a></p>",
            "<p><strong>Who it’s for:</strong> Someone who wants a great all-around midrange phone for under $300.</p>",
            "<p>The Moto G6 is the next rung up on the midrange ladder, and it’s one heck of a rung. For $250, you get a phone that’s close to being bezel-less, a 5.7-inch screen running a full HD 1080p resolution, and some decent specs on the inside. The Moto G6 is wrapped in glass (Gorilla Glass 3), and it sits nicely in the hand. Performance is smooth, thanks to the Snapdragon 450 and 3GB of RAM. There’s 32GB of storage, but that’s upgradable by MicroSD card, and if that’s still not enough, there’s a model with 4GB of RAM and 64GB of internal storage. It’s also fairly set up for the future, with a confirmed update to <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">Android 9.0 Pie</a> in the works.</p>",
            "<p>The fingerprint scanner is back underneath the display, like the previous Moto G models, which is good if you like that placement. There’s a dual-lens camera on the back — a 12-megapixel lens and a 5-megapixel lens — and these are primarily used to give a blurred “bokeh” effect to images. It did a pretty good job in testing, but there’s still a hint of that shutter lag that always seems to plague Motorola phones. In a first for the G-range, there’s also a USB-C port at the bottom of the phone.</p>",
            "<p><em>Note: There is also a <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-plus-review/\">Moto G6 Plus</a> with the faster Snapdragon 630, a bigger battery, and a slightly larger 5.9-inch display — but it won’t be coming to the U.S.</em></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-review/\">Moto G6 review</a></p>",
            "<p><strong>Pricing:</strong> Under $400</p>",
            "<p><strong>Who it’s for:</strong> Someone who’s after an upper-midrange phone and likes a notched display.</p>",
            "<p>It used to be that the Moto X was Motorola’s flagship range — but it’s since been supplanted by the Moto Z range. That doesn’t mean that a Moto X doesn’t deserve to be your daily driver though, as there’s historically been a lot to love in a Moto X. The Moto X5 has yet to be officially announced, but the rumors surrounding its existence point to an <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a>-style notch at the top of the screen. There are precious little details on the Moto X5 at this stage though, save a possible 5.9-inch screen.</p>",
            "<p>We’ll let you know as soon as there are more details available on this device.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/android/moto-x5-news/\">Moto X5 news</a></p>",
            "<p><strong>Pricing: </strong>$399</p>",
            "<p><strong>Who it’s for:</strong> Someone who wants a decent midrange phone for a good price.</p>",
            "<p>One of the few Motorola handsets not to come with a single letter name, the Motorola One is Motorola’s midrange handset that doesn’t come with access to Moto Mods. It’s powered by the midrange Snapdragon 625, and comes with 4GB of RAM, and 64GB of storage with MicroSD card expansion of up to 256GB. Those aren’t bad stats for a midrange phone, and it should keep it ticking well. The display may be a disappointment to some though, and though it has a 19:9 aspect ratio, the resolution tops out at 720p. Not really what we expect in a $399 phone. Still, the 3,000mAh battery is decent, and access to Android One should mean plenty of software updates.</p>",
            "<p><em>Note: There’s a slightly higher powered version of the Motorola One, called the <a href=\"https://www.digitaltrends.com/mobile/motorola-one-power-news-rumors-specs-and-more/\">Motorola One Power</a>. It comes with a more powerful processor and a huge 5,000mAh battery — but it’s likely it won’t be coming to the U.S.</em></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/mobile/motorola-one-power-news-rumors-specs-and-more/\">Motorola One news</a></p>",
            "<p><strong>Pricing:</strong> <a href=\"https://www.motorola.com/us/products/moto-z-play-gen-3\">Around $500</a></p>",
            "<p><strong>Who it’s for:</strong> Someone who wants access to Moto Mods, but in a cheaper package.</p>",
            "<p>The Moto Z Play range has always been the best route for anyone who wants a great phone at a low price, but also can’t resist the allure of Motorola’s Moto Mods. 2018’s <a href=\"https://www.digitaltrends.com/mobile/moto-z3-play-news/\">Moto Z3 Play</a> comes with the improved Snapdragon 636, 4GB of RAM for easy multitasking, and Android 8.1 Oreo — as well as a confirmed update to <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">Android 9.0 Pie</a>. It’s all powered by a 3,000mAh battery, and while that seems small, it’ll easily give you a day of play — two days with the included battery Moto Mod. There are an upgraded camera and a new bezel-less design, with Motorola bringing the best of 2018’s trends to the table. The Moto Z3 Play is a great choice for a Moto Mod enthusiast on a budget.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-z3-play-review/\">Moto Z3 Play review</a></p>",
            "<p><strong>Pricing:</strong> <a href=\"https://www.motorola.com/us/products/moto-z-gen-3\">Around $480</a></p>",
            "<p><strong>Who it’s for:</strong> Someone who wants flagship performance with their Moto Mods.</p>",
            "<p><a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-z3-review/\">The Moto Z3</a> represents Motorola’s flagship range and is the most powerful phone that Motorola has revealed to date. It provides excellent performance, thanks to the powerful Snapdragon 835 and 6GB of RAM. A 128GB hard drive should give enough room for all but the most app-hungry of individuals, and there’s even a MicroSD card slot to boost that ample storage. It’s running an almost-stock version of Android 8.1 Oreo, though it does have Motorola’s usual complement of added apps — but it’s also one of the Motorola phones confirmed to get <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">Android 9.0 Pie</a>. You’ll get a day’s worth of life out of the 3,000mAh battery, and Motorola’s TurboPower fast charging is as speedy as ever. The camera is definitely a weak spot though, and while capable in good lighting, it disappoints in less well-lit environments. In terms of design, it looks exactly the same as the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-z3-play-review/\">Moto Z3 Play</a> — and it’ll work with all the same Moto Mods too.</p>",
            "<p>With the Moto Z3 Play coming in at around $500, you might have expected the flagship Moto Z3 to come in at a higher price than its lower-powered brethren — however, you might even find the Moto Z3 for less than the Z3 Play at times. Why? Motorola is discounting the Z3 in order to push the <a href=\"https://www.digitaltrends.com/mobile/moto-z3-news/\">5G Moto Mod</a> that’s arriving next year. This mod will allow the Z3 to access significantly faster speeds on <a href=\"https://www.digitaltrends.com/mobile/what-is-5g/\">5G mobile data</a>, and Motorola is hoping the lower asking price for the Z3 will make the 5G Mod’s price more palatable. Still, this is a great phone for the money, and the best way to access the suite of Moto Mods.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-z3-review/\">Moto Z3 review</a></p>"
        ]
    },
    {
        "title": "\n\t\tCommon Motorola Moto G6, G6 Plus, and G6 Play problems and how to fix them\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p><a href=\"https://www.motorola.com/us/products/moto-g-family\">The Moto G6</a> is a fantastic smartphone if you need something capable on a budget. But no phone is perfect, and whether you’re using the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-review/\">Moto G6</a>, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-plus-review/\">G6 Plus</a>, or the <a href=\"https://www.digitaltrends.com/android/lenovo-moto-g6-news/\">G6 Play</a>, you might still run into some issues.</p>",
            "<p>If you’re experiencing a technical hitch on your beloved Moto G6, check out this list of the most common Moto G6 problems and issues, and see whether there’s an easy fix to get your phone running smoothly again.</p>",
            "<p>Some Moto G6 Plus owners are <a href=\"https://forums.lenovo.com/t5/Moto-G6-Moto-G6-Plus-Moto-G6/Moto-G6-Plus-WiFi-and-Microphone-issues/td-p/4082825\">reporting the Wi-Fi connections</a> on their phones are extremely unreliable. Connections are lost to local Wi-Fi networks every five minutes or so, disrupting streaming services and generally being a nuisance. While it’s claimed that the connection reconnects almost immediately, it’s still enough to cause issues during day-to-day use.</p>",
            "<p>Unfortunately for Moto G6 owners, this seems to be <a href=\"https://forums.lenovo.com/t5/Moto-G5-Moto-G5-Plus/Moto-G5-Plus-wifi-problem/td-p/3618235\">something of a problem</a> within the Moto G’s lineage, as the <a href=\"https://www.digitaltrends.com/mobile/moto-g5-plus-problems-solutions/\">Moto G5  range</a> also had its fair share of this same issue last year . It’s an issue which, as of this writing, have not yet been fully resolved.</p>",
            "<p>While having spotty internet can be bad, having consistently slow internet can be even worse. <a href=\"https://www.reddit.com/r/MotoG/comments/8pqzop/g6_play_wifi_strange_issue/\">One Reddit user</a> has reported shoddy speeds of 1Mbps on their Moto G6 Plus. Thankfully, that same user reported a simple fix that should resolve issues you’re encountering.</p>",
            "<p>Regardless of the model of the Moto G6 you pick, you should be getting at least a day’s worth of usage out of it without too much trouble. If you’re finding your Moto G6’s battery just isn’t holding up <a href=\"https://forums.lenovo.com/t5/Moto-G6-Moto-G6-Plus-Moto-G6/Moto-G6-Battery-issue/td-p/4093363\">anywhere near as well</a>, or is refusing to hold charge even while recharging, then your battery might need recalibrating. There’s <a href=\"https://forums.lenovo.com/t5/Moto-G6-Moto-G6-Plus-Moto-G6/Moto-G6-Battery-issue/m-p/4094105/highlight/true#M329\">an easy way</a> to calibrate the Moto G6’s battery.</p>",
            "<p>While seemingly not a common issue, there have <a href=\"https://forums.lenovo.com/t5/Moto-G6-Moto-G6-Plus-Moto-G6/moto-g6-plus-speaker-completely-off/td-p/4089045\">been reports</a> of Moto G6 speakers cutting out during use, and refusing to turn back on until headphones are inserted or a Bluetooth speaker is connected. This issue seems unrelated to current usage of the speaker, and users have reported the issue happening during YouTube videos, music streaming, and phone calls.</p>",
            "<p>This one’s more difficult to spot, and if you don’t have reason to compare your Moto G6’s screen with another, then you might not even notice it at all. However, in some cases it’s more than obvious there’s something afoot — such as red colors on <a href=\"https://forums.lenovo.com/t5/Moto-G6-Moto-G6-Plus-Moto-G6/Reds-no-displaying-on-Moto-G6/td-p/4103483\">a Moto G6</a> showing as orange or brown.</p>",
            "<p>Thankfully, this one’s simply a rogue color correction gone wrong — and it’s easy to fix.</p>"
        ]
    },
    {
        "title": "\n\t\tMoto G6 and G6 Play: Here’s everything you need to know\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>Fresh from the success of the <a href=\"https://www.digitaltrends.com/android/lenovo-moto-g5-news/\">Moto G5</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lenovo-moto-g5-plus-review/\">G5 Plus</a>, Motorola has been hard at work on successors, aiming to make the best budget handsets ever. The new phones, called the <a href=\"https://blog.motorola.com/2018/04/19/unlimit-yourself-with-the-new-moto-g6-and-moto-e5/\">Moto G6 and Moto G6 Play</a>, feature a number of awesome, modern features, as well as a sweet new look.</p>",
            "<p>This time around Motorola has opted out of releasing a “Plus” version of the Moto G in the U.S., but we do know that a Plus version is coming to international markets. Thinking of buying one of the new Moto G6 models for yourself? You can read more in our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-review/\">Moto G6 and Moto G6 Play hands-on review</a>.</p>",
            "<p>While we might have initially assumed that the new phones would feature a design similar to the Moto G5, Lenovo has opted to make the phones look a little more modern. Like the Moto X, the Moto G6 and Moto G6 Play feature an 18:9 aspect ratio. The standard Moto G6 boasts a 5.7-inch IPS LCD display with a Full HD+ resolution. The Moto G6 Play, on the other hand, keeps the 5.7-inch display but has a standard HD+ resolution.</p>",
            "<p>Like other Moto G devices before it, the standard Moto G6 features a fingerprint sensor underneath the display, while the G6 Play instead has a fingerprint sensor on the back, embedded in the Motorola logo. On the back, they have similar-sized camera modules, though the standard G6 has a dual-sensor camera, while the G6 Play instead has a single-lens camera. They’re also both available in two stunning new colors — black and deep indigo. Another difference is that the Moto G6 Play features an outdated MicroUSB port on the bottom instead of a USB-C — which is a little disappointing.</p>",
            "<p>In general, the phones look pretty good. Sure, they do look like budget devices — but they still look modern and like they belong in 2018.</p>",
            "<p>Like previous Moto G phones, the G6 and G6 Play feature a Qualcomm 400-series chip. The standard Moto G6 features a Qualcomm Snapdragon 450 processor, coupled with either 3GB or 4GB of RAM and either 32GB or 64GB of storage. It also has a MicroSD card slot, so you expand on that storage by up to a hefty 128GB, if you need. The battery on the device sits in at 3,000mAh.</p>",
            "<p>The Moto G6 Play is a little less powerful, but still pretty nice for the price. The device boasts a Qualcomm Snapdragon 427 processor, coupled with either 2GB or 3GB of RAM and either 16GB or 32GB of storage, depending on the model you go for. Like the standard G6, the phone does have a MicroSD card slot — so if you want to expand the storage you can do so by up to 128GB. The battery on the G6 Play is quite a bit bigger than that on the G6 — it sits in at 4,000mAh.</p>",
            "<p>Model options, according to Motorola, vary by region — so you may not be able to choose between the 3GB/32GB model of the standard G6 and the larger, 4GB/64GB model.</p>",
            "<p>Like the Moto G5, the standard Moto G6 offers a dual-sensor camera. There’s a primary 12-megapixel sensor, coupled with a secondary 5-megapixel sensor. The cameras offer an f/1.8 aperture. We’ll have to wait and see just how well they perform — the dual-camera features in the Moto G5 left a little to be desired. The camera can record video at up to 1,080p at 60 frames per second. The front-facing camera on the device sits in at 8 megapixels.</p>",
            "<p>The camera offers some pretty cool features. For starters, Motorola says that it has a “selective focus” feature, that will allow you to take a photo, then change the area of focus and adjust the level of blur. You’ll also get things like face filters and active photos, which will capture a little video before and after a shot. The standard G6 also has a face unlock feature.</p>",
            "<p>The camera on the Moto G6 Play is a little less high-tech. It’s a single-sensor camera that comes in at 13 megapixels with an aperture of f/2.0, so it may not be as good at taking low-light shots. The front-facing camera comes in at 8 megapixels. Thankfully, it still offers some of the great features found on the standard G6, like selective focus and face filters.</p>",
            "<p>The Moto G6 and G6 Play will ship with <a href=\"https://www.digitaltrends.com/mobile/android-o-news/\">Android 8.0 Oreo</a>, though Motorola says that it will be upgraded to Android P when it becomes available. Unfortunately, the phone may not be updated much beyond that, though it will get security updates for two years.</p>",
            "<p>One feature that seems to be largely unique to Moto phones is the one-button navigation, which will be available on the standard G6. What that means is that you can use the home button to control all aspects of Android. Tap it once to go home, swipe right-to-left to go back, and right to left to multitask.</p>",
            "<p>Looking to get the Moto G6 or Moto G6 Play for yourself? The Moto G6 Play comes in at $199, while the standard G6 will be available for $249.</p>",
            "<p>The Moto G6 Play will be available primarily on prepaid carriers including Verizon Wireless, Boost Mobile, Cricket Wireless Virgin Mobile, Republic Wireless, and Ting Wireless. AT&amp;T is the only U.S. carrier that will offer the Moto G6 Play on its postpaid plans. If you would rather purchase an unlocked G6 Play, its available at <a href=\"https://www.digitaltrends.com/go/2ef7d4fa2d4702c07f613aff29aaa1498d9c3556/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Best Buy\">Best Buy</a>, Target, Fry’s, and <a href=\"https://www.digitaltrends.com/go/19b73505fe309586f7e98595dec475ea9584c33f/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"B&amp;H Photo\">B&amp;H Photo</a>.</p>",
            "<p>As for the Moto G6, you will be able to find it on Verizon Wireless, Ting Wireless, and TracFone Wireless. Unlocked versions will be sold at Target, Best Buy, Fry’s, and B&amp;H Photo. If you choose to pick it up on Verizon, you can get it for $10 a month through the carrier’s device payment plan. And if you’re looking for a deal, the Moto G6 is part of the <a href=\"http://www.amazon.com/primeexclusivephones?tag=dt-incontent-btn-20\">Prime Exclusive Phones</a> program, selling for $235.</p>",
            "<p>If you’re interested in international availability, check out the <a href=\"https://blog.motorola.com/2018/04/19/unlimit-yourself-with-the-new-moto-g6-and-moto-e5/\">Moto website</a> for more details.</p>",
            "<p><i>Updated on May 30: Added Prime Exclusive Phones availability. </i></p>"
        ]
    },
    {
        "title": "\n\t\tHere are Moto G6 tips and tricks to help you master your new phone\t",
        "author": [
            "\n\t\t\t\t\t\tBrenda Stolyar\t\t\t\t\t"
        ],
        "text": [
            "<p>This year’s <a href=\"https://www.digitaltrends.com/android/guide-2018-motorola-phones/\">Motorola lineup</a> consists of three different Moto G series phones — the Moto G6, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-plus-review/\">Moto G6 Plus</a>, and Moto G6 Play. While each smartphone brings its own unique qualities to the table, all three devices also share similar features. Regardless of which variation of the Moto G6 you have, we’ve got some handy tips and tricks for you.</p>",
            "<p>The fingerprint scanner on the Moto G6 sits on the front of the device at the bottom of the screen. While you can use it for security, you can also use it to navigate your device. To go home, tap the sensor quickly, to go back simply swipe from right to left on the sensor, to open recent apps swipe from left to right, and to lock the screen you have to touch and hold the sensor until you feel a short buzz. You can also launch assistant by touching and holding the sensor until you hear a long buzz. To access this feature, go to the Moto app, tap on <em>Moto Actions</em> and toggle on <em>One button nav</em>.</p>",
            "<p>With the Moto G6 series, you can use Face Unlock to unlock your phone by looking at it. To set up the feature, go to <em>Settings &gt; Security &amp; Location &gt; Face Unlock</em>. You have to make sure your screen lock setting is set up first which you can do by tapping on the <em>Screen lock</em> section. After that is complete, tap on <em>Face Unlock</em> to begin the process — simply align your face using the front-facing camera and wait for it to capture your facial features. This will automatically toggle on the <em>Bypass lock screen</em> setting which allows the phone to unlock when you press the power key once your face is matched.</p>",
            "<p>But those using the Moto G6 Play are out of luck when it comes to Face Unlock. The feature is only available for the Moto G6 and Moto G6 Plus.</p>",
            "<p>With Moto Key, you can securely log into apps and websites with just your fingerprint — rather than having to type in your passwords each time. To access the Moto Key go to the Moto app and tap <em>Moto Key</em>. You have to set up your fingerprint first but afterward, you will be brought to a window that asks you to sign in to your Lenovo account as an extra form of security. You will then be able to choose from a variety of apps to assign your fingerprint to such as Facebook, Twitter, and more. You can also add Windows devices like a PC or tablet if it’s compatible.</p>",
            "<p>For one-handed use (which might be useful on the Moto G6 Plus given its size), you can shrink the screen. The option is located in the Moto app which you can find by going to <em>Moto Actions &gt; Swipe to shrink screen. </em>After you toggle the feature on, simply swiping down to the left or right will shrink the screen to its respective corner allowing you to easily access different apps.</p>",
            "<p>Moto Actions also provides you with a variety of different features to make using your phone easier all with simple gestures. When you go the Moto app, tap on <em>Moto Actions</em> and you’ll be brought to a list of different ones you can toggle on. There is <em>Quick Screenshot</em> — allowing you to touch and hold on the screen with three of your fingertips to capture it, along with <em>Pick up to stop ringing</em> which turns incoming calls to vibrate when you lift your device, among others.</p>",
            "<p>There are a variety of different ways you can customize the display on your <a href=\"https://www.digitaltrends.com/cell-phone-reviews/moto-g6-review/\">Moto G6</a>. To make changes to your display go to <em>Settings &gt; Display</em> and you will be brought to a list of different options. You can toggle on adaptive brightness (to optimize the brightness level for available light), change the font and display size, and more. You can also choose how colors appear on the display in the <em>Color Mode</em> section — which allows you to adjust the color temperature between warm, neutral, and cool, as well as pick between standard and vibrant color to display your content in.</p>",
            "<p>With Moto Display, which you can access by going to the Moto app, you can toggle on features like <em>Night Display</em> to reduce blue light exposure before you go to sleep and <em>Attentive Display</em> so that the screen stays on when you’re looking at it. There is also <em>Moto Display</em> which shows notifications that fade in and out while the screen is off — other settings under this feature include the ability to block notifications from specific apps, adjusting the level of detail to show when it comes to notifications. You can also toggle on <em>Quick Reply</em> which allows you to reply to texts without unlocking the device.</p>",
            "<p>With the Moto G6, there are a few ways to adjust your camera settings which you can access by opening the camera app, swiping to the left, and tapping on <em>Settings</em> located at the top of the screen. From there, you can choose to toggle on <em>Quick Capture</em> — which allows you to open or switch between cameras by twisting your wrist twice.</p>",
            "<p>There is also <em>Tap anywhere to capture</em>, where you can take a photo by tapping anywhere on the screen within the camera app (for multiple shots, tap and hold). You can change the focus and exposure as well by dragging the bracket to set the focus and automatically adjust exposure.</p>",
            "<p>Baked into Android 8.0 Oreo, the split-screen feature on the Moto G6 allows you to have two apps open on the screen at once. Simply open an app and then press and hold either the recent apps or the multitasking button. The app that was already open will then only take up half the screen and the other app will be placed at the bottom of the screen. To exit split-screen mode, tap and hold the recent apps button again or drag the resize bar up or down.</p>"
        ]
    }
]