[
    {
        "title": "\n\t\tForget about the jack: How to use Bluetooth AptX HD on the OnePlus 6T\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T</a> does not have a 3.5mm headphone jack, meaning to enjoy listening to music on the phone, you either have to deal with a dongle, use OnePlus’s own USB Type-C Bullets headphones, or turn to a wireless Bluetooth connection. The good news is, OnePlus continues to be one of the <a href=\"https://www.aptx.com/products?field_product_category_tid=126&amp;field_aptx_type_tid=483\">few manufacturers</a> that adds <a href=\"https://www.aptx.com/aptx-hd\" target=\"_blank\" rel=\"noopener\">Bluetooth AptX HD</a> into its phones. It’s a wireless audio codec that provides a greater-than-CD quality sound when using compatible wireless headphones.</p>",
            "<p>To <a href=\"https://www.digitaltrends.com/mobile/aptx-hd-vs-chord-mojo/\">experience AptX HD</a>, you need to follow a few simple stages to get it working. Here’s our guide to enjoying AptX HD on your OnePlus 6T. If you haven’t bought a OnePlus 6T yet, read our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T review</a> to find out why you should.</p>",
            "<p>Owning the OnePlus 6T gets you only halfway to AptX HD audio nirvana. You also need an AptX HD-ready pair of headphones. That’s right, your old pair of well-used in-ears that came free with an old phone won’t cut it here. You’re going to have to splash out, but it’s worth it.</p>",
            "<p>The easiest way to find out what headphones are ready for AptX HD is visit <a href=\"https://www.aptx.com/products?field_product_category_tid=125&amp;field_aptx_type_tid=483\">the AptX website</a>, where you’ll find a complete, up-to-date list of compatible hardware. We are particular fans of the superb <a href=\"https://www.digitaltrends.com/headphone-reviews/sony-wh-1000xm2-review/\">Sony WH-1000xM2</a> headphones, the amazing <a href=\"https://www.digitaltrends.com/home-theater/audio-technicas-ath-dsrbt9-aptx-hd-bluetooth-headphones-were-almost-never-made/\">Audio Technica ATH-DSR9BT</a> over-ears, and the excellent <a href=\"https://www.digitaltrends.com/headphone-reviews/bowers-and-wilkins-px-headphones-review/\">Bowers &amp; Wilkins PX</a> noise canceling headphones.</p>",
            "<p>More products are being released with AptX HD support all the time, so if you don’t find a pair to suit right now, do keep checking back.</p>",
            "<p>You’ve got your OnePlus 6T, and the right pair of Bluetooth headphones all ready to go. Now, we need to prepare and then pair them together. Here are the stages you need to follow:</p>",
            "<p>That’s it. You’re now set up for the best wireless audio quality you’ll hear.</p>",
            "<p>When you use AptX HD and play hi-res files, the sound is as close to high resolution audio quality usually provided by wired headphones as you’ll get. It plays up to 48kHz/24-bit LPCM audio, and it’s genuinely unlike any wireless Bluetooth experience you’ll have had before. To get this, you should use hi-res sources, such as <a href=\"http://tidal.com\" target=\"_blank\" rel=\"noopener\">Tidal HiFi</a>, or your own hi-res music files.</p>",
            "<p>Playing regular MP3 files, or music from <a href=\"https://www.spotify.com/uk/\" target=\"_blank\" rel=\"noopener\">Spotify</a>, will sound better using AptX HD; but it won’t be the eye-opening experience you’ll have with hi-res content.</p>"
        ]
    },
    {
        "title": "\n\t\tOnePlus charges into U.K. carrier stores, leaving online-only start in the past\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p><a href=\"https://www.oneplus.com/6\" target=\"_blank\" rel=\"noopener\">OnePlus</a> started life out as an online-only smartphone brand, and has since gone on to launch a string of desirable devices, which has impressed the press and buyers alike. This has led to a major new announcement. For the OnePlus 6T, its next big smartphone launch, OnePlus devices will be sold in more carriers and retail stores in the United Kingdom.</p>",
            "<p>Network operators EE and Vodafone will both sell the <a href=\"https://www.digitaltrends.com/mobile/oneplus-6t-news/\">OnePlus 6T</a>, alongside Carphone Warehouse, and larger high street retailer John Lewis. Mobile device distributer DataSelect will also sell the OnePlus 6T. It’s not the first time a OnePlus phone will be available outside of OnePlus’ own online store, and the new partners, in fact, join the O2 network, which already sells the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6-review/\">OnePlus 6</a>, and has sold previous OnePlus phones too.</p>",
            "<p>There are two major reasons why this is big news. The first is more attention for OnePlus. Buying phones online isn’t something most people do, and by physically having its phones alongside those from Apple, Samsung, Huawei, and others in a retail store means more attention. OnePlus makes compelling smartphones, and the more people who’re introduced to them, the more who will consider buying them.</p>",
            "<p>The second reason is online sales can feel like a risk, even if there is a comprehensive returns program, because you can’t touch, hold, and try the phone out ahead of handing over your money. With three networks and two major high street names all stocking the OnePlus 6T, the trepidatious have plenty of opportunity to try the device out for size. Removing these barriers is a major step forward for OnePlus.</p>",
            "<p>OnePlus has a strong reputation in the U.K. already, and according to the company itself, has been named as one of the top four premium smartphone brands. The OnePlus 6 sold a million devices in 22 days, and the company no doubt hopes to improve on those numbers with the OnePlus 6T, which will be announced on October 30 at an event in New York. It’s the second OnePlus phone of 2018, and is expected to provide performance improvements, with some smart new features including an in-display fingerprint sensor.</p>",
            "<p>Read all the <a href=\"https://www.digitaltrends.com/mobile/oneplus-6t-news/\">rumors about the OnePlus 6T here</a>, and look forward to our in-depth coverage of the new device from October 30 onwards.</p>"
        ]
    },
    {
        "title": "\n\t\tOnePlus 6T McLaren Edition: Everything you need to know\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>OnePlus has teamed up with automotive brand and F1 racing team McLaren to launch a collaborative smartphone. Its latest model, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T</a>, was just revealed in October, but OnePlus has partnered with brands, artists, and companies in the past to produce special limited edition versions of its smartphone. So what makes the <a href=\"https://www.oneplus.com/mclaren\">OnePlus 6T McLaren Edition</a> special? Here’s what you need to know.</p>",
            "<p>The OnePlus 6T McLaren Edition will borrow heavily from the style of the OnePlus 6T, but there are some cosmetic differences between the two phones. The back of the McLaren Edition will emulate the look of McLaren’s ground-breaking carbon fiber with a carbon fiber-style appearance. There’s another nod to McLaren’s heritage as well, with an orange line flowing along the bottom of the phone’s rear. It’s colored in Papaya Orange — McLaren’s signature color. Right down at the base of the phone, you’ll find McLaren’s logo.</p>",
            "<p>Little has changed around the front, and you’ll find the OnePlus 6T’s huge bezel-less 6.41-inch AMOLED screen, and the distinctive teardrop notch. The in-display fingerprint scanner is here too, and buyers will get some unique wallpapers and a special start-up animation too.</p>",
            "<p>It wouldn’t be a McLaren without some power and speed, right? The OnePlus 6T is no slouch in the power department, with the Snapdragon 845 and 8GB of RAM. OnePlus isn’t able to top the Snapdragon 845 … yet. But it can boost performance by crammed in yet more RAM. The McLaren Edition sports a huge 10GB of RAM, meaning this phone should have no problem switching between apps or handling the most intensive of games.</p>",
            "<p>That’s backed up by the huge hard drive, too. There’s 256GB of storage crammed into the McLaren Edition, and though you won’t find any MicroSD expansion, you’re unlikely to need that much extra space anyway.</p>",
            "<p>There haven’t been any major changes made to the camera in the OnePlus 6T McLaren Edition, so you can expect to find the same camera suite as <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">the OnePlus 6T</a>. That means a primary 16-megapixel camera with an f/1.7 aperture and optical image stabilization, and a second 20-megapixel lens with the same aperture, plus another 16-megapixel lens around the front for selfies.</p>",
            "<p>Lamborghini’s partnership with Oppo — a firm closely related to OnePlus — resulted in the <a href=\"https://www.digitaltrends.com/mobile/oppo-find-x-lamborghini-edition-product-impressions/\">Lamborghini Edition of the Oppo Find X</a>, the first to feature Oppo’s incredibly fast Super VOOC charging system, which takes a flat battery to 100 percent in less than 35 minutes. In a similar fashion, the OnePlus 6T McLaren Edition is packing a new version of Warp Charge: Warp Charge 30.</p>",
            "<p>Warp Charge 30 works in a similar way to Super VOOC charging, but it’s even faster, promising to deliver a day’s worth of power (around 50 percent) in just 20 minutes. That’s possible because of the sheer power on display here — the charger the phone comes with packs a whopping 3oW of power, and that’s managed with an intricate system of cooling that ensures the phone doesn’t overheat during charging.</p>",
            "<p>The OnePlus 6T McLaren Edition will be available in the U.S. and Europe from December 13, from <a href=\"https://www.oneplus.com/mclaren\">OnePlus’ website</a>. In line with OnePlus’s own pricing structure, you won’t have to pay a ridiculous amount for the phone — at $699 it’s only a little more expensive than the highest spec OnePlus 6T.</p>",
            "<p><em>Updated on December 11, 2018: We’ve updated this article for the phone’s release.<br>\n</em></p>"
        ]
    },
    {
        "title": "\n\t\tHonor View 20 vs. OnePlus 6T: Hole punches versus notches\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>The notch is dead — long live the hole-punch display. Honor’s View 20 is the forerunner of the new hole-punch movement, and it’s a doozy of a phone, with a powerful Kirin 980 processor, a massive display, and some gorgeous good looks. But here be monsters, and the OnePlus 6T is the <a href=\"https://en.wikipedia.org/wiki/Kraken\">kraken</a> of the midrange phone market, with power, looks, and features far beyond its sub-$600 price tag. Can the Honor View 20 take down the beast and claim a place in the pantheon of <a href=\"https://www.digitaltrends.com/mobile/best-smartphones/\">the best phones of 2019</a>? We took a look to find out.</p>",
            "<p>You’ll find two top-notch “flagchips” going head-to-head here, and there’s little to part the OnePlus 6T’s Snapdragon 845 and the View 20’s Kirin 980 in benchmarks and real-life performance. Both of these offer tip-top smoothness and powerful gaming performance. Both pack roomy storage, with 128GB and 256GB storage options, as well as models with 6GB and 8GB of RAM.</p>",
            "<p>But what of battery life? The View 20 has an edge over the OnePlus 6T with a battery that’s 300mAh larger, but the excellent software means you’re likely to see two days of battery life on the View 20. The 6T is no slouch there either though, managing a day-and-a-half on a single charge — but the View 20 is clearly superior. There’s no wireless charging on either phone, but both come with super-fast charging that’ll refill your battery in no time at all.</p>",
            "<p>It’s a close-run competition, but the View 20’s larger battery life wins it the round.</p>",
            "<p><strong>Winner: Honor View 20<br>\n</strong></p>",
            "<p>Borders are well and truly gone, and both of these phones boast exceptional bezel-free designs. Modern style is prevalent here, and so we find glass builds, sleek looks, and subtle refractions built into the back panels — the “S” on the 6T and the reflective “V” on the View 20. Glass means both phones are susceptible to damage, and neither come with water-resistance, which is a real shame.</p>",
            "<p>However, the really big difference between the two looks like it’ll be a 2018 versus 2019 issue — the hole punch versus the notch. The 6T’s teardrop notch is subtle for a notch, but the hole punch almost seems to disappear during normal use. We think it’s a big enough difference to give an edge to the View 20.</p>",
            "<p>There’s a clear winner here, but it’s important to note that both phones are gorgeous, and you won’t be disappointed with either. However, the hole punch is superior to the notch — even a discreet notch like the 6T’s. The Honor View 20 wins.</p>",
            "<p><strong>Winner: Honor View 20<br>\n</strong></p>",
            "<p>Much like bezels, it seems <a href=\"https://www.digitaltrends.com/mobile/best-smallest-smartphones/\">small phones</a> have had their day. Both the View 20 and the 6T are enormous, with screens that exceed 6 inches in size. The View 10’s 6.4-inch LCD display runs a 2310 x 1080-pixel resolution, and it’s good, with plenty of user customization available. However, it pales next to the OnePlus 6T’s 6.41-inch AMOLED display. While it runs a similar 2340 x 1080-pixel resolution, the AMOLED screen tech means crisper contrast, blacker blacks, and more vibrant colors. It’s simply the better screen.</p>",
            "<p><strong>Winner: OnePlus 6T<br>\n</strong></p>",
            "<p>You’ll find a 16-megapixel and a 20-megapixel lens on the back of the OnePlus 6T, backed up by a 16-megapixel lens around the front. It’s probably the best camera suite we’ve seen from OnePlus so far, and it takes some great photos. The portrait mode edge detection is particularly worthy of note. The OnePlus 6T’s camera suite also includes a 2x telephoto zoom lens, and slow motion at 480 frames per second.</p>",
            "<p>But is it good enough to beat the View 20? Bucking Honor’s usual trend, the View 20 only packs a single lens. But it’s a monster — 48-megapixels, and backed up by a 3D Time-of-Flight sensor. The front-facing lens is a similarly monstrous 25-megapixel beast. Normally, we don’t put much stock in numbers, but the View 20 walks the walk, and produces some excellent shots in a variety of circumstances. While not on the level of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Pixel 3</a> or the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-pro-review/\">Mate 20 Pro</a>, we feel it’s almost there — and that’s a shocking thing to admit in a phone this price. The View 20 also comes with twice the amount of slo-mo at 960 frames per second.</p>",
            "<p>While the OnePlus 6T has a great camera suite, the View 20 has kicked Honor off to a great start in 2019.</p>",
            "<p><strong>Winner: Honor View 20<br>\n</strong></p>",
            "<p><a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a> is a beautiful thing, and you’ll find it on both phones — though you might not initially realize it. OnePlus’ Oxygen OS is the closest to a stock Android, being rather similar to the version of Android we see on Pixels. That’s very much a good thing, and it’s customizable too. There’s even the option to use <a href=\"https://www.digitaltrends.com/mobile/how-to-use-android-9-pie-gesture-navigation/\">Android’s new swiping-based gesture navigation</a>. The View 20 has Honor’s own Magic UI 2, and it’s a heavily customized version of Android based on Huawei’s EMUI software. If you’re not used it, prepare yourself; this isn’t anywhere close to a normal Android experience. But it still has its charms, and we’ve grown to enjoy it.</p>",
            "<p>The update situation is a little more lop-sided. OnePlus has always been fairly <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">snappy with updates</a>, while Honor traditionally puts out updates a little bit later — mostly due to the work needed to build the heavily customized skin. Will that change with the new Magic UI 2? Maybe, but for now, OnePlus has the faster update speed and a slimmer Android interface, and that counts for a lot.</p>",
            "<p><strong>Winner: OnePlus 6T<br>\n</strong></p>",
            "<p>Budgets have to be cut somewhere with midrange phones, and with top specs and designs, there’s not much room for many special features. However, there’s still some stuff here to be excited about. Both phones have a gaming mode that strips away distracting notifications and boosts gaming performance and network speed, and both phones have facial unlocking options. The OnePlus 6T’s in-display fingerprint scanner may be enough to wow some, but we found it a little unreliable in practice, even if the tech is really cool in itself. Speaking of other slight disappointments, despite AptX HD support, sound on the Honor View 20 failed to match our expectations.</p>",
            "<p>This category is a hard one to crack, but we’re giving it to the OnePus 6T, simply because the in-display fingerprint scanner is so cool.</p>",
            "<p><strong>Winner: OnePlus 6T<br>\n</strong></p>",
            "<p>The OnePlus 6T is currently available, with prices starting from $549. You can get it directly from <a href=\"https://www.awin1.com/cread.php?awinmid=10855&amp;awinaffid=291795&amp;clickref=&amp;p=https%3A%2F%2Fwww.oneplus.com%2F6t%2F\">OnePlus</a>, or pick it up from <a href=\"https://www.t-mobile.com/cell-phone/oneplus-6t\" rel=\"noopener\">T-Mobile</a> or <a href=\"https://www.amazon.com/OnePlus-A6003-Dual-SIM-Unlocked-Smartphone/dp/B07CHQHFDZ/?tag=dt-incontent-btn-20\" www.>Amazon</a>. It will only work with GSM networks like T-Mobile and AT&amp;T.</p>",
            "<p>The <a href=\"https://www.hihonor.com/global/products/smartphone/honorview20/?fromBanner=home_content_HONOR_View20/\">Honor View 20</a> starts from 500 British pounds (currently around $650), though it’s worth noting that the OnePlus 6T also starts from 500 British pounds in the U.K. It’s unclear whether the Honor View 20 will be officially released in the U.S., but if you import it we expect it will only work fully with T-Mobile and AT&amp;T.</p>",
            "<p>It’s a close run competition, but for our money, the Honor View 20 pulls ahead of the OnePlus 6T with a strong battery, a design that’s very 2019, and a pretty amazing camera. But that doesn’t mean the OnePlus 6T is without its charms — it’s beautiful, it’s powerful, and it’s a bargain. But the Honor View 20 is just stronger at this point. We imagine the <a href=\"https://www.digitaltrends.com/mobile/oneplus-7-news/\">OnePlus 7</a> will put up a good fight though, and we’ll be sure to pit the View 20 against OnePlus’s latest when it arrives.</p>"
        ]
    },
    {
        "title": "\n\t\tOnePlus 6T vs. OnePlus 6 vs. OnePlus 5T vs. OnePlus 5: Should you upgrade?\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>The self-proclaimed “flagship killer” has come a long way over the last few years, with an aggressive policy of turning out new smartphones every six months. OnePlus has consistently offered close-to-cutting-edge specs at knockout prices that undercut the competition.</p>",
            "<p>It looks as though the OnePlus 6T is the best phone the company has ever turned out, but how does it measure up to its predecessors? We decided to pit it against the last three OnePlus releases to see precisely what has changed and to help you decide whether it’s time to pull the trigger on an upgrade.</p>",
            "<p>If you’re looking for an area of compromise where OnePlus scrimps to keep its costs down, you won’t find it in the performance department. The OnePlus 6T and OnePlus 6 both have the virtually ubiquitous Qualcomm Snapdragon 845 processor inside, which you’ll also find in everything from <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Samsung’s Galaxy Note 9</a> to <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Google’s Pixel 3</a>. The older OnePlus 5T and 5 have the previous year’s Snapdragon 835, which is slightly slower and less power efficient.</p>",
            "<p>All of them come with 6GB or 8GB of RAM, which <a href=\"https://www.digitaltrends.com/mobile/how-much-ram-does-a-smartphone-need/\">may be overkill</a> unless you’re a major multitasker. Storage has been upped from 64GB or 128GB to 128GB or 256GB in the newest phone. OnePlus is not keen on the humble MicroSD card slot, so you won’t find one in any of these phones.</p>",
            "<p>The 3,300mAh battery found in the OnePlus 5, 5T, and 6 has finally been upgraded in the 6T to 3,700mAh. Even accounting for the larger display, that should provide a boost to stamina. All of these phones support fast charging, but you won’t find any Qi wireless charging support.</p>",
            "<p><strong>Winner: OnePlus 6T</strong></p>",
            "<p>We think this is a category where you can see the clearest evolution of the OnePlus range. We felt the OnePlus 5 was aping the iPhone a little too closely, but the fingerprint sensor moved around back in the 5T. The OnePlus 6 did adopt the notch, but it was smaller than the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X’s</a> and the central camera module and fingerprint sensor on the back gave it a feel of its own. The OnePlus 6T is perhaps its most distinct phone yet, with that teardrop notch, the slimmest of bottom bezels, and an in-display fingerprint sensor. It’s a refined, attractive design that’s going to turn heads.</p>",
            "<p>Water resistance is an area where OnePlus has cut corners. While most flagship smartphones nowadays can be submerged without damage, there’s no <a href=\"https://www.digitaltrends.com/mobile/how-rugged-is-your-phone/\">IP-rating</a> for any of these OnePlus phones. The OnePlus 5T and OnePlus 5 both had aluminum frames and backs, but the newer duo are glass front and back, so durability is definitely an issue here. It should be noted the OnePlus 6T is wrapped in Gorilla Glass 6, which is the <a href=\"https://www.digitaltrends.com/mobile/corning-gorilla-glass-6-news/\">most durable version from Corning yet</a>.</p>",
            "<p>Something that’s sure to disappoint some people is the lack of a traditional headphone port in the OnePlus 6T, especially since all the other phones here have a standard 3.5mm audio jack.</p>",
            "<p><strong>Winner: OnePlus 6T</strong></p>",
            "<p>The shift in the display from the OnePlus 5 through to the OnePlus 6T mirrors wider industry trends. We’ve gone from a 5.5-inch display with a 16:9 aspect ratio to a 6.4-inch display with an 19.5:9 ratio, which has prompted a resolution shift from 1,920 x 1,080 pixels to 2,340 x 1,080 pixels. Interestingly, all these phones have essentially the same pixel density and they’re all AMOLED screens. The extra size isn’t the only benefit of the OnePlus 6T’s display though, it’s also brighter, with better color accuracy and more software tuning options than its predecessors.</p>",
            "<p><strong>Winner: OnePlus 6T</strong></p>",
            "<p>On paper, it looks like these phones all have the same exact camera setup, a dual-lens 16-megapixel and 20-megapixel main camera and a 16-megapixel front-facing camera. There have actually been a few jumps in the hardware quality, with newer sensors, and lots of developments on the software and tuning side that mean you can <a href=\"https://www.digitaltrends.com/mobile/oneplus-6-oneplus-5t-oneplus-5-oneplus-3t-camera-shootout/\">see concrete improvements</a>. The camera in the OnePlus 6 is definitely better than the cameras in the 5 and 5T. The OnePlus 6T also features some new artificial smarts for scene recognition and improved portrait and low-light capabilities, but we’ve yet to test it against the OnePlus 6, so we’re not yet sure if there’s any discernible jump in quality.</p>",
            "<p>Only the 6 and 6T have super slow motion video support.</p>",
            "<p><strong>Winners: OnePlus 6 and 6T</strong></p>",
            "<p>With <a href=\"https://www.digitaltrends.com/mobile/android-9-pie-review/\">Android 9.0 Pie</a> out of the box, the OnePlus 6T has a clear advantage. The OnePlus 5 and 5T can both be upgraded to Android 8.1 Oreo, which is what the OnePlus 6 launched with, and they will eventually get the update to Android Pie. The OnePlus 6 has received the Android 9.0 Pie update already. All of them have OxygenOS on top, which offers various customization options and shortcuts that you won’t find in stock Android. We expect the 6T and 6 to have a similar shelf life in terms of updates, so there’s no dividing them here.</p>",
            "<p><strong>Winners: OnePlus 6 and 6T</strong></p>",
            "<p>The in-display fingerprint sensor enabled OnePlus to hit new heights with its design in the 6T, but most of the other special features are nothing new for the range. As mentioned, OxyegnOS offers lots of gesture shortcuts and customization options, and there’s also a special gaming mode to prevent interruptions and ensure your gaming sessions are as smooth as possible.</p>",
            "<p><strong>Winner: OnePlus 6T</strong></p>",
            "<p>Price has always been a major selling point for the <a href=\"https://www.digitaltrends.com/go/6cfa98ff938c3cd1175de0233aa9850c88d91bb5/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"OnePlus\">OnePlus</a> range, but it has been creeping higher with each new phone. We’ve gone from $480 for the basic model of the OnePlus 5 up to $550 for the OnePlus 6T, but that’s still great value compared to other flagships on the market. OnePlus also discontinues its older phones as soon as the new ones are released, so there’s no option to go back and buy an older model unless you can find some remaining stock from another seller.</p>",
            "<p>The OnePlus 6T is also available now from T-Mobile, giving you another place to buy it from. It’s also compatible on Verizon — a first for OnePlus — making it the most accessible OnePlus phone ever.</p>",
            "<p>The <a href=\"https://www.digitaltrends.com/go/6cfa98ff938c3cd1175de0233aa9850c88d91bb5/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"OnePlus\">OnePlus 6T</a> is the best phone that OnePlus has made so far, but it’s very, very similar to the OnePlus 6. We’re talking about some extra battery capacity, a better design, and a slightly bigger display. If you already have the OnePlus 6, then you should hold onto it for a while. For people with the OnePlus 5T or OnePlus 5, the 6T is going to be a more tempting upgrade, and you can add faster performance and a better camera to the list of temptations.</p>"
        ]
    },
    {
        "title": "\n\t\tThe OnePlus 6T has a secret weapon, and it’s not what you think\t",
        "author": [
            "\n\t\t\t\t\t\tJulian Chokkattu\t\t\t\t\t"
        ],
        "text": [
            "<p>Amazing tech isn’t the killer feature of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">brand new OnePlus 6T</a>, such as the in-display fingerprint sensor or the new Gorilla Glass 6 protection, which should survive multiple bumbles and fumbles. Neither are this fantastic smartphone’s drool-worthy good looks, nor a price tag that will make you do a double take, the real breakthrough here.</p>",
            "<p>No, that would be a partnership OnePlus announced with T-Mobile, as well as support for Verizon’s network – both of which make the OnePlus 6T the most accessible phone for U.S. consumers ever for the company. That’s a big deal, because it means the brand can finally stream through the public consciousness. Yes, within the tech world, OnePlus has become an established, reputable brand in a relatively short period of time. But ask most Americans if they’ve heard about it and you’ll see shrugs.</p>",
            "<p>It’s something we’ve asked OnePlus almost every time the company has launched a phone: When will you get a U.S. carrier on board?</p>",
            "<p>OnePlus smartphones have previously supported only the GSM network, which meant they were compatible with AT&amp;T and T-Mobile, and not Verizon or Sprint. Even then, you couldn’t go to a store to see these phones in action; the company has never sold them through a carrier, just <a href=\"https://www.oneplus.com/\">on its site</a>.</p>",
            "<p>You need carrier support to break through the duopoly that is Samsung and Apple, especially because most Americans buy their phones this way or through retail stores.</p>",
            "<p>“Brick and mortar stores will still be one of the main channels for smartphone sales,” Jeff Fieldhack said in <a href=\"https://www.counterpointresearch.com/online-smartphone-sales-remain-strong-at-13-of-total-us-sales-prime-exclusives-by-amazon-drive-sales/\">a Counterpoint Research report</a> on smartphone sales in the second quarter of 2018. “Physically touching and testing high-end devices is still important for the consumer as flagship [average selling prices] continue to climb. … While Amazon is doing well, carriers still have the upper hand. Online sales will continue to grab small amounts of market share, but it will not spike outside of key flagship launches, holidays, and special online sale days.”</p>",
            "<p>OnePlus is putting its latest phone into 5,600 T-Mobile stores around the country. And the T-Mob won’t just be displaying and advertising the phone; it’s also offering to shave $300 off the price if you trade-in a select device (the supported list is long), bringing an already affordable flagship phone to a truly unbeatable price.</p>",
            "<p>Better yet, T-Mobile is offering financing so you can pay the phone off in easy, monthly payments. (The only trade off with the T-Mobile deal? It’s for the mirror gloss variant with 8GB RAM and 128GB of storage, and it lacks dual-SIM support.)</p>",
            "<p>Then there’s Verizon support. Verizon has more than 150 million subscribers in the U.S., allowing OnePlus to reach millions more it couldn’t before — and grow from there. The OnePlus 6T will still need to be bought from OnePlus’ site, but it’s not a barrier anymore as you can simply throw in a Verizon SIM card for cellular service to kick in. The phone supports Verizon’s LTE band, including support for VoLTE and Wi-Fi calling.</p>",
            "<p>Increased carrier support means more people will be conscious of the brand, and the T-Mobile partnership will allow those interested to try the phones in stores before they buy. This doesn’t just impact the U.S., as OnePlus has added more carriers around the world. It now supports 233 carriers in 74 countries. In the U.K., the phone will be available in EE and Vodafone stores alongside the O2 network.</p>",
            "<p>This also couldn’t be a more perfect time for OnePlus. Smartphone prices are rising. Even the OnePlus 6T costs a little more than <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6-review/\">the OnePlus 6</a>, but it’s still a fraction of what you’d pay for an <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-review/\">iPhone XS</a> or a <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Galaxy Note 9</a>. U.S. consumers hold onto their phones for an average of 2.83 years before they decide to upgrade, according to HYLA Mobile Inc., reported by the <a href=\"https://www.wsj.com/articles/upgrade-no-thanks-americans-are-sticking-with-their-old-phones-1540818000\">Wall Street Journal</a>, and it’s partly due to rising prices. Wider network support means OnePlus can show consumers they do not need to pay upwards of $700 for a good phone.</p>",
            "<p>In our review, we described the OnePlus 6T as “everything you want at half the price,” and it’s true. You get the same processor that powers the Galaxy Note 9; there’s a big battery that will easily get you through a full day; and the 6.4-inch screen covers almost the entire front of the phone. The downsides are it only has a decent camera, there’s no headphone jack, no proper water resistance, and the new under-glass fingerprint sensor isn’t as reliable. These are minor problems, though … because everything else about the OnePlus 6T makes this one of the best value phones you can buy right now.</p>"
        ]
    },
    {
        "title": "\n\t\tNew Moment photo cases and lenses are a big plus for the OnePlus 6T\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Moment is the king of high-quality photography tools for smartphones, with a range of lenses, cases, and other equipment that makes taking high-quality video and pictures a snap. Unfortunately, Moment only supports a fairly small range of smartphones, so you need to have the right device to take advantage. Thankfully, you can add two more phones to that pile, as Moment has just announced it will be stocking cases and lenses for the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6-review/\">OnePlus 6</a> and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T</a>.</p>",
            "<p>If you’re not familiar with Moment’s range, it consists of a variety of lenses, gimbals, lights, and other useful photography gear, all of an extremely high quality. The kicker is that since much of the equipment is attached to a phone via a protective case, it’s not really possible to use Moment’s kit with a phone it hasn’t specifically supported. Those lucky OnePlus fans are about to be included in that exclusive club, with the release of <a href=\"https://www.shopmoment.com/one-plus-6-moment-lenses-and-cases\">Moment cases for the OnePlus 6</a>. Moment has also taken the opportunity to upgrade its cases, adding more protection against drops, an improved and strengthened lens interface, and increased coverage at the bottom of the case.</p>",
            "<p>Cases for the OnePlus 6 will be available in black canvas and walnut wood from December 11, at the price of $30. If you’re rocking the OnePlus 6T, you’ll have to wait a little longer, as cases are not shipping until February 2019, but you’ll still be able to find them in black canvas and walnut wood, and for $30. However, if you’re quick off the mark, you can get 15 percent off all OnePlus cases for the first 24 hours with the code “OnePlus6.”</p>",
            "<p><a href=\"https://www.shopmoment.com/shop/categories/lenses\">All of Moment’s lenses</a> will work with the OnePlus 6 and 6T cases, including the macro lens, 58mm telescopic lens — which we’ve explored in <a href=\"https://www.digitaltrends.com/photography/moment-58mm-telephoto-lens-product-impressions/\">great detail here</a> — and the movie-emulating <a href=\"https://www.digitaltrends.com/photography/moment-anamorphic-lens-review/\">anamorphic lens</a>. Moment has put together an in-depth video exploring the new OnePlus case and the huge variety of lenses that can be attached.</p>",
            "<p>Moment has also been tweaking its <a href=\"https://www.digitaltrends.com/photography/moment-pro-camera-app-launches/\">Pro Camera App</a>, and has released <a href=\"https://itunes.apple.com/app/apple-store/id927098908?mt=8\">version 3.5 of its iOS app</a> today. Available for both <a href=\"https://itunes.apple.com/app/apple-store/id927098908?mt=8\">iOS</a> and <a href=\"https://play.google.com/store/apps/details?id=com.shopmoment.momentprocamera\">Android</a>, it gives a huge amount of control over images and videos, featuring a live histogram, shooting in RAW, dual-channel audio, and tons more. It will cost $2 on Android and $5 on iOS.</p>"
        ]
    },
    {
        "title": "\n\t\tThe best OnePlus 6T cases\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>OnePlus is the king of the bargain Android flagships, and its latest triumph — the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T</a> — is a masterclass in the techniques OnePlus has long taught. This beautifully designed phone is also super powerful and packed with the latest trends and tricks. Best of all, you can get a hold of one <a href=\"https://www.digitaltrends.com/mobile/how-to-buy-oneplus-6t/\">for under $600</a>.</p>",
            "<p>But you’re not going to be cavalier with it just because it’s one of the cheapest ways to own a fully featured flagship. Good looks are marred by scratches and bumps, and that bezel-less display could be ruined by an unlucky bump or a slip from the table. Keeping your shiny new phone looking good should be a priority, but life is hazardous and you can’t keep your phone wrapped in cotton wool.</p>",
            "<p>Why not wrap it something else instead? A good phone case can provide a barrier against external threats, and make sure your phone keeps kicking until you’re ready to replace it. Here are the best OnePlus 6T cases to keep the “flagship killer” slaying.</p>",
            "<p>Spigen’s a name you can rely on for great everyday protection, and we think the Liquid Air is a good choice if you’re looking for stylish protection that won’t let you down. It’s made from shock-resistant and absorbent TPU that guards well against a variety of threats and hazards. Each corner is protected with Spigen’s Air Cushion Technology to further resist the energy from impacts and drops, and the slim design means it’s easy to slip in and out of a pocket. Speaking of style, the Liquid Air is no ugly duckling with triangular patterning and a matte finish that resists fingerprints. Best of all, it’s not too expensive.</p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/905bee9ebebb4c403397797c64f16539745319b9/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Spigen\">Spigen</a> <a href=\"https://www.digitaltrends.com/go/d718e9a0286d3ef74b6fbbcd6f0c1be16e5d8239/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>If you’re looking for executive-chic, or want to add utility to your phone, then a wallet case should be on your list. This case from Noreve is definitely on the premium end, with prices starting at around $48 for the PU leather option. However, customizability is the name of the game, and you can choose a variety of leathers for your case, up to the expensive aged Patine leather. If that wasn’t enough, you can also choose from a bunch of colors, a belt clip, and even add a personal logo or picture — though it’ll skyrocket in price if you go for all of them. But if the price is no concern, and you want a gorgeous, luxurious leather case, check out Noreve.</p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/1c857d47b56079f8c8eec4624b8218a2aaa38b9f/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Noreve\">Noreve</a></p>",
            "<p>Protection needn’t come at a sky-high cost. Poetic’s cases are extremely functional protective cases with a low price, and if you need great protection on a budget, you need to check them out. The Guardian is made from polycarbonate and TPU, with a clear PC back supported by a shock-resistant TPU bumper. This combo provides great protection across the board, and it’s supported by an additional polycarbonate faceplate that clips onto the case, providing protection for your screen as well. The result is a strong case that protects every part of your phone at a bargain price. Despite being an all-around case, there’s no water-resistance, so avoid pools and puddles. Still, it’s a great case if you like to take your phone out into the rough-and-tumble wilderness.</p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/318df26bd03ceb3ac304e391be48bd77bcaa924f/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Poetic\">Poetic</a> <a href=\"https://www.digitaltrends.com/go/9db2c42ee83a6ecf613a2e6fc8eaf053c45bf7d9/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>The OnePlus 6T is a beautiful phone and it’s a shame to hide that amazing design with a bulky case. But you don’t have to. This case from VRS Design is a great example of a protective case that’s also as clear as a window, giving you the perfect view of your phone. It’s made from a TPU bumper and polycarbonate (PC) backplate with a raised edge that elevates your phone from surfaces, and it comes equipped with air-cushion technology to protect against bumps. The PC backplate provides a strong and scratch-resistant surface that makes sure your phone stays fully protected without obscuring its style. This is a quality case at a great price.</p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/722e8e96ef479bd5511ee225b7f408d2b7496b2e/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"VRS Designs\">VRS Designs</a></p>",
            "<p>There’s nothing quite like a leather wallet case for lending a sleek, executive feel, and this wallet case from Olixar is a great example of that. It’s made from PU leather — you’ll struggle to find real leather at this price — which is durable, easy to clean, and very protective. As a wallet case, the front cover flips over your phone’s display to keep it protected, while an inner plastic core keeps your phone held securely. It folds back into a horizontal stand if needed and it comes with two pockets on the inside of the front cover, which are perfect for cash, cards, or tickets. This option is a good and cheap way to add some executive style to your phone, but be aware it won’t be as protective as a bulkier case.</p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/d57e1914f6eb4d14ccc7c6c581d8a54ae7b76e2e/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>If only real leather will tickle your stylish itch, then check out this case from Krusell. It’s made from genuine leather that has been sourced and treated to the highest social and environmental certifications, per <a href=\"https://krusell.co.uk/corporate-social-responsability.html\">Krusell’s own dedication</a> to sustainability and social responsibility. The case will also age over time, creating its own unique patina as the years tick by. Krusell’s design borrows from Nordic traditions, and it offers a slim design with a raised edge that protects the screen. The inner lining is soft and helps to protect against falls and drops — but it’s important to note that Krusell’s case isn’t as protective as bigger cases, and it has no protection for the buttons. Still, this is a beautiful case.</p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/9214eb4c17cb45f62b7d3a038813b05365c0c80f/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Mobile Fun\">Mobile Fun</a></p>",
            "<p>Why look any further than OnePlus itself for full device protection? OnePlus has a history of making great cases for its phones and this Sandstone case is one of its most iconic. It’s made from hard polycarbonate, which provides strong protection against bumps, drops, and scratches, and there are raised edges that keep your phone’s display from resting on abrasive surfaces. It’s patterned with a sandstone grit, which provides a huge amount of additional grip to stop your phone slipping from your hand. It’s undoubtedly a fan favorite, it’s super slim, and it provides strong protection that looks good — at a great price, too.</p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/7a7c488e78f65ef1b5ebdee1990557fe3be62762/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"OnePlus\">OnePlus</a></p>",
            "<p>Looking for some great protection to safeguard your OnePlus 6T while out and about? Tudia offers great protective rugged cases and the Merge Series is a solid option to keep your phone safe. It’s made from a combination of a shock-absorbing TPU inner core and an outer shell of scratch-resistant polycarbonate that provides decent protection against a variety of threats. It has raised edges to elevate your phone from surfaces, and the textured edges help to provide grip. This case is also slim enough to slip into and out of pockets easily. Tudia’s Merge Series is a great option if you work outdoors or have an active lifestyle, and it’s available at a tempting price.</p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/e2fa1ce4b262c82288f5a15ec04a26c2c1b24194/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Tudia\">Tudia</a> <a href=\"https://www.digitaltrends.com/go/c122ad18b934a3379235e0e48fe789c5b8c718a8/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>"
        ]
    },
    {
        "title": "\n\t\tOnePlus 6T tips and tricks to get the most out of your new phone\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>While OnePlus has developed quite a cult following in the U.S. over the past few years, its newest phone, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T</a>, is about to introduce the smartphone manufacturer to a whole new audience. In addition to sporting some awesome hardware, the OnePlus 6T is <a href=\"https://www.digitaltrends.com/mobile/oneplus-6t-secret-weapon/\">now available in T-Mobile stores</a> and finally works on Verizon’s network.</p>",
            "<p>Whether you’re new to OnePlus or you have been a fan for years, the OnePlus 6T <a href=\"https://www.digitaltrends.com/mobile/oneplus-6t-news/\">has some features</a> you may not be familiar with. We compiled a list of some of our favorite tips and tricks to get you started with your new phone. We also have <a href=\"https://www.digitaltrends.com/mobile/oneplus-6t-setings/\">a separate guide on key settings</a> you will want to tweak as you set up the phone.</p>",
            "<p>Need to take a break from your smartphone? It may be a good idea to schedule some downtime with the Do Not Disturb feature on the OnePlus 6T.</p>",
            "<p>If you want to set up a Do Not Disturb schedule, go to <em>Settings &gt; Sound &gt; Do Not Disturb &gt; Turn On Automatically. </em>Tap <em>Sleeping </em>to set up a nightly Do Not Disturb schedule. If you would rather have Do Not Disturb kick in during meetings or certain events, tap the <em>Event </em>option.  To set up a custom rule select <em>Add Rule. </em>When you’ve finished configuring your selected option, make sure you toggle the slider next to <em>Use Rule. </em></p>",
            "<p>Like it or not, the smartphone notch is here to stay. In comparison to some phones like the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Google Pixel 3</a>, the notch on the OnePlus 6T is downright dainty. If a display notch is an absolute nonstarter for you, however, there’s an easy way to hide it on the OnePlus 6T.</p>",
            "<p>To hide the notch, just head over to <em>Settings &gt; Display &gt; Notch Display. </em>Tap the button next to <em>Hide the Notch Area. </em></p>",
            "<p>Reading Mode is one of our favorite features in OxygenOS. With Reading Mode, you can easily emulate an ebook reader screen on your OnePlus 6T. OxygenOS allows you to select apps to automatically open in Reading Mode.</p>",
            "<p>Ready to set up Reading Mode? Go to <em>Settings &gt; Display &gt; Reading Mode. </em>Select <em>Add Apps For Reading Mode </em>and select the apps you’d like to use. You can also toggle the slider next to <em>Block Peek Notifications </em>if you don’t want to be disturbed while using Reading Mode.</p>",
            "<p>The high-end specs on the OnePlus 6T make it an excellent smartphone option for mobile gamers. In addition to strong specifications, there is a Gaming Mode that helps minimize notifications and prioritize mobile data when playing your favorite games.</p>",
            "<p>To set up Gaming Mode, go to <i>Settings &gt; Utilities &gt; Gaming Mode. </i>At the bottom of the screen press <em>Add Apps For Gaming Mode</em> and select the apps you would like to include. Press the back arrow and toggle the sliders next to the settings you would like to change when gaming.</p>",
            "<p>Though it has been out for months, very few phones have <a href=\"https://www.digitaltrends.com/mobile/android-9-pie-review/\">Android 9.0 Pie</a>. The OnePlus 6T is a member of that exclusive club. While that means the entire OS is up to date, it also means you’ll see Android’s clunky new navigation system in action. That is unless you switch to the far superior OnePlus navigation gestures that are baked in the latest version of OxygenOS.</p>",
            "<p>If you want to make the switch to the new gesture system, go to <em>Settings &gt; Buttons &amp; Gestures &gt; Navigation Bar &amp; Gestures. </em>Tap the button next to <i>Navigation Gestures. </i>Swipe up from the bottom of the display to return to the home screen.</p>",
            "<p>Similar to the iPhone’s mute switch, there is an Alert Slider on the OnePlus 6T. This slider allows you to quickly turn off notifications on the phone. But did you know you can change the Alert Slider settings to better fit your needs?</p>",
            "<p>You can customize the Alert Slider by going to <em>Settings &gt; Buttons &amp; Gestures &gt; Alert Slider. </em>Tap <em>Silent </em>and toggle the <em>Media </em>slider if you would like to limit the mode to ringtones and notifications only. Tap <em>Ring </em>and toggle the <em>Also Vibrate For Calls </em>slider if you’d like to stop the phone from vibrating when it rings.</p>",
            "<p>Sure the in-display fingerprint sensor is awesome, but it’s a little finicky. If you’re having problems authenticating with the sensor, you may be able to do something about it. Right now the best workaround seems to be creating a second instance of your fingerprint to improve overall accuracy.</p>",
            "<p>When you’re ready to add a second copy of your fingerprint on the OnePlus 6T, go to <em>Settings &gt; Security &amp; Lock Screen Fingerprint. </em>Enter your PIN or pattern to authenticate. Tap the <em>Add Fingerprint </em>option and re-register the finger you already use to unlock your phone.</p>",
            "<p>While it’s easy to secure documents and other information on your computer, things are a little more tricky on a smartphone. Luckily, the OnePlus 6T has a feature called App Locker that allows you to hide your sensitive information from prying eyes. With App Locker, users are required to authenticate with a PIN, Pattern, or fingerprint before opening selected apps.</p>",
            "<p>If you’re ready to set up App Locker, go to <em>Settings &gt; Utilities &gt; App Locker. </em>Enter your PIN or Pattern. Press <em>Add Apps </em>to select the apps you’d like to protect with App Locker.</p>",
            "<p>Have multiple accounts with a certain app or service? Like to use them easily without having to log in and out of accounts? If so, you’ll love Parallel Apps. This feature allows you to create multiple instances that run independently on the OnePlus 6T.</p>",
            "<p>To set up Parallel Apps, make sure you have the apps you’d like to duplicate installed and go to <em>Settings &gt; Utilities &gt; Parallel Apps. </em>A list of compatible apps will appear. Toggle on each app you would like to duplicate on the home screen or in the app drawer.</p>"
        ]
    },
    {
        "title": "\n\t\tApple iPhone XR vs. OnePlus 6T: Spec comparison\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>With the recent release of the iPhone XR, Apple’s yearly iPhone releases are done and dusted — and despite being billed as the lesser option to the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-review/\">iPhone XS</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-max-review/\">XS Max</a>, we love the lower-cost <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xr-review/\">iPhone XR</a>. With all the same power, but a more vibrant design, we think it might be the best iPhone of the year.</p>",
            "<p>But there’s more than just iPhones out there. The new <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T</a> provides flagship power and a beautiful design for less than the usual flagship price. Does the iPhone XR have what it takes to defeat Android’s flagship killer, or will OnePlus add another scalp to its collection? We found out.</p>",
            "<p>As befits a flagship, you’ll find powerful processors powering each of these phones. The OnePlus 6T is equipped with this year’s “flagchip”, the <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a>, and it provides smooth performance and plenty of grunt for tackling the latest mobile games. However, it’s not as powerful as Apple’s A12 Bionic chip, which powers the iPhone XR, not to mention the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-review/\">iPhone XS</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-max-review/\">XS Max</a>. Despite having less RAM than the OnePlus 6T, the XR easily handled every game we threw at it — which included some <a href=\"https://www.digitaltrends.com/mobile/best-apple-arkit-apps/\">ARKit 2.0</a> apps. You also get plenty of storage on both phones — but there’s no MicroSD card expansion option for either.</p>",
            "<p>On paper you’d expect the OnePlus 6T’s 3,700mAh battery to easily beat the iPhone XR’s 2,942mAh battery — but it doesn’t play out that way. Both phones are more than capable of over a day’s worth of power and beyond, though the OnePlus 6T may have slightly more stamina. The iPhone XR also comes with wireless charging, but you <a href=\"https://www.digitaltrends.com/mobile/how-to-fast-charge-your-iphone/\">won’t be fast charging</a> with the cable in the box — while the 6T comes with OnePlus’s super-fast Dash charging.</p>",
            "<p>You won’t be unhappy with the performance, battery life, or charging offered by either of these phones — but the iPhone XR’s A12 Bionic processor means it’s the more powerful of the two.</p>",
            "<p><strong>Winner: Apple iPhone XR<br>\n</strong></p>",
            "<p>This is a much tighter category to judge than the previous one — both are stunning smartphones that are sure to turn heads. The OnePlus 6T takes everything we loved about the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6-review/\">OnePlus 6</a> and ramps it up, reducing the notch to a dewdrop design, and putting the fingerprint scanner beneath the display. On the other hand, the iPhone XR is a combination of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-8-review/\">iPhone 8</a>‘s back with the iPhone XS’s front, and it’s a beautiful design — and did we mention we can’t get enough of those colors?</p>",
            "<p>So both get full marks for design — but what about durability? Both use fragile glass in their build, so you’ll find similar durability — <a href=\"https://www.digitaltrends.com/mobile/best-oneplus-6t-cases/\">a protective case</a> is definitely a good idea. You’ll only find water-resistance on the iPhone XR, however, which comes with an IP67-rating. The OnePlus 6T lacks any certified water-resistance — which means you’ll need to keep it tightly held around pools.</p>",
            "<p>Both of these phones are neck-and-neck in design, so pulling ahead on water-resistance makes the iPhone XR the narrow winner.</p>",
            "<p><strong>Winner: Apple iPhone XR<br>\n</strong></p>",
            "<p>The iPhone XR marks the début of Apple’s newest display tech. Named “Liquid Retina”, it’s an LCD display that’s able to be curved — meaning it’s able to curve into a phone’s body without the need to incorporate a large chin. It’s a great tech, and it looks good. However, it is only running a 1792 x 828 resolution. Not only is the OnePlus 6T rocking a 2340 x 1080 resolution — making it sharper than the XR — but it’s also a superior AMOLED panel. It shows deep, inky blacks and vibrant colors the iPhone can only dream of — and it’s the clear winner here.</p>",
            "<p><strong>Winner: OnePlus 6T<br>\n</strong></p>",
            "<p>There hasn’t been a huge shake-up in camera lenses on the OnePlus 6T, and you’ll find the same 16-megapixel and 20-megapixel lenses as the OnePlus 6. OnePlus has improved the software though, and it’s capable of more than before, including a low-light Nightscape mode, and smoother edge-detection in portrait mode shots. It’s easily the best camera OnePlus has ever released, and it takes some great photos. However, it falls short of matching greats like the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Pixel 3</a>, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Note 9</a>, and iPhone XS.</p>",
            "<p>The iPhone XR, on the other hand, comes with just a single rear-facing lens — a 12-megapixel lens that’s identical to the iPhone XS’s primary lens. It’s capable of the same Smart HDR as the new iPhones, and also takes some great portrait mode shots — though it’s restricted to only taking portrait mode shots of people. Some versatility is lost without the 2x zoom lens, but it’s not detrimental to its overall performance, and the XR takes some great shots in a variety of lighting.</p>",
            "<p>You’ll be able to capture 4K video on both of these phones, but you’ll only get slow-motion fun on the OnePlus 6T. Selfies from either are likely to be good, but the iPhone’s TrueDepth selfie camera provides excellent portrait mode shots — and is the superior again.</p>",
            "<p>While the 6T is the best camera OnePlus has produced to date, the iPhone XR’s camera suite is just better.</p>",
            "<p><strong>Winner: Apple iPhone XR<br>\n</strong></p>",
            "<p>You’ll find the latest version of Android, <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a>, on the OnePlus 6T, hidden by Oxygen OS. It’s fairly similar to <a href=\"https://www.digitaltrends.com/mobile/what-is-stock-android/\">stock Android</a>, and we really enjoyed our time using it. In terms of updates, OnePlus is usually pretty snappy <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">getting major Android updates out</a>, so you shouldn’t be too disappointed with your update speed to <a href=\"https://www.digitaltrends.com/mobile/possible-android-q-names/\">Android Q</a>, or even Android R.</p>",
            "<p>The iPhone is always going to update faster though, and that’s simply because Apple has a direct line to its phones. The iPhone XR comes with the latest <a href=\"https://www.digitaltrends.com/mobile/ios-12-review/\">iOS 12</a>, and we really dig it. It’s a great piece of software, and while some Android heads will never like it, iPhone fans will love it.</p>",
            "<p><a href=\"https://www.digitaltrends.com/mobile/android-vs-ios/\">Comparing Android and iOS</a> is always like comparing apples and oranges — you probably know your favorite by now. We’re going to rule this a tie.</p>",
            "<p><strong>Winner: Tie<br>\n</strong></p>",
            "<p>The aforementioned TrueDepth camera on the iPhone XR provides most of the fun special features, allowing for face-unlocking via <a href=\"https://www.digitaltrends.com/mobile/how-to-set-up-an-alternate-appearance-for-face-id/\">Face ID</a>, as well as <a href=\"https://www.digitaltrends.com/mobile/how-to-make-a-memoji/\">support for Animojis</a>. iOS 12 brings gesture navigation with it, which is probably our favorite implementation of <a href=\"https://www.digitaltrends.com/mobile/ios-12-on-iphone-xs-xs-max-and-xr/\">gesture navigation</a> so far. The XR doesn’t have 3D Touch support like the <a href=\"https://www.digitaltrends.com/mobile/apple-iphone-xs-vs-iphone-xs-max-vs-iphone-xr/\">rest of this year’s iPhones though</a>, but it does have the more limited Haptic Touch instead.</p>",
            "<p>The OnePlus 6T has a larger set of special features to avail yourself of. There’s now a gaming mode that prioritizes network traffic and performance, as well as OnePlus’s own spin on gesture navigation. The aforementioned in-display fingerprint scanner is cool — even if it isn’t perfect — and the display also includes night-time and reading modes for eye comfort.</p>",
            "<p>While Apple’s special features are all polished and near-perfect, the OnePlus 6T simply has more to play with, and it comes with some stuff we find really cool — like the in-display fingerprint scanner.</p>",
            "<p><strong>Winner: OnePlus 6T<br>\n</strong></p>",
            "<p>The OnePlus 6T costs from $549, and works on T-Mobile, AT&amp;T, and Verizon. The iPhone XR is also available now, and it’s the cheapest iPhone this year — but that’s relative. Prices <a href=\"https://www.digitaltrends.com/mobile/apple-iphone-xs-xs-max-xr-availability/\">start at $750</a>, but it will work with every major U.S. network.</p>",
            "<p>It was tight battle, but the writing was on the wall by the later categories. The iPhone XR is more powerful, comes with a better camera, and gets a slight edge thanks to its water-resistance. But by no means does that mean the OnePlus 6T is a bad phone. The Snapdragon 845 may not be as powerful as the A12 Bionic, but it’s still capable of handling anything you can throw at it. The 6T’s cameras are also very capable — and we really don’t have to defend the drop-dead gorgeous design.</p>",
            "<p>But at the end of the day, the iPhone XR is simply the stronger phone across our categories. Grab it and you won’t be disappointed with its performance — but if you prefer Android, or the lower price tag, you’ll also be served extremely well by the OnePlus 6T.</p>"
        ]
    },
    {
        "title": "\n\t\tMcLaren puts the pedal to the metal in special-edition OnePlus 6T\t",
        "author": [
            "\n\t\t\t\t\t\tJulian Chokkattu\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/mobile/oneplus-mclaren-f1-news/\">OnePlus 6T McLaren Edition</a> isn’t a superficial collaboration. While it shares a similar design and almost the same specifications as the standard <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T</a>, there are meaningful enhancements that not only make this powerful phone look gorgeous, but also offer improvements you’ll notice every day. If owning the OnePlus 6T has crossed your mind over the past few weeks, here’s why the McLaren Edition is worth considering.</p>",
            "<p>There are five main differences between the standard OnePlus 6T and the McLaren Edition. First, you’re getting a box with a few other goodies, including a booklet commemorating OnePlus and McLaren; a plaque celebrating the McLaren Edition phone; a case; and a note from OnePlus CEO Pete Lau.</p>",
            "<p>The McLaren Edition also gets more storage than the base version of the OnePlus 6T — 256GB to be exact. Only the Midnight Black OnePlus 6T color comes with an option for that much storage. Even more unique is the whopping 10GB of RAM. That means it should be able to handle all the multi-tasking you can throw at it, but more on that later.</p>",
            "<p>While it’s the same design as the standard OnePlus 6T, the McLaren Edition adds the iconic Papaya Orange color scheme to the edges of the phone. And finally, you get a faster charging system called Warp Charge 30. OnePlus’ charging technology is one of the fastest available, and it used to be called “Dash Charge.” This year, the company <a href=\"https://www.digitaltrends.com/mobile/oneplus-rename-dash-charge-to-warp-charge/\">faced some legal and trademark woes</a> surrounding the branding of its charging technology, which is why the name has changed to Warp Charge.</p>",
            "<p>Warp Charge 30 on the McLaren Edition isn’t the same as Dash Charge on the OnePlus 6T. OnePlus specifically claims Warp Charge 30 delivers 50 percent recharge in just 20 minutes, which is faster than what we’ve previously seen from the company. This is all thanks to fresh battery design and an improved charging adapter. The cable you get is braided too, and both it and the adapter are the same Papaya Orange color to match the McLaren-themed phone.</p>",
            "<p>The OnePlus 6T McLaren Edition doesn’t look ostentatious. The glass on the back is glossy, but underneath in the center is a carbon fiber-like weave. It’s subtle, and you’ll need to shine it in the light to really see it. Similarly, the Papaya Orange accents around the bottom edges of the phone can be easy to miss at a first glance. It shimmers when caught in the light, and when this happens it looks beautifully elegant.</p>",
            "<p>The McLaren logo sits at the bottom on the back, and that’s about it in terms of design changes between the McLaren Edition and the standard OnePlus 6T. The front is exactly the same, with the in-display fingerprint sensor and teardrop notch.</p>",
            "<p>Turn the phone on and you’ll notice the McLaren Edition comes with orange and black-themed OxygenOS software. Pull down the notification drawer or open up the app drawer and you’ll see orange accents, instead of the standard blue. Don’t worry, there is a way to change the orange back if you’re not a fan (<em>Settings &gt; Display &gt; Theme</em>).</p>",
            "<p>The real reason we’re here, though, is to see exactly what Warp Charge 30 brings to the table.</p>",
            "<p>We plugged in the McLaren Edition and the standard OnePlus 6T with their respective chargers in the box, both starting at 0 percent. Within 20 minutes, the standard OnePlus 6T hit a mere 35 percent, but the McLaren Edition raced ahead with exactly 50 percent at the mark. OnePlus’ claim rings true.</p>",
            "<p>We tested for 10 more minutes to get results after 30 minutes of charging, and the standard 6T reached 54 percent, while the McLaren Edition hit 68 percent. That’s fast, and a solid improvement. It’s a good reason to buy the phone, if you were already eyeing the OnePlus 6T.</p>",
            "<p>But it’s not the fastest charging we’ve ever seen. We recently tested another car-branded phone — the <a href=\"https://www.digitaltrends.com/mobile/oppo-find-x-lamborghini-edition-product-impressions/\">Oppo Find X Lamborghini Edition</a> — and it similarly comes with special “Super VOOC” technology. It managed to hit 100 percent in just 35 minutes of charging, meaning it leaves McLaren in the dust. Still, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oppo-find-x-review/\">Find X</a> isn’t available in the U.S., and it also costs around $1,500 after converting the price. The OnePlus 6T McLaren Edition is much more sensibly priced.</p>",
            "<p>So what about performance? Does the 10GB of RAM deliver any additional boost to the OnePlus 6T McLaren Edition over the standard model? Not that we’ve seen. We’ve juggled through multiple apps and games at the same time trying to see if it would slow down either the 6T or the McLaren Edition, and both fared without flaw. We’ve already explored <a href=\"https://www.digitaltrends.com/mobile/how-much-ram-does-a-smartphone-need/\">how much RAM a smartphone really needs</a>, and you likely won’t see any valuable differences between the 8GB OnePlus RAM models and the new version.</p>",
            "<p>Here are a few benchmark scores to supplement our findings. Keep in mind, OnePlus has been known to <a href=\"https://www.digitaltrends.com/mobile/oneplus-meizu-benchmark-cheating/\">cheat in benchmark scores</a> before, so take these results with a heavy grain of salt.</p>",
            "<p>Compare these to our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T benchmark scores</a>, and the 6T fares a little better in Geekbench and 3DMark, though the McLaren Edition has a narrow win with AnTuTu. These scores are some of the highest we’ve seen with the Qualcomm Snapdragon 845 processor, which is the same chip powering most other Android flagship phones, from the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-xl-review/\">Google Pixel 3</a> to the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Samsung Galaxy Note 9</a>. Benchmark scores don’t tell the full story, but you won’t have performance issues with the OnePlus 6T McLaren Edition or the OnePlus 6T.</p>",
            "<p>The OnePlus 6T McLaren Edition costs $699, which is $149 more than the base model you can buy. It’s available now for purchase, but should you get it? We think the fast charging improvements are impressive, and the Papaya Orange theme does offer killer looks. The extra storage and RAM is the cherry on top. If this special edition is within your budget, go for it, especially if you’re a fan of sports cars and McLaren. If not, you’ll be plenty satisfied with the OnePlus 6T, or any one of the phones in our <a href=\"https://www.digitaltrends.com/mobile/best-smartphones/\">best smartphones guide</a>.</p>",
            "<p>Check out our <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T review</a> our full impressions on the phone, including software, battery life, and camera. Both the OnePlus 6T and the McLaren Edition work on AT&amp;T, T-Mobile, and Verizon’s networks.</p>"
        ]
    },
    {
        "title": "\n\t\tOnePlus 6T: Absolutely everything you need to know\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>OnePlus continues to release  flagship-level specs and power at a fraction of the price you’d expect. The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T</a> is the latest and it’s packed with tons of power, an amazing camera, and a new notched, bezel-less design. Here’s absolutely everything you need to know about the OnePlus 6T.</p>",
            "<p>The OnePlus 6T is the first time OnePlus’s phones have come to a major U.S. carrier, but that partnership comes with some downsides, too — namely, slightly slower OS updates.</p>",
            "<p>However, T-Mobile is catching up, thanks to the release of Oxygen OS 9.0.4 for the carrier’s OnePlus 6T units. This update brings with it security updates to November 2018, an improved Nightscape mode, and refinements for the in-display fingerprint scanner. The update is being pushed out to T-Mobile owners, and if you’ve not received it, it’s worth checking Settings &gt; System &gt; System update &gt; Check for update to make sure you’re up to date.</p>",
            "<p>T-Mobile OnePlus 6T units are still an update behind though, with Oxygen OS 9.0.5 having already rolled out to unlocked 6T owners. That means T-Mobile 6Ts will still lack the ability to quick-launch Google Assistant with the power button, but they can probably live with that for now.</p>",
            "<p>OnePlus released the OnePlus 6T in two colors — midnight black and mirror black — but may have a special edition waiting in the wings for future release. A series of legitimate-looking <a href=\"https://www.mrgizmo.com/oneplus-6t/\" target=\"_blank\" rel=\"noopener\">promotional photos</a> of a more colorful version have been leaked, showing the OnePlus 6T in thunder purple. It certainly looks striking, with a gradient style reminiscent of Huawei’s twilight color, and considerably more visually eye-catching than the black versions we have so far.</p>",
            "<p>OnePlus often produces limited editions of its phones, which are sold in only some markets, and reference to a thunder purple OnePlus 6T has been spotted on the company’s support website in India. This would be the first purple phone we’ve seen from the company. However, there’s no official information yet, so this may be a clever fake, or an abandoned alternative not used.</p>",
            "<p>OnePlus’s phones have always closely followed smartphone design trends, and the OnePlus 6T is no different.</p>",
            "<p>Like the OnePlus 6, the 6T comes with a notched display — but it’s not the same style of notch that we saw in the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6-review/\">OnePlus 6</a>. Instead, OnePlus has elected a dewdrop-style notch similar to the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-review/\">Huawei Mate 20</a>‘s notch. It packs a lot into the small size though, and the notch still contains a three-in-one ambient/distance/RGB sensor, and a 16-megapixel front-facing lens with an f/2.0 aperture. We like its subtlety — but if you really hate notches, it can still be hidden through software.</p>",
            "<p>The 6T’s bezels are extremely thin, offering a screen-to-body ratio of 86 percent — which means the 6.41-inch AMOLED display utterly dominates the front panel. As an AMOLED panel, the OnePlus 6T’s display will have some deeply gorgeous blacks and vibrant colors, and OnePlus has also added a monochrome Reading Mode, and a <a href=\"https://www.digitaltrends.com/mobile/does-blue-light-ruin-sleep-we-ask-an-expert/\">blue light</a>-cutting Night Mode.</p>",
            "<p>OnePlus’s lauded mute switch is in the same position, and — flipping the phone over — you’ll find the two vertically stacked camera lenses, much like the OnePlus 6.</p>",
            "<p>But it’s not all the same for the back panel’s design. You’ll no longer find a fingerprint scanner stuffed under the camera lenses, and it hasn’t returned the bottom of the front bezel. Instead, OnePlus has embraced the future and incorporated an in-display fingerprint scanner. Simply press your finger against the fingerprint icon on the screen, and your phone will unlock. Hold down on the same spot, and you’ll also be able to launch apps from a customizable app shortcut menu.</p>",
            "<p>You’ll be able to get the OnePlus 6T in two colors — mirror black, and the midnight black that sports a ghostly reflective “S” under the glass. However, a leak has shown a more colorful version, called thunder purple, may be released in the future, potentially as a limited edition. In a first for the OnePlus range, the OnePlus 6T will not be coming with a headphone jack, and will ship with a USB-C to 3.5mm adapter in the box.</p>",
            "<p>OnePlus’s party trick has always been to cram the latest tech into a lower-cost package, and everyone expected the OnePlus 6T to continue that tradition. While we won’t see an upgraded processor yet, the OnePlus 6T’s specs are still worthy of a 2018 flagship.</p>",
            "<p>You’ll find this year’s top “flagchip,” the <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a>, loaded into the OnePlus 6T. We’ve seen this chip in pretty much every flagship phone this year, so we’re certain the OnePlus 6T will showcase the incredible power and performance we’ve come to expect from this powerful chip.</p>",
            "<p>You’ll get the choice between two models of the 6T; a base model with 6GB of RAM and 128GB of onboard storage, or 8GB of RAM and 256GB of storage. The increased RAM <a href=\"https://www.digitaltrends.com/mobile/how-much-ram-does-a-smartphone-need/\">may not boost performance much</a>, but the increased storage may be tempting if you’re a power used — as usual, there’s no option to expand that storage via MicroSD card.</p>",
            "<p>The battery has been boosted up to a respectable 3,700mAh. We didn’t have any issues with the longevity of the OnePlus 6’s 3,300mAh battery, but it’s always nice to see a larger battery. You’ll also get access to OnePlus’s stupendously fast “<a href=\"https://www.digitaltrends.com/mobile/oneplus-rename-dash-charge-to-warp-charge/\">don’t-call-it-Dash-Charge</a>” charging.</p>",
            "<p>You’ll find OnePlus’s OxygenOS skin laid over Android in the OnePlus 6T — but with the pleasant surprise that it’s running over <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a>. Some of the largest phone manufacturers haven’t <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">yet upgraded their newest flagships</a> to the newest version of Android, so it’s nice to see OnePlus leading the charge with <a href=\"https://www.digitaltrends.com/mobile/best-and-worst-features-android-9-pie/\">Android 9.0 Pie</a>.</p>",
            "<p>OxygenOS will come with <a href=\"https://www.digitaltrends.com/mobile/how-to-use-android-9-pie-gesture-navigation/\">Android Pie’s new gesture navigation</a>, but OnePlus has also put its own spin on it, including some refinements. Users will be able to draw a pause signal on their lockscreen to pause music, or draw specific letters to launch apps.</p>",
            "<p>You should see a more responsive phone as well, thanks to the new Smart Boost mode. This feature stores data from commonly used apps in your phone’s RAM, speeding up start-up times by around 5 to 20 percent. According to OnePlus, this is especially useful in apps requiring large amounts of input and output data — which includes games.</p>",
            "<p>Games have been given a more direct new feature, too, with an improved gaming mode that reduces notifications, locks the screen brightness, and prioritizes data for gaming performance. It will now show notifications from messaging apps and calls as small floating bubbles, so you can stay updated without impacting your gaming performance.</p>",
            "<p>The OnePlus 6T comes with a number of options for biometric unlocking. You’ll have access to the aforementioned in-display fingerprint scanner, but Face Unlock is available too — and OnePlus boasts it can unlock the phone in 0.4 seconds, making it snappier than a crocodile with chewing gum.</p>",
            "<p>OnePlus has chosen to let one recent trend slip by though — the increased emergence of triple lens systems like those on the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">Huawei P20 Pro</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-v40-thinq-review/\">LG V40 ThinQ</a> — so you’ll just find two lenses on the back of the OnePlus 6T.</p>",
            "<p>But that doesn’t mean the OnePlus 6T is lacking — on the contrary, the two lenses on the rear of the phone are highly capable. There’s a 16-megapixel main lens with optical image stabilization and an f/1.7 aperture, backed up by a secondary 20-megapixel lens with an f/1.7 aperture.</p>",
            "<p>There’s A.I.-driven image recognition available here, too, so the 6T’s camera will be able to recognize scenes and automatically adjust settings to fit whatever is found in the viewfinder. Those adjustments apply to the 6T’s portrait mode, and will even boost low-light performance by recognizing when a night shot is being made, thanks to the new Nightscape tech. Nightscape is also coming to the OnePlus 6.</p>",
            "<p>The OnePlus 6T also comes with some impressive video capabilities, too. You’ll be able to capture 4K video at 60 frames per second, but 240-fps slow motion will also be available at 1080p, and 480-fps super slow motion will be available at 720p resolutions.</p>",
            "<p>You don’t have to wait any longer for the revolutionary OnePlus 6T — it’s now available, for $549. OnePlus is also teaming up with T-Mobile, making this the first time the phone will be available on a U.S. carrier. You can pick up the OnePlus 6T from T-Mobile for better than half price over 24 months. To find out about that deal and all the best ways to pick up the new flagship killer, check out <a href=\"https://www.digitaltrends.com/mobile/how-to-buy-oneplus-6t/\">our OnePlus 6T buying guide</a>.</p>",
            "<p><em>Updated on November 20, 2018: OnePlus 6T phones on T-Mobile are now receiving Oxygen OS 9.0.4.<br>\n</em></p>"
        ]
    },
    {
        "title": "\n\t\tThe OnePlus 6T is here, it’s fantastic, and here’s where to buy it\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>Flagship phones may have a lot to offer, but they’re really expensive, and getting pricier by the month. That, however, is where OnePlus comes in. The company has been building flagship-tier phones for a number of years now and usually offers them at a lower price than other flagship devices. The latest is the new <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T</a>, which boasts a <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Qualcomm Snapdragon 845 processor</a>, up to 8GB of RAM, and more.</p>",
            "<p>Of course, you may be wondering how you can get your hands on the new <a href=\"https://www.digitaltrends.com/mobile/oneplus-6t-news/\">OnePlus 6T</a> for yourself — which is exactly why we’ve put together this guide. This time around, for the first time, OnePlus is offering the 6T through a carrier in the U.S. thanks to its partnership with T-Mobile — essentially giving you more options than ever to buy the phone.</p>",
            "<p>No matter what your situation, here’s how to get your hands on the OnePlus 6T.</p>",
            "<p>Before buying the OnePlus 6T, it’s important to note that like previous OnePlus models, the device is GSM-only. Unlike previous models, Verizon has certified the OnePlus 6T to work on its network, so you will be able to buy the phone unlocked and take it to Verizon. In other words, the only major network that the OnePlus 6T won’t work on is Sprint, so if you’re on Sprint you’ll need to switch in order to use the OnePlus 6T. That also means that Sprint’s mobile virtual network operators won’t support the phone — like Boost Mobile.</p>",
            "<p>As usual, the OnePlus 6T is available unlocked and you will be able to get it directly <a href=\"https://www.oneplus.com\" target=\"_blank\" rel=\"noopener\">through the OnePlus website</a>. Of course, if you do so you’ll have to pay for the OnePlus 6T upfront, which is something to keep in mind. The phone is now up for sale, and it’s available in a few different colors, though the color you get may impact pricing. Pricing for the phone can be found below.</p>",
            "<p>Other than the OnePlus website, it’s likely you’ll be able to buy the phone through Amazon and other retail partners, though no announcements have been made yet.</p>",
            "<p>For the first time, OnePlus is offering the OnePlus 6T through a carrier in the U.S., and that carrier is T-Mobile. Like the unlocked version, the T-Mobile OnePlus 6T is now available. Unlike the unlocked version, however, T-Mobile is only offering one variant of the phone — the mirror black version with 8GB of RAM and 128GB of storage.</p>",
            "<p>Through T-Mobile, the phone comes at $580 outright, which equates to $24.17 per month for 24 months on T-Mobile’s Equipment Installment Plan. T-Mobile is also offering up to $300 off for an eligible trade-in, and if you get the full amount you’ll only pay $11.67 per month for 24 months.</p>",
            "<p>The OnePlus 6T can be purchased directly through OnePlus, just like before; but it’s also now sold by more networks than before, too. O2 continues as OnePlus’s partner, and <a href=\"https://www.o2.co.uk/shop/oneplus/6t#contractType=paymonthly\" target=\"_blank\" rel=\"noopener\">has pre-order deals</a> that provide twice the amount of included data, and the option to change data plans regularly. The deals run from now until December 5, and the phone will be available from November 6.</p>",
            "<p>Joining O2 for the OnePlus 6T are <a href=\"https://shop.ee.co.uk/mobile-phones/pay-monthly/oneplus-6t-128gb-mirror-black/details\" target=\"_blank\" rel=\"noopener\">EE</a> and <a href=\"https://www.vodafone.co.uk/brands/oneplus/6t/index.htm?cid=ppc-wvm/pm/_71700000042683281_/prch/an&amp;cid=ppc&amp;gclid=Cj0KCQjwguDeBRDCARIsAGxuU8bTUpGRg7wYPFEH2Gefz7QIkSdqEhrLwW7NqJ72HSTcmS4J38WfBu4aAoQIEALw_wcB#Mirror_Black/128\" target=\"_blank\" rel=\"noopener\">Vodafone</a>. Both offer the phone with monthly plans, and will include a subscription to certain online streaming services, too. Finally, <a href=\"https://www.johnlewis.com/browse/electricals/mobile-phones-accessories/view-all-mobile-phones/oneplus/_/N-a8vZ1yzr7ga?showInStockOnly=false\" target=\"_blank\" rel=\"noopener\">John Lewis</a> also sells the OnePlus 6T unlocked, with the same November 6 release date, and Carphone Warehouse is expected to do the same. OnePlus announced the <a href=\"https://www.digitaltrends.com/mobile/oneplus-6t-uk-retail-carrier-launch-news/\">new retail partnerships</a> ahead of the device’s unveiling.</p>",
            "<p><em>Updated on November 1, 2018: The OnePlus 6T is now available in the U.S.</em></p>"
        ]
    },
    {
        "title": "\n\t\tHere are the most common OnePlus 6T problems and how to fix them\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T</a> was one of our favorite phones of 2018. The device boasts a Qualcomm Snapdragon 845 processor and up to 8GB of RAM, plus it offers a modern design with a small teardrop notch. But the phone isn’t perfect. Since its release in November, a number of issues related to the device have popped up online — and if you’re using a OnePlus 6T, you may find yourself dealing with them.</p>",
            "<p>Thankfully, many of the issues seem to have potential fixes. Here are the most common OnePlus 6T problems and how you can fix them.</p>",
            "<p>New <a href=\"https://forums.oneplus.com/threads/snapchat-mic-issue.864181/\" target=\"_blank\" rel=\"noopener\">reports</a> are <a href=\"https://forums.oneplus.com/threads/bad-microphone-quality.843871/\" target=\"_blank\" rel=\"noopener\">popping up</a> that the OnePlus 6T is having some microphone issues. According to the reports, audio being captured from the phone sounds tinny and distant when used with some third-party apps like Snapchat and WhatsApp. That seems to be because the device is using the wrong microphone — it’s using a microphone in the earpiece, which is largely supposed to be used for noise cancellation.</p>",
            "<p>It doesn’t seem as though all third-party apps are affected, but at least a handful are. Thankfully, the issue is likely a software one instead of a hardware one — which means that OnePlus could potentially fix this issue with a software update.</p>",
            "<p><strong>Potential solutions:</strong></p>",
            "<p>Some users have <a href=\"https://www.bgr.in/news/oneplus-6t-users-reporting-battery-drain-issue-caused-by-an-unknown-bug/\" target=\"_blank\" rel=\"noopener\">reported</a> that their battery seems to be draining faster than usual. While not huge, the 3,700mAh battery <em>should</em> get you through a day of use, or at least close to it — however, some users are reporting that their battery life has been cut in half.</p>",
            "<p>Unfortunately, this is another issue that doesn’t seem to have a fix yet, though a few users are suggesting that factory resetting the device is helping.</p>",
            "<p><strong>Potential solutions:</strong></p>",
            "<p>Another issue that’s being reported by users is that a recent update to the T-Mobile version of the OnePlus 6T is breaking the device’s certification — which means that you can’t access Google Play and download apps and content.</p>",
            "<p><strong>Potential solutions:</strong></p>"
        ]
    },
    {
        "title": "\n\t\tKey settings you need to change on your brand-new OnePlus 6T\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>Now that you’ve finally got the spectacular new OnePlus 6T in hand, what’s the first thing you should do? Tweak the settings of course. This is a quick rundown of a few of the settings you’ll want to change on the OnePlus 6T to get the best overall user experience.</p>",
            "<p>You can also check out our thoughts on the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6t-review/\">OnePlus 6T</a>, and see how it <a href=\"https://www.digitaltrends.com/mobile/oneplus-6t-vs-oneplus-6-vs-oneplus-5t-vs-oneplus-5/\">compares to its predecessors</a>, as well as the <a href=\"https://www.digitaltrends.com/mobile/oneplus-6t-vs-galaxy-s9/\">Samsung Galaxy S9</a>, which shares similar specs.</p>",
            "<p>While Android 9.0 Pie brings lots of great new features, its updated navigation gestures are not among them. You’ll want to enable the far superior navigation gestures in OxygenOS as soon as you turn on the OnePlus 6T to avoid a lot of headaches.</p>",
            "<p>To enable the custom navigation features, go to <em>Settings &gt; Buttons &amp; Gestures &gt; Navigation Bar &amp; Gestures. </em>Select the radio button next to <i>Navigation Gestures. </i>Once enabled, you simply need to swipe up from the bottom of the display to return to the home screen.</p>",
            "<p>Over the past few years, the <a href=\"https://www.digitaltrends.com/mobile/does-blue-light-ruin-sleep-we-ask-an-expert/\">effects of blue light</a> have become of increasing concern. While we know blue light can disrupt sleep, there’s also the possibility it can have other deleterious health effects. Fortunately the OnePlus 6T has a blue light filter called Night Mode that can be easily activated.</p>",
            "<p>To use Night Mode, go to <i>Settings &gt; Display &gt; Night Mode. </i>Select the radio button next to <i>Automatically Enable From Sunset to Sunrise </i>if you want the phone to handle turning on Night Mode. If you’d prefer to set your own schedule, just tap the radio button next to <em>Custom time range.</em></p>",
            "<p>Ambient Display shows basic information such as the time, battery percentage, and notification icons. It’s a good idea to set up two customizations for this feature. The first is a gesture that lets you tap on the screen to quickly turn on the ambient display, while the other will cause the screen to illuminate when you get new notifications.</p>",
            "<p>Setting up these customizations takes just a few moments. You’ll need to go to <em>Settings &gt; Display &gt; Ambient Display. </em>Toggle on the sliders next to <i>Turn On Screen To Show </i>and <em>New Notifications. </em></p>",
            "<p>One of the quickest ways to make your phone feel more familiar is by customizing its interface. While you’re setting up your new OnePlus 6T, you’ll want to customize your theme and accent colors to match your preferences.</p>",
            "<p>When you’re ready to change your theme and accent colors, go to <em>Settings &gt; Display &gt; Theme. </em>From here, you can choose the radio button that matches your preferred theme. Next, tap <em>Accent Color </em>and choose the color you’d like to use, followed by <em>OK. </em></p>",
            "<p>Sure, the OnePlus 6T has awesome battery life, but you’ll still want to have an idea just how much juice you have left. Luckily, there’s an easy setting to update on your phone that will let you quickly see your current battery percentage in the status bar.</p>",
            "<p>To display battery percentage information, head to <em>Settings&gt; Display &gt; Status Bar </em>and toggle the slider next to <em>Show Battery Percentage. </em>If you’d like, you can also tap <em>Battery Style </em>to customize the battery icon that appears in the status bar.</p>",
            "<p>If you don’t like tapping the power button each time you want to unlock your OnePlus 6T, you can easily set up a gesture to wake your phone. Double Tap to Wake does just what it says: It allows you to wake the phone with a double tap to the screen.</p>",
            "<p>To enable Double Tap to Wake, go to <em>Settings &gt; Buttons &amp; Gestures &gt; Quick Gestures. </em>Toggle on the slider next to <em>Double Tap To Wake. </em>While you’re here, you may also want to toggle on the slider for <em>Flip To Mute. </em></p>",
            "<p>Google Assistant is an invaluable feature that provides lots of information about your day. If you’re a frequent Google Assistant user, you’ll quickly realize the feature is a whole lot more difficult to access when you’re using the new OxygenOS navigation gestures. Fortunately, OnePlus has a setting that allows you to hold the power button to open <a href=\"https://www.digitaltrends.com/mobile/google-assistant/\">Google Assistant</a>.</p>",
            "<p>Setting up the feature takes just a moment. Go to <em>Settings &gt; Buttons &amp; Gestures </em>and toggle the slider next to <em>Quick Activate The Assistant App. </em>Once the feature is activated, just hold the power button to access Google Assistant. If you want to access the power button menu, you’ll need to hold the power button a little longer than normal.</p>",
            "<p>Again, we can’t complain about the battery life on the OnePlus 6T. It’s plenty to get you through a day with a little to spare. However, if you do tend to test the limits of your battery, you should turn on the Battery Saver mode. With Battery Saver enabled, your phone’s performance will degrade slightly when that battery is almost depleted in order to eke out a little more time.</p>",
            "<p>To enable Battery Saver, head to <em>Settings &gt; Battery &gt; Battery Saver. </em>Toggle the slider next to <em>Turn On Automatically </em>and adjust the slider to the percentage at which you would like Battery Saver to begin working.</p>",
            "<p>One thing’s for sure: There’s no shortage of ways to unlock your OnePlus 6T. While you’ll probably use the Face Unlock feature or in-display fingerprint sensor, there are privacy and legal concerns surrounding these features. Lockdown is a button you can tap that will disable all authentication methods other than your PIN or Pattern. This is a feature you’ll definitely want to enable.</p>",
            "<p>You add the Lockdown button to your power button menu by going to <em>Settings &gt; Security Lock &amp; Screen &gt; Lock Screen Preferences,</em> and toggle on the slider next to <em>Show Lockdown Option</em>. Once you’ve finished, you can tap the power button to access the Lockdown button.</p>",
            "<p>While Smart Lock isn’t an exclusive feature for the OnePlus 6T, it’s one of the most convenient you’ll find in Android. Smart Lock allows you to define certain areas and circumstances where your phone will automatically unlock. Unless you have very sensitive information on your phone, this is a feature you’ll probably want to set up.</p>",
            "<p>To set up Smart Lock go to <em>Settings &gt; Security &amp; Lock Screen &gt; Smart Unlock. </em>Enter your PIN or Pattern. Tap <em>On-Body Detection </em>if you’d like the phone to remain unlocked when you have it on your person. Select <em>Trusted Places </em>if you’d like to establish certain spots where the phone stays unlocked. If you’d prefer to keep your phone unlocked when it’s close to certain equipment like your laptop, press the <em>Trusted Devices </em>button.</p>"
        ]
    }
]