[
    {
        "title": "Google Pixel 3 review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p><strong>Update:</strong> <em>The Google Pixel 3 is still one of the best phones around, with not much in the way of new competition since launch. But it's still just as expensive as it was at launch too, so we've added a comparison to the cheaper OnePlus 6T.</em></p>",
            "<p>The Google Pixel 3 has the best smartphone camera you can buy today, and yet it comes in a one-hand-friendly size with a large enough screen to satisfy most people.</p>",
            "<p>You don’t need a big, pocket-busting phone to get great photos (this one has a 5.5-inch screen), nor do you need a dual-lens rear camera (it has a single lens on back), nor the fastest aperture on a phone (f/1.8 has been beaten by the LG and Samsung’s speedier f/1.5 aperture). Google proves that its 12.2MP photos are better because of machine-learning camera software and consistency.</p>",
            "<p>The Pixel 3 – and larger Pixel 3 XL – makes lugging around a <a href=\"https://www.techradar.com/news/best-compact-camera\">compact camera</a> or even an <a href=\"https://www.techradar.com/news/best-entry-level-dslr-camera\">entry-level DSLR</a> redundant. It also has features you can't get on professional cameras, unless you're constantly changing lenses. There are two front-facing 8MP cameras here, with the second lens designed for wide-angle selfies, enabling you to get groups photos without cutting people out of the picture.</p>",
            "<p>To this day, the <a href=\"https://www.techradar.com/reviews/google-pixel-2-review\">Google Pixel 2</a> camera still amazes us, and the Pixel 3 builds off of that success with better photo detail and enhanced HDR. What’s more, the color-rich OLED screen is far superior due to its 18:9 aspect ratio. It’s not bezel-less by any means, but you do get more screen real estate than on the Pixel 2 – and keep the front-facing stereo speakers. It also avoids Pixel 3 XL’s awkward notch cut out that so many people hate on.</p>",
            "<p>You’re not going to get <em>everything</em> in this small package. The battery falls short of bigger phones at a 2,915mAh capacity, offering all-day battery life with conservative use in our tests. Snapping 100 great photos in two hours was a real battery life drain. You’re also stuck with 64GB or 128GB – there’s no microSD card slot, and there’s no headphone jack. And, as much as we laud the behind-the-scenes camera software, the app doesn’t have all of Samsung's and LG's neat camera app tricks.</p>",
            "<p>The Google Pixel 3 is the ideal smartphone for anyone who cares about photo quality and isn’t satisfied with their phone’s picture-taking abilities today. It has the camera smarts and <a href=\"https://www.techradar.com/news/android-pie-9-features-release-date-and-phones-list\"><u>Android Pie</u></a>-powered AI smarts of the Pixel 3 XL, without the awkward notch cut-out at the top. And, unlike the comparable, one-hand-friendly <a href=\"https://www.techradar.com/reviews/iphone-xs-review\">iPhone XS</a>, it’s cheap – at least by 2018 flagship standards.</p>",
            "<p><em>Watch our first impressions of the Google Pixel 3 in video form below...</em></p>",
            "<p>The Google Pixel 3 landed on October 18 in the US, and November 1 in the UK and Australia. Availability is also slated for Canada, France, Germany, Japan, India, Ireland, Italy, Singapore, Spain, and Taiwan. Pre-orders began right after the October 9 launch event.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/h4ax4uNX5fPuwLJ4wDndjd-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/h4ax4uNX5fPuwLJ4wDndjd-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/h4ax4uNX5fPuwLJ4wDndjd-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/h4ax4uNX5fPuwLJ4wDndjd.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/h4ax4uNX5fPuwLJ4wDndjd.jpg\"></p>",
            "<p>The Pixel 3 price is $799 (£739, AU$1,199) for the 64GB version, and $899 (£839, AU$1,349) for the 128GB version. We recommend more internal storage since you can’t upgrade later (there’s no microSD card slot on this phone).</p>",
            "<p>On contract in the US, it's exclusive to Verizon, starting at $33.33 a month for 64GB or $37.49 a month for 128GB for the duration of 24 months. Sadly, you won't find it sold at AT&amp;T, T-Mobile, Sprint, or other US carriers, but you can get the unlocked Google Pixel 3 at full price from official Google's store.</p>",
            "<p>It’s a price hike from the Google Pixel 2 (by $150), yet cheaper than an iPhone XS (by $200). You're paying for the more expansive screen and machine-learning camera, and the fact that almost all flagship smartphones cost more in 2018.</p>",
            "<p class=\"mid__article\"></p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/cJ7KwbqcggTkoCUthNKkad-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/cJ7KwbqcggTkoCUthNKkad-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/cJ7KwbqcggTkoCUthNKkad-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/cJ7KwbqcggTkoCUthNKkad.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/cJ7KwbqcggTkoCUthNKkad.jpg\"></p>",
            "<p>The Pixel 3 retains Google's familiar two-tone design – the back has shiny glass at the top, while lower 80% has a matte finish. There's a more seamless transition between the two textures for a higher-quality look and feel, but overall its look hasn't changed dramatically.</p>",
            "<p>It easily fits in one hand, and, for the most part, you can operate it without resorting to using two hands. That's the best reason to choose the Pixel 3 over the Pixel 3 XL. It's screen size is big enough, yet the phone handfeel is rather manageable. That and it doesn't have an ugly notch cut out at the top, a design choice that a deal breaker for many. </p>",
            "<p>The Pixel 3 series looks similar to last year's phones, but it does in fact use different materials. The entire back is made of soft-touch glass using Corning Gorilla Glass 5. It's the same strengthened glass that protects the front screen, and it's all sandwiching an aluminum frame that has a hybrid coating – that's the only bit of metal you'll find on the outside.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW.jpg\"></p>",
            "<p>Sure, the all-glass design makes the Pixel 3 more susceptible to damage (though we have yet to find the scratches others have reported), but glass also enables a better LTE connection and wireless charging. That's why we've seen a lack of aluminum-backed flagship phones in 2018. The Pixel 3 is the latest causality. </p>",
            "<p>Wireless charging is a new feature for the Pixel phones, and a welcome change now that Google has launched the Pixel Stand wireless charger alongside its new devices. We haven't had a wirelessly charging Google phone since the plastic <a href=\"https://www.techradar.com/reviews/phones/google-nexus-6-1271190/review\">Nexus 6</a>.</p>",
            "<p>More rounded edges are everywhere on the Pixel 3. Its frame is less boxy than previous Google phones, a trend we've seen from the iPhone and and others. Gone is the harsher silver bevel around the frame and rear fingerprint sensor. It's like Google put the Pixel 2 through a smoothing machine, and we like the results.</p>",
            "<p>You'll still find dual front-facing speakers on the Google Pixel 3. No one else is really doing this anymore (except Razer with the <a href=\"https://www.techradar.com/reviews/hands-on-razer-phone-2\">Razer Phone 2</a>), so it's nice to see in a flagship device. You'll also get Active Edge, which allows you to squeeze the sides of the phone to call up Google Assistant. We much prefer this squeeze mechanic as opposed to a dedicated AI button on the frame, like Samsung does with Bixby button (which we often confuse for the volume down button).</p>",
            "<p>The Pixel 3 comes with USB-C earbuds in the box, which means, no, there's no standard 3.5mm headphone jack (just like last year's Pixel 2) and without that microSD card slot, you're stuck with 64GB and 128GB storage configurations. </p>",
            "<p>The Pixel 3 color are rather muted, with 'Just Black' as our favorite of the trio. 'Clearly White' looks cheaper and 'Not Pink' isn't for everyone. Okay, it's the color you want if you're looking to stand out a bit, but we liked last year's unique Mint color more. You do get a fresh Mint color on the Clearly White Google Pixel 3 power button, however.</p>",
            "<p>The 5.5-inch OLED screen fits into modern times. It's big and expansive, and sits in a phone that's smaller than we had expected given the screen size rumors. The entire thing measures 145.6 x 68.2 x 7.9mm and weighs 148g. It's roughly the same size as the Pixel 2, which had a smaller 5-inch display.</p>",
            "<p>It's the grown up version of last year's phone. The Pixel 3 screen looks richer than last year's Pixel 2, too. The specs note that it has only a few more pixels per inch, but keep in mind the screen is much taller, so there are a lot more pixels spread across a half inch of extra screen. There's noticeably less bezel thanks to it's 18:9 aspect ratio rather than the dated 16:9 look. Last year's oversized bezel, we felt, was the biggest disappointment design-wise about the Pixel 2XL. The Google Pixel 3 fixes this issue.</p>",
            "<p>Oh, it still has bezel. There's no hiding the two front-facing cameras and speaker at the top and chin at the bottom. But it's the best we've seen from a phone with dual front-facing speakers and without a deep (some would say ugly) notch cut out.</p>"
        ]
    },
    {
        "title": "Google Pixel 3 review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p>The Google Pixel 3 has the best smartphone camera in the world. It's not because the photos it takes are dramatically better — but they're just marginally better. </p>",
            "<p>The bigger deal is that Google's 12.2MP camera is more consistent. We got more detailed, sharper, and slightly brighter photos from this Pixel 3 camera than the warmer iPhone XS and the Samsung Galaxy Note 9 cameras. There's less noise than the Pixel 2 and everything wasn't over-sharpened like the <a href=\"https://www.techradar.com/reviews/huawei-p20-pro-review\">Huawei P20 Pro</a> camera.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/KC3b5wyzm6PQQqVZypNBZd-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/KC3b5wyzm6PQQqVZypNBZd-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/KC3b5wyzm6PQQqVZypNBZd-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/KC3b5wyzm6PQQqVZypNBZd.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/KC3b5wyzm6PQQqVZypNBZd.jpg\"></p>",
            "<p>A lot of this has to do with what's happening behind the scenes. The f/1.8 aperture isn't record-breaking, but Google's camera-dedicated Pixel Visual Core chip and its machine-learning software help deliver this single-lens rear camera its wow factor.</p>",
            "<p class=\"mid__article\"></p>",
            "<p>New software perks like Top Shot help avoid closed eyes by picking the right photo, while Night Sight (coming soon) will give the Google Pixel 3 the edge in most nighttime pictures. It's already doing a fine job (for a smartphone camera) in low-light, according to our tests.</p>",
            "<p>Super Res Zoom helps mitigate the fact that there's no telephoto lens here, with the ability to use backend software to improve digitally zoom The fact that the camera captures larger 1.4 micron pixels and has optical image stabilization (OIS) is also a difference maker.</p>",
            "<p>The same general photo consistency comes to the front-facing 8MP cameras. They reliably took photos with better HDR and less noise. One camera had a normal 75 degree field of view and the other has a wider 97 degree field of view.</p>",
            "<p>The wide-angle selfies are effective at telling more about who you're with and what you're posing in front of, so much so that Google refers to this secondary lens as it's Group Selfie Camera.</p>",
            "<p>The <a href=\"https://www.techradar.com/reviews/phones/mobile-phones/lg-v10-1305854/review\"><u>LG V10</u></a> introduced us to this wide selfie camera idea, and the <a href=\"https://www.techradar.com/reviews/lg-v40-thinq\"><u>LG V40</u></a> continues the trend. Google’s wide-angle photos are better, though they do have some caveats. The aperture is f/2.2 using this lens (vs f1.8 on the normal lens) but you won't notice a big difference in good lighting. The bigger caveat to the Group Selfie Camera is barrel distortion around the edges.</p>",
            "<p>Holding the phone just right helps capture more of what's around you, whether you're posing in front of a tall building or taking a crowded selfie. We posed in front of a distant Hollywood sign, and got an LA-emblazoned T-Shirt in the photo. With any normal selfie camera, the T-Shirt or the Hollywood sign would be cut out.</p>",
            "<p>Here's the problem: Holding in the wrong way takes unflattering photos that make you look like you've been through a funhouse mirror. You may be able to capture more of what's above you, but when more of your shirt fans out, you look like you've put on some awkward weight. Holding the phone out further or at a different angle usually helps. Taking selfies is a skill. Taking wide selfies will earn you another millennial merit badge.</p>",
            "<p>The Pixel 3 shoots impressive 4K video with a mix of optical image stabilization (OIS) and electronic software stabilization. Everything looks incredibly smooth, making the need for something like the DJI Osmo 2 gimbal less of a necessity. You won't, however, find the 4K to shoot 60 frames per second. Google has capped video at this max resolution at 30fps.</p>"
        ]
    },
    {
        "title": "Google Pixel 3 review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p>The Pixel 3 has a 2,915mAh battery, which is slightly smaller than we had hoped (the Samsung Galaxy S9 has a 3,000mAh and we think that could stand to last longer), but it's still an improvement over last year's 5-inch Pixel, which had a 2,700mAh unit. </p>",
            "<p>The battery life is the biggest downside to opting for the smaller Pixel 3. Yes, you can get all-day battery life from this phone with conservative use, but even normal use had us reaching for the charger before the end of the night. That's a problem when you're capturing so many photos using the great camera. The battery really takes a hit. </p>",
            "<p class=\"mid__article\"></p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/D5ZGJJKNZh2mrrG7E4Ngg9-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/D5ZGJJKNZh2mrrG7E4Ngg9-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/D5ZGJJKNZh2mrrG7E4Ngg9-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/D5ZGJJKNZh2mrrG7E4Ngg9.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/D5ZGJJKNZh2mrrG7E4Ngg9.jpg\"></p>",
            "<p>Google's new Android 9 Pie software does give it more juice, with adaptive battery settings that work behind the scenes. It essentially limits the power of apps you don't use in the course of a day, and it's a perk that’s coming to all Android Pie phones (you may already have it on your current Android phone).</p>",
            "<p>The 18W charger returns for fastest charging speeds, but exclusive to the Pixel 3 and Pixel 3 XL (among Pixel phones, at least) is fast wireless charging. The new glass back gives this feature the ability to charge with any Qi charger. </p>",
            "<p>Google launched its minimalist-looking Pixel Stand wireless charger, which doubles as a way to see notifications and interact with Google Assistant, as if this were a mini Google Home Hub.The stand isn't ideal for traveling (it doesn't fold flat, sadly), but it's a nice option for slightly slower 10W charging on a night stand. We were able to reach 80% battery capacity in 1 hour and 39 minutes using wireless charging.</p>"
        ]
    },
    {
        "title": "Google Pixel 3 review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p>The Pixel 3 is a stable, fast-performing phone, though it isn't technically the fastest we've tested in 2018. That really shouldn't matter to most people.</p>",
            "<p>It's powered by the latest Qualcomm Snapdragon 845 chipset and 4GB of RAM, when rival phones are up to 6GB and even 8GB of RAM. Likewise, Apple's A12 chipset beats the Snapdragon 845 handedly in all benchmarking tests.</p>",
            "<p>Here's the good news, we didn't see slowdown from either the Pixel 3 or Pixel 3 XL. And the fact that Google owns the hardware and software should prove beneficial for smooth performance going forward. </p>",
            "<p>The Geekbench 4 benchmarking tests gives the Pixel 3 a multi-core score of 8,336, finishing behind the Samsung Galaxy S9. Long-term, the 4GB of RAM may prove to be an issue, and it may drop frames compared to the next-level performance of  the new <a href=\"https://www.techradar.com/reviews/hands-on-razer-phone-2\">Razer Phone 2</a> when gaming in 3D. But right now, we see nothing to dissuade the average user from buying this handset.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/3EdwXQbYKfn7zRih9UZrcd-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/3EdwXQbYKfn7zRih9UZrcd-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/3EdwXQbYKfn7zRih9UZrcd-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/3EdwXQbYKfn7zRih9UZrcd.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/3EdwXQbYKfn7zRih9UZrcd.jpg\"></p>",
            "<p class=\"mid__article\"></p>",
            "<p>Android 9.0 Pie is now available for all Pixel phones, and the update comes out of the box with the Pixel 3 and Pixel 3 XL. It's a bit of a switch from previous Android operating systems in an effort to adapt to modern times.</p>",
            "<p>Namely, the onscreen home and back buttons have been visually downsized and come with different gestures attached to them. Tapping the <a href=\"https://www.techradar.com/reviews/iphone-xs-review\">iPhone XS</a>-like bottom home button bar (no longer a big circular button) sends you home, while swiping up on this flat bar opens the new recent menu to switch between apps. Swiping up further reveals the app drawer. The back button still works as normal, but is smaller than before.</p>",
            "<p>All of this is in an effort to give the Google Pixel 3 extra screen real estate. It’s effective and you’ll get used to the changes, even if it’s painstaking at first. Your muscle memory needs time to adjust.</p>",
            "<p>The trade-off is worth it, though it’s not Earth-shattering. The same goes for the time and the notification icons along the top, as the Android software is now fit for notched displays (even if this phone doesn’t have a screen cut out at the top).</p>",
            "<p>The right-aligned volume slider interface (right next to the physical volume slider) makes it easier to wrap your head around whether you're adjusting call volume or media volume. Essentially, the slider is now dedicated to media, with a smaller on-screen button to toggle vibrate/ringer/silent. We’ve also had less issues with misguided screen rotation thanks to the new software. That's such a small, but meaningful change for everyday use.</p>",
            "<p>Behind-the-scenes tools are even more groundbreaking. Adaptive battery life and adaptive brightness settings free you from having to worry about closing apps to save battery life and adjusting the brightness in different surroundings. Google’s machine-learning software does the heavy lifting by learning your behaviors and taking into account your environment.</p>",
            "<p>We haven’t seen App Slices and App Actions from the operating system, but they’re shortcuts coming soon so that you can access apps (and content within those apps) faster. We’ll update this review as more changes from the the Google Pixel 3 software over the next year.</p>"
        ]
    },
    {
        "title": "Google Pixel 3 review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p>The Google Pixel 3 is offering a lot, and in a tighter package than most other flagship phones – the larger Pixel 3 XL included. Chief among them is the single-lens 12.2MP rear camera that delivers slightly better photos and, even more importantly, consistently usable photos compared to the competition. Samsung and LG camera phones occasionally exhibited blurriness or poor low-light performance, and Apple’s iPhone XS Max liked to using warmer than necessary color tones. The Pixel 3 delivered the best pictures each and every time. The one and only time it blurred the foreground subject (us) was when we were wearing sunglasses – it so relies heavily on subject recognition.</p>",
            "<p>The Group Selfie Camera, part of Google’s front-facing 8MP camera duo, doesn’t revolutionize selfies. But it does help capture what you’re posing or who you’re posing with. It puts your selfies into context, especially when you're with a bunch of friends or in front of tall, iconic buildings. There are noticeable funhouse-mirror distortion around the edges if you’re not careful with how your frame your Group Selfie Camera shot.</p>",
            "<p>You will have to forgo the additional battery life that comes with larger phones when picking the smaller Pixel 3. That’s the one major issue we had with this smartphone, especially when photo-taking power users are the key audience.</p>",
            "<p>We liked carrying around the Google Pixel 3 more than the larger Google Pixel 3 XL. This is the one-hand-friendly version of the Pixel 3 XL that your grip will appreciate, and you don’t have to worry about the notch cut out at the top. It’s also cheaper than most other flagship phones in 2018, even if it is more expensive than the Pixel 2. It's not only Google's best camera yet, it's the best camera on any smartphone today.</p>",
            "<p>Yes, if you’re seeking the best camera phone at a reasonable size and a reasonable price. You’ll get the best photos from the Pixel 3 and Pixel 3 XL, and the smaller phone is more one-hand-friendly than most flagship handsets. Power users may want to opt for the larger Pixel 3 XL given its larger battery capacity.</p>",
            "<p>The 5.5-inch Google Pixel 3 is best in the hand (singular hand) of someone who wants the best phone camera without having to opt for a handset as big as the Samsung Galaxy Note 9 or iPhone XS Max. It’s priced competitively next to its rival phones, and delivers more consistently rich photos.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/z7EU7n5ct4YonsBoXXTZBd-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/z7EU7n5ct4YonsBoXXTZBd-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/z7EU7n5ct4YonsBoXXTZBd-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/z7EU7n5ct4YonsBoXXTZBd.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/z7EU7n5ct4YonsBoXXTZBd.jpg\"></p>",
            "<p class=\"mid__article\"></p>",
            "<p>The Samsung Galaxy S9 is the chief rival to the Pixel 3, with a larger 5.8-inch screen and more elegantly curved design. Its 12MP camera is also incredible, though, in our tests, second best next to the Pixel 3 and Pixel 3 XL. Samsung’s camera software is a little more robust for selfie taking (triggering selfie photos is easier with your hand), smooth hyperlapses, and super slow motion footage.</p>",
            "<p><strong>Full review: </strong><a href=\"https://www.techradar.com/reviews/samsung-galaxy-s9-review\"><strong>Samsung Galaxy S9</strong></a></p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh.jpg\"></p>",
            "<p>iPhone XS is great camera performer and has a 5.8-inch screens size. However, the operating system is a bit different from Android, so there’s some adjustment when entering or exiting Apple’s walled garden ecosystem. The photo colors are almost always warmer on the iPhone XS compared to the Pixel 3, and we found slightly more detail in Google’s camera.</p>",
            "<p><strong>Full review: </strong><a href=\"https://www.techradar.com/reviews/iphone-xs-review\"><strong>iPhone XS</strong></a></p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/GKy7J2cx6cAhk3SXC6ty8n-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/GKy7J2cx6cAhk3SXC6ty8n-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/GKy7J2cx6cAhk3SXC6ty8n-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/GKy7J2cx6cAhk3SXC6ty8n.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/GKy7J2cx6cAhk3SXC6ty8n.jpg\"></p>",
            "<p>The OnePlus 6T's camera isn't as good as the Pixel 3's, but given that it's a substantially cheaper phone that's okay. And it is a good snapper, with a 16MP and 20MP dual-lens arrangement on the back, complete with optical image stabilization.</p>",
            "<p>Elsewhere, the OnePlus 6T has the same chipset as the Pixel 3 and more RAM, along with a 6.41-inch screen with a 1080 x 2340 resolution and an in-screen fingerprint scanner.</p>",
            "<p><strong>Full review: </strong><a href=\"https://www.techradar.com/reviews/oneplus-6t-review\"><strong>OnePlus 6T</strong></a></p>"
        ]
    },
    {
        "title": "Google Pixel 3 Lite fully revealed in hands-on video",
        "author": [
            "James Rogerson"
        ],
        "text": [
            "<p>News about the <a href=\"https://www.techradar.com/news/google-pixel-3-lite\">Google Pixel 3 Lite</a> has been quiet lately, but it could be set to launch imminently, as someone has seemingly got hold of the handset and it looks more or less finished.</p>",
            "<p>In a video, <a href=\"https://www.youtube.com/watch?v=pwaT4u-1Y60\" target=\"_blank\">Andro News</a> shows the Pixel 3 Lite in detail, revealing a design that's similar to the standard <a href=\"https://www.techradar.com/reviews/google-pixel-3-review\">Google Pixel 3</a>, but this time the phone is made of plastic. Other changes include a speaker on the bottom edge rather than the front, just a single front-facing camera, and a headphone port, which the rest of the range lacks.</p>",
            "<p>The screen meanwhile is apparently a 5.56-inch 1080 x 2160 one with an 18:9 aspect ratio and a pixel density of around 434 pixels per inch. </p>",
            "<p>That makes it marginally bigger than and the same resolution as the 5.5-inch Pixel 3, but the source says it's easy to handle with one hand.</p>",
            "<p class=\"mid__article\"></p>",
            "<p>The camera could be a highlight of the Google Pixel 3 Lite, as it apparently has a 12.2MP f/1.8 main camera with optical image stabilization, which is the same spec as the standard Pixel 3, and the photo quality is also supposedly comparable. There's apparently an 8MP camera on the front.</p>",
            "<p>Other specs are said to include a mid-range Snapdragon 670 chipset, 4GB of RAM and just 32GB of storage.</p>",
            "<p>The battery is supposedly 2,915mAh and the source claims it has similar life to the standard Google Pixel 3, though that's not necessarily great news as in our review we found it was sometimes a struggle to get a day of life from that phone.</p>",
            "<p>We'd take all of this with a pinch of salt, but it all lines up with what we've seen and heard before. There's no information here on when the Google Pixel 3 Lite might actually launch, but <a href=\"https://www.techradar.com/news/google-could-be-working-on-a-mid-range-pixel-phone-for-next-year\">earlier leaks</a> suggested it would land in the first half of 2019, and it certainly looks ready.</p>",
            "<p>Via <a href=\"https://www.theverge.com/circuitbreaker/2019/1/17/18186463/google-pixel-3-lite-video-review-camera\" target=\"_blank\">The Verge</a></p>"
        ]
    },
    {
        "title": "The cheapest Google Pixel 3 unlocked SIM-free prices in January 2019",
        "author": [
            "Luke Edwards"
        ],
        "text": [
            "<p>The Google Pixel 3 has been here for a couple of months now and it's bringing with it all the latest specs from the company behind the Android operating system. As such this phone runs pure Android for a zippy smooth experience that's guaranteed all the latest updates first.</p>",
            "<p>The Pixel 3 comes with a high-res one-hand-friendly 5.5-inch display, behind which sits a powerful 10nm Qualcomm Snapdragon 845 CPU and 4GB of RAM. Go further back and you have, on the rear, a 12.2MP camera that's supported by Google machine-learning software to help it compete even with dual camera systems.</p>",
            "<p><!-- dbg:/fepssi//Google/9 -->\n</p>",
            "<p>So if you're determined to future-proof your digital life with the newest, shiniest Pixel phone (rather than save some cash with a <a href=\"https://www.techradar.com/deals/google-pixel-2-unlocked-sim-free\">SIM-free Pixel 2</a>), then be sure to pick the <a href=\"https://www.techradar.com/news/phone-and-communications/google-pixel-deals-1330046\">cheapest Pixel 3 price</a> from the below comparison chart. Team it up with a low cost <a href=\"https://www.techradar.com/news/phone-and-communications/mobile-phones/sim-only-deals-1297535\">SIM only deal</a> and you could make a decent saving over contract plans.</p>",
            "<p>It's worth noting that Google's tight stranglehold over its own products means that this phone won't be widely available to buy if you're Stateside. You're pretty much confined to Google, <a href=\"https://www.verizonwireless.com/smartphones/google-pixel-3/\" rel=\"nofollow\" target=\"_blank\">Verizon</a> and Best Buy.</p>",
            "<p class=\"mid__article\"></p>"
        ]
    },
    {
        "title": "Google Pixel 3 XL review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p>The Google Pixel 3 XL is the big-screen, best-camera phone combination of 2018, a one-two punch when it comes to offering an expansive, color-rich display and photos your friends won’t believe came from a smartphone.</p>",
            "<p>The 12.2MP rear-facing camera is the first reason to consider this <a href=\"https://www.techradar.com/news/android-pie-9-features-release-date-and-phones-list\"><u>Android Pie</u></a>-touting handset, and the two front-facing cameras – the extra lens is for group selfies – are the second and third reasons. Google’s phone has an edge in picture-taking over everything we’ve tested so far.</p>",
            "<p>It has the same cameras, dual front-facing speakers, Snapdragon 845 chipset, and 4GB of RAM as the one-hand-friendly <a href=\"https://www.techradar.com/reviews/google-pixel-3-review\"><u>Google Pixel 3</u></a>, but the XL version is the one to consider for its larger 6.3-inch bezel-reduced OLED screen and higher-capacity 3,430mAh battery.</p>",
            "<p>Normally, we prefer the bigger screens outright, but the Pixel 3 XL has a hard-to-ignore notch cut out at the top of the display, deeper than the <a href=\"https://www.techradar.com/reviews/iphone-xs-max-review\"><u>iPhone XS Max</u></a> notch. It’s a design quirk – controversial among Pixel fans – that’s meant to offer a little more room for notification icons, the time, and the battery life percentage, all flanking the selfie cameras and top speaker cut out.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/Jdobmo2GqeW5TPUcMCwTDb-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/Jdobmo2GqeW5TPUcMCwTDb-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/Jdobmo2GqeW5TPUcMCwTDb-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/Jdobmo2GqeW5TPUcMCwTDb.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/Jdobmo2GqeW5TPUcMCwTDb.jpg\"></p>",
            "<p>It does give you more screen, sure, but not to the extent that the 6.3-inch diagonally measured spec suggests. To us, the 6.3-inch <a href=\"https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review\"><u>Samsung Galaxy S9 Plus</u></a> and 6.4-inch <a href=\"https://www.techradar.com/reviews/samsung-galaxy-note-9-review\"><u>Note 9</u></a> screens feel a bigger and more immersive. Google’s design approach is more functional than fashionable, favoring its selfie twin cameras with a bit of asymmetrical screen distraction.</p>",
            "<p>The Google Pixel 3 XL ends up being the best option for people who want photos as flawless as they come on a smartphone, and are already used to a wiedling sizable handset. It’s hard to downsize, even if the tighter dimensions of the 5.5-inch Pixel 3 are a better fit for most people. It doesn’t have everything – there’s no microSD card slot or headphone jack – but if you’re willing to embrace the notch design, you’ll get consistently great photos paired with a fairly big screen.</p>",
            "<p><em>Watch our first impressions of the Google Pixel 3 in video form below...</em></p>",
            "<p>The Google Pixel 3 XL release date was Thursday, October 18 in the US, and November 1 in the UK and Australia. The phone is launching in Canada, France, Germany, Japan, India, Ireland, Italy, Singapore, Spain, and Taiwan. Pre-orders started on October 9, right after the New York launch event.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/C45v29YL5T4iziBXqgrgxD-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/C45v29YL5T4iziBXqgrgxD-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/C45v29YL5T4iziBXqgrgxD-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/C45v29YL5T4iziBXqgrgxD.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/C45v29YL5T4iziBXqgrgxD.jpg\"></p>",
            "<p>The Pixel 3 XL price is $899 (£869, AU$1,349) SIM-free for the 64GB storage variant, and $999 (£969, AU$1,499) for the maxed-out 128GB configuration. If you want more space, you’ll have to turn to cloud storage because there’s no microSD card on Pixel phones.</p>",
            "<p>This is a small price hike from the Google Pixel 2 XL by $50 (£70, AU$50), yet cheaper than the iPhone XS Max by $250 (£230, AU$450). It’s still a better value than most flagships out there.</p>",
            "<p class=\"mid__article\"></p>",
            "<p>The Google Pixel 3 XL doesn’t push smartphone design in a revolutionary new direction, but it does see some satisfying change over last year’s <a href=\"https://www.techradar.com/reviews/google-pixel-2-xl-review\"><u>Pixel 2 XL</u></a>. Gone is the glass-and-aluminum back in favor of an all-glass two-tone look. It’s made of shiny glass at the top and a textured matte glass finish for the lower 80%. </p>",
            "<p>You get a more seamless transition between the two textures with the soft-touch glass back made of the same Corning Gorilla Glass 5 that protects the front screen. There’s an aluminum frame that binds the front and back pieces of glass together – the only bit of metal you’ll see.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/sKgD8rL7P93jQVpvzrNzwa-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/sKgD8rL7P93jQVpvzrNzwa-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/sKgD8rL7P93jQVpvzrNzwa-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/sKgD8rL7P93jQVpvzrNzwa.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/sKgD8rL7P93jQVpvzrNzwa.jpg\"></p>",
            "<p>The Pixel 3 XL fits into one hand, but takes two hands to operate and it’s a little more slippery to hold than the Pixel 2 XL. The difference isn’t Earth (or phone) shattering, though we did end up preferring the tighter dimensions of the standard Google Pixel 3 for this reason.</p>",
            "<p>The all-glass design has two benefits. First, LTE signals travel more easily through a glass phone than an aluminum-backed smartphone. That’s going to become important as phone makers and carriers try to claim superior 5G speeds in 2019. Second, wireless charging is a part of Google’s hardware ecosystem again, something we haven’t seen since the plastic Nexus 6. </p>",
            "<p>You’ll find smoother corners on the Google Pixel 3 XL – everything has been rounded off and flattened, giving Google’s Material Design software ethos a foothold within real life hardware. The frame edges are polished and the rear fingerprint sensor is flatter.</p>",
            "<p>The smoother design won’t be enough to wow you next to other big phones. This doesn’t have an elegantly curved screen like the Samsung Galaxy Note 9 and the bottom chin stands out next to the iPhone XS Max. Notch or no notch, Google’s design isn’t winning any awards.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW.jpg\"></p>",
            "<p>But the Pixel 3 XL is more functional: It has two selfie cameras, dual front-facing speakers, and Active Edge, allowing you to squeeze the sides of the frame to trigger Google Assistant. We prefer this over a dedicated AI button, something that annoys us about Samsung and LG’s new phones with dedicated, often-mispressed AI buttons.</p>",
            "<p>Just know that the Pixel 3 XL doesn’t have a standard 3.5mm headphone jack (exactly like the Pixel 2 XL), though it does come with USB-C earbuds in the box this year. You’re also not going to find a microSD card slot anywhere within the design. The 64GB and 128GB internal storage sizes are set in stone once you order them.</p>",
            "<p>There are three muted Pixel 3 XL colors: Clearly White, Just Black and a pinkish Not Pink. We got two reactions from our Clearly White review unit: that it was the most sophisticated hue or that is looked a little cheap and plasticy. Everyone liked the hint of fresh mint color on the power button, a pleasing dab of color that’s exclusive to the Clearly White version.</p>",
            "<p>The Google Pixel 3 XL has a sizable 6.3-inch OLED screen with a 18.5:9 aspect ratio, a QHD+ resolution, and HDR Support with true black levels. It’s a higher-quality screen compared to the <a href=\"https://www.techradar.com/news/pixel-2-xl-screen-burn-in-problems\"><u>problematic P-OLED Pixel 2 XL</u></a> screen we found to be desaturated and leave ghosting burn-in.</p>",
            "<p>There’s also more display here and less bezel, with an 83% screen-to-body ratio (up from 76%), thanks to a 6.3-inch screen (up from 6 inches). The bigger screen fits in basically the same dimensions of 158 x 76.7 x 7.9mm. That’s some nice progress from the engineers at Google.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/cAVJ3Uz8hzz5iUrH4DAho-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/cAVJ3Uz8hzz5iUrH4DAho-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/cAVJ3Uz8hzz5iUrH4DAho-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/cAVJ3Uz8hzz5iUrH4DAho.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/cAVJ3Uz8hzz5iUrH4DAho.jpg\"></p>",
            "<p>It’s two steps forward and one step back when you see the notch cut out at the top, however. No one we talked to liked it. A few people said they didn’t mind it too much. That’s as positive as things got. For us, when testing it day-to-day, we found it harder to ignore the deep notch when browsing websites and watching videos. It’s not as easy to overlook as the <a href=\"https://www.techradar.com/reviews/iphone-x-review\">iPhone X</a> notch.</p>",
            "<p>But wait, we found some software tricks to fix this issue: Google’s hidden developer tools menu offers the ability to hide the notch, though the notification icons, time, and battery life percentage are pushed further down. A third-party app, Nacho Notch, is better. It puts all of that information within the blackened notch space. Why this isn’t a part of the phone by default is perplexing.</p>",
            "<p>The notch cut out shouldn’t be a dealbreaker if you want the best-in-class Pixel 3 camera and desire your phone at the biggest size possible. The software tricks certainly help.</p>"
        ]
    },
    {
        "title": "Google Pixel 3 XL review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p>The Google Pixel 3 XL captures the best photos of any smartphone we tested to date – tied with the smaller, spec-matching <a href=\"https://www.techradar.com/reviews/google-pixel-3-review\"><u>Google Pixel 3</u></a>. Its photos were often marginally better than those from other flagship phones. And, occasionally, our side-by-side tests showed big differences. </p>",
            "<p>What sets Google’s 12.2MP rear camera apart is consistency. We got sharper, slightly brighter photos from the Pixel 3 XL camera, while the iPhone XS Max we used at the same time showed overly warm color tones. The <a href=\"https://www.techradar.com/reviews/samsung-galaxy-note-9-review\"><u>Samsung Galaxy Note 9</u></a> didn’t always have the best HDR, ending up being second best, while the hit-or-miss <a href=\"https://www.techradar.com/reviews/huawei-p20-pro-review\"><u>Huawei P20 Pro</u></a> camera frequently oversharpened everything as if its goal was to create a 3D painting that pops out at you.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/FiFg8627RfsneX3a8NuHva-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/FiFg8627RfsneX3a8NuHva-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/FiFg8627RfsneX3a8NuHva-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/FiFg8627RfsneX3a8NuHva.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/FiFg8627RfsneX3a8NuHva.jpg\"></p>",
            "<p>What’s remarkable is that the Google Pixel 3 XL doesn’t even have the best camera hardware on paper. Its f/1.8 aperture isn’t record-breaking (Samsung and LG are faster at an f/1.5 aperture) and 12.2MP is rather low compared to the 16MP to 40MP camera phones out there.</p>",
            "<p>Behind-the-scenes, Google’s dedicated Pixel Visual Core chip and machine-learning software are the magic that recognize what photos should look like and which shots you’ll actually want. If there’s one thing Google knows how to do, it’s process data and perfect algorithms. That’s pretty much what’s happening here.</p>",
            "<p>The two 8MP front-facing cameras share the rear camera’s machine-learning perks, and for the most part, offer a strong case for the best selfie camera. The primary selfie camera offers a tighter frame at a normal 75 degree field of view, while the secondary selfie camera has a wider 97 degree field of view.</p>",
            "<p>We found that both normal and wide selfies (enabled with an on-screen slider bar) exhibited better HDR and less noise than Google’s competitors. Of course, sometimes you want detail in selfies. And sometimes you really don’t. In some situations, the iPhone XS Max we used at the same time provided tighter, more intimate shots and a bit more natural skin smoothing.</p>",
            "<p class=\"mid__article\"></p>",
            "<p>Wider-angle ‘Group Selfies’ have their place, telling more about who you’re with or what you’re posing in front of. Whether it’s with a bunch of friends or in front of a famous tall building, we loved being able fit more into a photo, even if the aperture dropped from f/1.8 to f/2.2 between the two cameras. </p>",
            "<p>Be warned: wielding a wide selfie camera takes work if you want flattering photos. At the wrong angle – usually at lower angles – it will make you and your selfie partners’ shirts and upper bodies flare out with barrel distortion at the edges. If you’re taking photos as a couple, you will get in trouble for this. It’s great when it works, and we’re glad it’s here, but unlike the rest of the camera perks, this one doesn’t give you automatic perfection with each shot.</p>",
            "<p>There’s a lot of helpful post-processing going on here, and not the kind we’re used to seeing from China-sourced smartphones that overly rely on Beauty Mode after-effects. When the Pixel 3 XL cleans up photos, it’s to reduce grain from low-light shots, amp up brightness without adding noise, and select the best shot even if you’ve only tapped the shutter button once.</p>",
            "<p>A lot of this post-processing happens automatically, but Google does give you some in-app options.</p>",
            "<p><strong>Top Shot</strong>, for example, is a new feature that allows you to select a new key photo when Motion Photos is turned on. The camera is taking photos before and after you hit the shutter button, so you have access to fleeting moments in which you weren’t blinking or a car didn’t just pass in front of your subject. This ends up being the Pixel 3 XL’s answer to Apple’s Live Photos with the ability to scrub through a small timeline to select a new keyframe. It’s helpful, though, everything but the original photo is in lower resolution, so you may have some tough choices to make.</p>",
            "<p><strong>Super Res Zoom</strong> is surprisingly clear for digital zoom, and the science behind it is fairly deep. It takes advantage of hand-motion in order to capture many frames in order to built a higher resolution (or super resolution) photo. And if you happen to use a smartphone tripod in which the handset is completely still? The camera simulates natural hand motion by intentionally ‘jiggling’, forcing the OIS module to move between frames, explains Google.</p>",
            "<p>We found Super Res Zoom is be on par and sometimes better than the IPhone XS and Samsung Galaxy Note 9 telephoto lenses. Only the Huawei P20 Pro and its 3x zoom could rival what the Google Pixel 3 XL camera was capable of digitally. It’s all a testament to Google’s insistence on a single-lens rear camera. You’re not missing out, despite what the specs say.</p>",
            "<p>There’s more. Adjustable Portrait Blur allows you to change the amount of bokeh in post, and there’s a new color pop mode that isolates the background in black-and-white while leaving you in color. Night Sight – coming soon – is meant to amp up brightness of low-light photos so you don’t need to use that aggressive, photo-ruining flash. And Photobooth uses AI to automatically snap photos, incorporating the idea behind Google Clips right into your smartphone.</p>",
            "<p>The Google Pixel 3 XL camera app doesn’t have everything we want. The simplistic app isn’t as robust as Samsung and LG’s default camera apps. Triggering the selfie camera timer with your hand is missing here, and so is flipping between the front and back cameras with simple swipe gestures. You’re also still not going to find a Hyperlapse mode within this camera app. When it has a truly out there mode like Playground for AR stickers, that’s a bit disappointing.</p>"
        ]
    },
    {
        "title": "Google Pixel 3 XL review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p>The larger Pixel 3 XL is the one to get if you’re worried about battery life. Power users will have all-day battery life, and everyone else will get closer to a day and a half from this phone.</p>",
            "<p>We found its 3,430 battery capacity to be solid enough for our daily needs, even if it’s not as big as the <a href=\"https://www.techradar.com/reviews/samsung-galaxy-note-9-review\"><u>Samsung Galaxy Note 9</u></a> battery at 4,000mAh. It’s closer to the 3,500mAh battery of the <a href=\"https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review\"><u>Samsung Galaxy S9 Plus</u></a>, and Google has some smart power-saving modes in play here.</p>",
            "<p>Adaptive battery, the new <a href=\"https://www.techradar.com/news/android-pie-9-features-release-date-and-phones-list\"><u>Android Pie</u></a> feature to turn off power-hungry apps you don’t use, will get you more battery life, and so will downgrading the pixel count to Full HD+ instead of QHD+. You won’t notice the difference. For us, the Pixel 3 XL lasted about a dozen hours more than the smaller <a href=\"https://www.techradar.com/reviews/google-pixel-3-review\"><u>Google Pixel 3</u></a> with its 2,915mAh battery in real life tests.</p>",
            "<p>There’s an 18W charger in the Google Pixel 3 XL box that offers faster charging speeds than a conventional USB charger, and the phone supports fast wireless charging. All Qi chargers worked fine in our testing (though slower than wired charging), and Google i selling a new Pixel Stand if you don’t have a wireless charger yet.</p>",
            "<p>The minimalist-looking Pixel Stand doubles as a way to see notifications, making your Pixel 3 XL a mini <a href=\"https://www.techradar.com/reviews/google-home-hub\"><u>Google Home Hub</u></a> of sorts. But we found this stand doesn’t collapse and it’s a bit overpriced at $79. We found Mophie and Samsung’s wireless chargers cheap and easy to travel with.</p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/6ApBp6qE2r8eZactuufMdd-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/6ApBp6qE2r8eZactuufMdd-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/6ApBp6qE2r8eZactuufMdd-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/6ApBp6qE2r8eZactuufMdd.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/6ApBp6qE2r8eZactuufMdd.jpg\"></p>",
            "<p class=\"mid__article\"></p>",
            "<p>The Google Pixel 3 XL has been built to offer stable everyday performance, though you won’t find record-breaking speeds from its chipset and RAM configuration.</p>",
            "<p>It uses the latest Qualcomm Snapdragon 845 chipset paired with 4GB of RAM at a time when Google’s rivals are making phones with 6GB and 8GB of RAM. Meanwhile, Apple’s A12 chipset and even the year-older A11 chipset beat the Snapdragon 845 chip handsdown.</p>",
            "<p>Benchmarks, primarily using Geekbench 4 to test overall performance, back up what the specs suggest. The Pixel 3 XL had a multi-core score of 8,350, behind the <a href=\"https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review\"><u>Samsung Galaxy S9</u></a>, and further behind phones like the <a href=\"https://www.techradar.com/reviews/samsung-galaxy-note-9-review\"><u>Note 9</u></a>, <a href=\"https://www.techradar.com/reviews/oneplus-6\"><u>OnePlus 6</u></a> and <a href=\"https://www.techradar.com/reviews/iphone-xs-max-review\"><u>iPhone XS Max</u></a>. </p>",
            "<p>That’s okay for two important reasons. First, we didn’t find any lag from the <a href=\"https://www.techradar.com/reviews/google-pixel-3-review\"><u>Pixel 3</u></a> or Pixel 3 XL in our extensive daily testing of both phones. Second, this is Google-made hardware that runs pure Android software. We therefore got snappy performance on day one and expect it to be just as good when the next operating system update rolls out, likely in August 2019.</p>",
            "<p>You’re not going to notice a drop in performance now, though this phone isn’t as future-proofed as the iPhone XS, <a href=\"https://www.techradar.com/reviews/hands-on-razer-phone-2\"><u>Razer Phone 2</u></a>, and <a href=\"https://www.techradar.com/reviews/asus-rog-phone\"><u>Asus ROG Phone</u></a>. Gamers may want to look elsewhere if they’re primary focus is the <a href=\"https://www.techradar.com/news/best-phone-for-gaming\"><u>best gaming phone</u></a> and not the <a href=\"https://www.techradar.com/news/best-cameraphone\"><u>best camera phone</u></a>.</p>",
            "<p>The Google Pixel 3 XL is the best way to enjoy the <a href=\"https://www.techradar.com/news/android-pie-9-features-release-date-and-phones-list\"><u>Android 9.0 Pie</u></a> interface changes, with a great big screen to soak in the further refined Material Design and battery life-saving benefits.</p>",
            "<p>It comes with stock Android software, which contrasts with the look and feel provided by other Android smartphone makers that liberally alter Google’s software to their liking (and the disliking of ‘pure Android’ fans). Everything here is how Google has intended it.</p>",
            "<p>You are in for a bit of a change, though. Google’s on-screen navigation buttons along the bottom of the handset have been downsized and require learning new gestures. The home button, for example, has been flattened-out <a href=\"https://www.techradar.com/reviews/iphone-x-review\"><u>iPhone X</u></a>-style and tapping it sends you home. Swiping it up from the bottom opens up the new recent menu, and swiping all the way up reveals the new app drawer location. The back button is similar, but is a bit smaller than before.</p>",
            "<p>Google’s changed UI also makes room for the Pixel 3 XL notch. The time and notification icons reside on the left side of the screen, while icons for LTE, signal strength, and battery life are flush right. The on-screen volume slider is now right-aligned, adjacent to the physical volume slider. This slider is now dedicated to media playback volume, while a small toggle button at the top of the slide dictates whether you’re in ring/vibrate/silent mode.</p>",
            "<p>More than anything, you’ll get more benefit from the new behind-the-scenes effects of the Adaptive Battery Life and Adaptive Brightness settings. Adaptive Battery Life uses Google’s machine-learning smarts to figure out which apps you won’t be using in the future and then reduces their needless energy drain. Adaptive brightness takes into account your surroundings to save you some juice whenever possible. </p>",
            "<p>There’s more coming to Android Pie, too. App Slices and App Actions were shown off at Google IO, and they enable shortcuts to app (and content within those apps). We’re planning to update this review when these features go live on the Google Pixel 3 XL.</p>"
        ]
    },
    {
        "title": "Google Pixel 3 XL review",
        "author": [
            "Matt Swider"
        ],
        "text": [
            "<p>The Google Pixel 3 XL marries the best camera phone we’ve ever tested with a sizable, albeit controversial color-rich 6.3-inch OLED screen. It’s the right fit for people who don’t mind the notch cut out at the top and have already adjusted their grip for bigger smartphones in the past.</p>",
            "<p>Its 12.2MP rear single-lens camera outperforms dual- and triple-lens smartphone cameras. We found its photos more consistently usable than photos from Samsung, Apple and LG’s camera phones. Even digitally zoomed-in pictures looked better, thanks to Google’s machine-learning camera software. </p>",
            "<p>We’re not sure what we’re more impressed with: the science that happens behind-the-scenes every time we snap a photo, or the actual Google Pixel 3 XL pictures. We were similarly pleased with the twin 8MP cameras, and felt the wide Group Selfie lens came in handy to capture more moments with friends. We just wish the default camera tricks were fleshed out when it came to triggering the selfie camera timer, and that Google had its own take on hyperlapse videos.</p>",
            "<p>The Pixel 3 XL is the phone for power users who want an edge in daily picture-taking, and want it with a bigger screen and extra battery life. That said, for most people, we would recommend the smaller 5.5-inch <a href=\"https://www.techradar.com/reviews/google-pixel-3-review\"><u>Google Pixel 3</u></a>. It has tighter dimensions for easy one-hand use, and it’s cheaper. Use that saved money for the 128GB of storage version, unless you really need the extended battery life.</p>",
            "<p>Yes, if you’re a power user who wants a big screen with the best camera. When testing a whole series of camera phones, more times than not, we preferred the Google Pixel 3 XL photos. Google’s backend camera software is superior and there are actually more features to come. Just know that the bigger size does come with the notch cut out that you can’t ignore.</p>",
            "<p>The Pixel 3 XL is meant for people with big hands and slightly bigger budgets than the preferred Google Pixel 3. It has the same great camera and snappy performance, but in a bigger size. If your current smartphone has a larger screen, you may not want to downsize. That makes the Google Pixel 3 your top choice if you want to reap the benefits of its top-notch camera.</p>",
            "<p class=\"mid__article\"></p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/L2DtCXvLEttdoBakFHcxPb-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/L2DtCXvLEttdoBakFHcxPb-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/L2DtCXvLEttdoBakFHcxPb-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/L2DtCXvLEttdoBakFHcxPb.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/L2DtCXvLEttdoBakFHcxPb.jpg\"></p>",
            "<p>With similar screen sizes, camera specs, and performance, the 6.3-inch Galaxy S9 Plus is the chief rival of the Google Pixel 3 XL. However, there are some key differences. You won’t find a notch cut out on Samsung’s phone and its screen is slightly curved at the sides for a more elegant look and feel. We also liked using Samsung’s phone triggering gesture-controlled camera timer, and recording hyperlapse and super slow motion videos. But when it comes to more meaningful photo quality Google’s rear-and-front-facing cameras shine.</p>",
            "<p><strong>Full review: </strong><a href=\"https://www.techradar.com/reviews/samsung-galaxy-s9-review\"><strong>Samsung Galaxy S9</strong></a></p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh.jpg\"></p>",
            "<p>The iPhone XS Max has a slightly smaller notch and bigger screen at 6.5 inches, and while its camera is the best on an iPhone, we found many of its photos exhibit warmer tones. The real reason to choose Apple’s flagship smartphone is because you might already full invested in the iOS 12 ecosystem, be beholden to iMessages, and own an iPad and Mac. </p>",
            "<p><strong>Full review: </strong><a href=\"https://www.techradar.com/reviews/iphone-xs-max-review\"><u><strong>iPhone XS Max</strong></u></a></p>",
            "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/kwEJoqtwxwVv5SgfLAZVH-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/kwEJoqtwxwVv5SgfLAZVH-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/kwEJoqtwxwVv5SgfLAZVH-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/kwEJoqtwxwVv5SgfLAZVH.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/kwEJoqtwxwVv5SgfLAZVH.jpg\"></p>",
            "<p>The LG V40 isn’t a bad smartphone thanks to its 6.4-inch OLED, but it’s certainly not the best value at its launch price. The rear triple-lens camera provides normal, wide, optically zoomed angles, but we consistently found the Google Pixel 3 XL to be sharper – often by a long shot. While LG’s camera app is more full-featured next to Google’s somewhat thin camera modes, there’s no one big reason to choose the LG V40 over the Google Pixel 3 XL.</p>",
            "<p><strong>Full review: </strong><a href=\"https://www.techradar.com/reviews/lg-v40-thinq\"><u><strong>LG V40</strong></u></a></p>"
        ]
    },
    {
        "title": "Google Pixel 3 Lite release date, price, news and leaks",
        "author": [
            "James Rogerson"
        ],
        "text": [
            "<p><strong>Update: </strong><em>A video has shown a phone that's supposedly the Google Pixel 3 Lite in detail, as well as revealing most of the specs.</em></p>",
            "<p>So far, the Pixel range has been exclusively high-end, but that might be all set to change, as numerous leaks and rumors point to a Google Pixel 3 Lite joining the already-available <a href=\"https://www.techradar.com/reviews/google-pixel-3-review\">Google Pixel 3</a> and <a href=\"https://www.techradar.com/reviews/google-pixel-3-xl-review\">Google Pixel 3 XL</a>.</p>",
            "<p>While nothing about the phone is known for sure yet, we have a good idea of what to expect, as leaked images, specs lists and even a video have painted a fairly complete picture.</p>",
            "<p>We’ve collected all the news, leaks and rumors here and will add to this article whenever new information emerges. So read on for all the information so far on the Pixel 3 Lite, when you might see it, and what it might cost.</p>",
            "<p><strong>Hottest leaks:</strong></p>",
            "<p>The only real release date rumor comes from reliable leaker <a href=\"https://www.techradar.com/news/google-could-be-working-on-a-mid-range-pixel-phone-for-next-year\">Roland Quandt</a>, who, back in June 2018, said that a mid-range Pixel device was scheduled for launch during the first half of 2019.</p>",
            "<p>That’s not very specific, but it’s a window that makes sense, as Google is unlikely to launch it too late in 2019 or it could clash with the Pixel 4 range. Though of course it’s always possible that it could land alongside those phones as the Pixel 4 Lite.</p>",
            "<p>As for what the Pixel 3 Lite might cost, the only <a href=\"https://www.techradar.com/news/leaked-photos-may-reveal-the-google-pixel-3-lite\">rumor</a> there puts it at between $400-$500 (roughly £315-£390, AU$550-AU$690). That adds up, especially as it’s obviously going to undercut the Pixel 3, which starts at $799 (£739, AU$1,199).</p>",
            "<p>However, there’s an outside chance that you won’t be able to buy it, as an <a href=\"https://www.techradar.com/news/a-cheaper-google-pixel-3-may-be-in-the-works\">early report</a> suggested that the phone was aimed primarily at emerging markets like India.</p>",
            "<p>But that report is old and didn’t specifically say that the phone wouldn’t get a global launch. With such a big name attached to it we’d think it would probably be widely available.</p>",
            "<p><strong>Hottest leaks:</strong></p>",
            "<p>Our best look yet at the Google Pixel 3 Lite comes from <a href=\"https://www.techradar.com/news/google-pixel-3-lite-fully-revealed-in-hands-on-video\">the video below</a>, which shows it from various angles.</p>",
            "<p>The video claims that the phone is made of plastic and you can see that it has a 3.5mm headphone port and that the speaker is on the bottom edge rather than the front.</p>",
            "<p>The video also says that it has a 5.56-inch, 1080 x 2160 screen with an 18:9 aspect ratio and a pixel density of roughly 434 pixels per inch.</p>",
            "<p>A number of leaked images supposedly showing the Pixel 3 Lite have also emerged, such as <a href=\"https://www.techradar.com/news/pixel-3-lite-pics-have-leaked-heres-how-it-compares-to-the-3-xl-and-iphone-xr\">those in the gallery below</a>, which show it alongside various other handsets.</p>",
            "<p>You can see from these that it’s smaller than the Pixel 3 XL, bigger than the <a href=\"https://www.techradar.com/reviews/iphone-xs-review\">iPhone XS</a> and around the same size as the <a href=\"https://www.techradar.com/reviews/iphone-xr-review\">iPhone XR</a>. You’ll also note that while there’s no notch there is a sizeable bezel both above and below the screen.</p>",
            "<p class=\"mid__article\"></p>",
            "<p>It’s a design that leaves the Pixel 3 Lite looking a lot like the standard Pixel 3 from the front, while from the back it has a two-tone color scheme like the rest of the Pixel 3 range, in this case in two shades of white. It also has a rear fingerprint scanner.</p>",
            "<p>Another <a href=\"https://www.techradar.com/news/heres-another-unofficial-look-at-the-upcoming-pixel-3-lite\">leaked image</a> shows the Google Pixel 3 Lite next to the standard Google Pixel 3. They look similar, though the Pixel 3 Lite is possibly slightly bigger.</p>",
            "<p>That’s no surprise, as according to <a href=\"https://www.techradar.com/news/leaked-photos-may-reveal-the-google-pixel-3-lite\">an earlier leak</a> which included both images (shown below) and specs, the Pixel 3 Lite has a 5.56-inch screen, which is slightly bigger than the 5.5-inch screen of the Pixel 3.</p>",
            "<p>Though the Google Pixel 3 Lite apparently uses LCD rather than OLED. It’s also said to have a 1080 x 2280 resolution, a 444ppi pixel density (much the same as the Pixel 3) and a plastic rather than glass back. It’s seemingly codenamed Sargo and, as you can see in the images below, appears to have a 3.5mm headphone port.</p>",
            "<p>While we’d take these leaks with a pinch of salt, the photos all look convincing and all match up with one another, as does the video, so there’s a good chance this really is the Pixel 3 Lite that we’re looking at.</p>",
            "<p><strong>Hottest leaks:</strong></p>",
            "<p>From the images and video above, you can see that the Google Pixel 3 Lite has just one camera lens on the back and one on the front. That’s different from the Pixel 3 and Pixel 3 XL, which both have two front-facing cameras.</p>",
            "<p>However, the Pixel 3 Lite is rumored to pack the same great 12.2MP lens on the rear as the rest of the range. We’ve also seen <a href=\"https://www.techradar.com/news/google-pixel-3-lite-camera-samples-leak-hints-at-flagship-credentials\">camera samples</a> supposedly taken using the phone, which you can see below.</p>",
            "<p>The same source as those samples says that the phone has an 8MP front-facing camera. This is likely the same lens as one of the selfie cameras on the Pixel 3 and Pixel 3 XL. The source doesn’t say which lens the Pixel 3 Lite is lacking, but we’d expect it will be the wide-angle selfie lens that’s absent.</p>",
            "<p>However, there’s more at play in photo quality and camera modes than just the lens. The Google Pixel 3 Lite is sure to have a less powerful chipset than the rest of the range and therefore also a lower-end image signal processor (ISP).</p>",
            "<p>So don’t be surprised if its camera isn’t ultimately as capable as the snapper on the Pixel 3. That said, the same source had previously said that the camera on the Pixel 3 Lite <a href=\"https://www.techradar.com/news/leaked-photos-may-reveal-the-google-pixel-3-lite\">would be just as good as on the rest of the Pixel range</a>. Though it’s not clear whether they’re just talking about the lens there or about the whole experience.</p>",
            "<p>As for the battery, that’s <a href=\"https://www.techradar.com/news/leaked-photos-may-reveal-the-google-pixel-3-lite\">supposedly 2,915mAh</a>, which would make it exactly the same size as the one in the standard Google Pixel 3. We’ve heard that size from two sources now, with one adding that the longevity of the phone is also similar to the Pixel 3.</p>",
            "<p><strong>Hottest leaks:</strong></p>",
            "<p>The earliest Pixel 3 Lite leaks <a href=\"https://www.techradar.com/news/google-could-be-working-on-a-mid-range-pixel-phone-for-next-year\">pointed to a Snapdragon 710 chipset</a>, but <a href=\"https://www.techradar.com/news/leaked-photos-may-reveal-the-google-pixel-3-lite\">more recent rumors</a> talk of a slightly lower-end Snapdragon 670. These are both mid-range chipsets though.</p>",
            "<p>We’ve also heard rumors of 4GB of RAM, 32GB of storage and – unsurprisingly given this is a Google device – no microSD card slot.</p>",
            "<p>Of course, being a Pixel handset this is sure to run pure <a href=\"https://www.techradar.com/news/android-pie-9-features-release-date-and-phones-list\">Android 9 Pie</a> (assuming Android 10 isn’t out by the time this launches) and get day one updates to new versions of the operating system.</p>"
        ]
    }
]