[
    {
        "title": "\n\t\tSony Xperia XZ3 tips and tricks\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>With one of the best displays around, stereo speakers, and a slick design, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz3-review/\">Sony’s Xperia XZ3</a> is a stunning smartphone. We delve into some of the most useful and less obvious features and options here, some of which are standard features that appear on many Android phones and some that are specific to Sony’s flagship. These are our top Sony Xperia XZ3 tips.</p>",
            "<p>You have a gorgeous 6-inch OLED screen to play with, which means there’s plenty of room for two apps to be open at once. The easiest way to trigger split screen is to tap the on-screen <em>Recents</em> button – the square icon at the bottom right – and then tap and hold on one of the apps you want open and drag it up to the top where it says <em>Drag here to use split screen</em>. You can then pick your app for the bottom half of the screen.</p>",
            "<p>If you want to resize, simply tap, hold, and drag the rectangle in the middle. To go full screen again, with either app, simply drag the divider all the way to the top or all the way to the bottom.</p>",
            "<p>A lot of people seem to dislike auto brightness, which automatically adjusts the brightness of your display based on the amount of light in your environment. Adaptive brightness in Android 9 Pie also uses machine learning to learn your habits when it comes to increasing and decreasing brightness, and it’s far more useful.</p>",
            "<p>Go to <em>Settings &gt; Display &gt; Adaptive brightness</em> to toggle it on. Now, if you go into a dark room and find that the brightness drops too low, simply swipe down from the top with two fingers and adjust the brightness slider to your comfortable minimum level. Reset the brightness to your tastes when it doesn’t look right, and the system should learn your preferences and start to adjust to the desired level automatically.</p>",
            "<p>We think the Xperia XZ3 display is stunning, but if it isn’t meeting your expectations, then you should dig into the settings and make some tweaks. If you don’t feel the colors are natural enough or perhaps your display looks a touch too blue, you can tweak the settings to adjust it.</p>",
            "<p>Go to <em>Settings &gt; Display &gt; Advanced</em> and you can tweak the <em>Color gamut and Contrast</em> or the <em>White balance </em>to get the look you want. You’ll also find the <em>Video image enhancement</em> toggle in here, which we recommend leaving on for sharper video.</p>",
            "<p>Once you’ve been using your Xperia XZ3 for a while, it will begin to fill up and you might want to <a href=\"https://www.digitaltrends.com/mobile/how-to-free-up-storage-space-on-your-android-smartphone-or-tablet/\">free up some space</a>. Go to <em>Settings &gt; Storage</em> and tap <em>Free up space</em>. If there’s anything you can get rid of, it will be highlighted here. You can also tap on the individual categories to see what they contain.</p>",
            "<p>Sony has made it easy to pair a PlayStation 4 Dualshock controller with your Xperia XZ3 for an even better gaming experience. Go to <em>Settings &gt; Device connection &gt; Connection preferences</em> and scroll down to <em>Game controller</em> to select <em>Dualshock 4</em>. You can then tap <em>Pair controller</em> to use a controller with your Xperia XZ3.</p>",
            "<p>Sometimes you want to capture a conversation to share or record a high score for posterity, and you need to take a screenshot. The traditional Android method works just fine with the Xperia XZ3: Hold down the <em>Volume down</em> and <em>Power</em> buttons simultaneously and you should see a capture animation and hear the screenshot sound.</p>",
            "<p>In Android 9 Pie, there’s now a handy screenshot shortcut that works especially well when you’re using the Xperia XZ3 one-handed. Hold down the <em>Power</em> button and you’ll see a <em>Screenshot</em> option as part of the <em>Power off </em>menu. All screenshots appear in the notification shade, where you can edit them, and you can also find them later in the <em>Photos</em> and <em>Album</em> apps in a folder called <em>Screenshots</em>.</p>",
            "<p>The Sony Xperia XZ3 has a dedicated camera button on the right spine, which is in the perfect position for snapping a shot when you hold the phone in landscape. If you hold down that button, then you can launch straight into the camera.</p>",
            "<p>Open the camera app and tap the gear icon at the top left, then scroll down to find your hardware key options. You can set <em>Use Volume key as</em> to <em>Zoom</em> or <em>Shutter</em> and you can set the dedicated camera key to <em>Launch only</em> or <em>Launch and capture</em>.</p>",
            "<p>There’s also a <em>Smart launch</em> option that triggers the camera automatically when you hold the Xperia XZ3 up in landscape as though you’re going to snap a photo. We found this slightly annoying, as it triggered a lot of photos by accident, but you might find it handy.</p>",
            "<p>Both these options can be turned on or off in the camera app by tapping the gear icon to open the settings and then scrolling down to <em>Smart launch</em> and <em>Launch with camera key</em>. Both can also be configured to open and immediately snap a shot if you prefer, something that could prove handy for capturing those spontaneous moments where you must be quick.</p>",
            "<p>Look in <em>Settings &gt; Sound &gt; Audio settings</em> for a wealth of options related to the Xperia XZ3’s audio output. Some of these settings are just for headphones, but you’ll also find an equalizer, some surround sound settings, and the <em>Dynamic normalizer</em>, which is great for preventing suddenly loud advertisements or switches in music volume.</p>",
            "<p>When you’re watching a movie on the Xperia XZ3 using the stereo speakers, make sure you go into the <em>Audio settings &gt; Sound effects</em> and turn <em>S-Force Front Surround</em> on.</p>",
            "<p>The Sony Xperia XZ3 is a very tall smartphone indeed, and it can be tricky to manage one-handed, so Sony has built in a special one-handed mode that allows you to reduce the screen size and drag it down to the left or right corner. You’ll find it in <em>Settings &gt; Display &gt; Advanced &gt; One-handed mode</em>. To activate it, simply swipe right to left or left to right along the bottom edge of the screen. You can drag the corner to resize and tap on any black space to go full-screen again.</p>"
        ]
    },
    {
        "title": "\n\t\tHere’s everything we know about the upcoming Sony Xperia XZ4\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>The curvy <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz2-review/\">Sony Xperia XZ2</a> and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz3-review/\">Xperia XZ3</a> marked radical shifts in design for Sony, which had been releasing somewhat dated-looking phones up until then. Now, it looks like the company is prepping a follow-up to the Xperia XZ3, likely to be called the Sony Xperia XZ4, and it may do something different with the look once more.</p>",
            "<p>Interested in the Sony Xperia XZ4? Here’s everything you need to know.</p>",
            "<p>Sony has been tight-lipped about the XZ4’s camera, and few details have managed to leak from Sony’s manufacturing monolith. What little we knew said there would be a three-camera setup on the back, and a super-wide-angle selfie camera around the front.</p>",
            "<p>A few more details have surfaced regarding the camera lenses, and if accurate, it would set the Xperia XZ4 up to be a record-breaker. According to a post on <a href=\"https://sumahoinfo.com/post-29674\">Sumahoinfo</a>, the Xperia XZ4 will be equipped with an enormous 51-megapixel lens with an f/1.6 aperture. This surpasses the record held by the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/honor-view-20-review/\">Honor View 20</a>‘s 48-megapixel lens, and like the Honor phone, the XZ4 would be able to downsize its photos to preserve storage space at a still-respectable 13-megapixels.</p>",
            "<p>That monster will apparently be joined by a 16-megapixel telephoto lens with an f/1.8 aperture, and a Time-of-Flight sensor as the third lens. However, the accuracy of these rumors is <a href=\"https://www.gsmarena.com/rumor_sony_xperia_xz4_to_have_52mp_sensor-news-35312.php\">in some dispute</a>, as the details are based on a leaked CAD render that could be out-of-date.</p>",
            "<p>We’re expecting the Sony Xperia XZ4 to be a real smartphone powerhouse. The first element of this is likely to be the latest <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-855-news/\">Qualcomm Snapdragon 855</a> processor, according to leaks published on the Weibo social network from noted <a href=\"https://m.weibo.cn/detail/4313609813258733\" rel=\"noopener\">phone leaker Ice Universe</a>, who states the Snapdragon 855 will be joined by 6GB of RAM and either 64GB or 256GB of internal storage space. This has been backed up by <a href=\"https://www.technobezz.com/sony-xperia-xz4-2019-flagshipss-specifications-now-close-to-official-583695/\">a post on TechnoBuzz</a>, which also includes the option of 128GB of storage. Initial leaks said a 3,900mAh battery would provide the energy, but this has been upgraded to 4,400mAh in more recent leaks.</p>",
            "<p>Sony has been sticking with a biannual release schedule for the Xperia line over the past few years, and given that the Xperia XZ3 was released in October, we expect to see the new Xperia XZ4 around April. That would mean MWC 2019 at the end of February is the perfect place to show off the Xperia XZ4. That logic seems to have paid off, as we have received an invite from Sony for an MWC press conference. The invite gives little away about the content of the show, but we imagine the Xperia XZ4 is a likely candidate for the spotlight.</p>",
            "<p>When it comes to pricing, the Xperia XZ3 arrived at $900. We expect the Xperia XZ4 to come at a similar price.</p>",
            "<p>While it’s not been that long since Sony redesigned the Xperia range, we’re still expecting some small changes in the design of the XZ4 range.</p>",
            "<p>The latest <a href=\"https://www.technobezz.com/sony-xperia-xz4-2019-flagshipss-specifications-now-close-to-official-583695/\">leaks on the display</a> allege the XZ4 will sport a 6.5-inch OLED display running a QHD+ 3360 x 1440 resolution in an ultrawide 21:9 aspect ratio. That’s quite a lot taller than most modern phones, and it could give the XZ4 a serious edge when displaying media content.</p>",
            "<p>Older leaks from case manufacturer <a href=\"https://www.olixar.com/\">Olixar</a> — via retailer <a href=\"https://www.mobilefun.co.uk/sony-xperia/xperia-xz4/cases\">Mobile Fun</a> — are a series of renders which show the Xperia XZ4 in a number of Olixar’s cases. The renders confirm older leaks and show a phone with reduced bezels — including an almost nonexistent bottom bezel — and an extended 21:9 aspect ratio. Three lenses adorn the rear of the phone, and the fingerprint scanner can be found on the edge of the phone. Like the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz3-review/\">Xperia XZ3</a>, there’s no headphone jack.</p>",
            "<p><a href=\"https://www.mysmartprice.com/gear/sony-xperia-xz4/\" rel=\"noopener\">MySmartPrice</a> and Onleaks have also leaked CAD-based renders of the phone, which show the device from all angles. Notably, on the front can be seen a large display that isn’t quite edge-to-edge, but is certainly more so than previous Sony phones. The phone appears to have a 21:9 aspect ratio and MySmartPrice notes that it will have dimensions of 166.9 x 72.4 x 8.2 mm. A leak from Ice Universe, <a href=\"https://m.weibo.cn/detail/4313609813258733\" rel=\"noopener\">taken from Weibo</a>, says the phone will be 8.9mm thick.</p>",
            "<p>Perhaps more interesting than the front of the phone, however, is the back which shows a tri-lens setup. In other words, the Xperia XZ4 could be Sony’s first phone to feature a three-lens camera, which will hopefully open it up to high-quality photography. <a href=\"https://m.weibo.cn/detail/4313609813258733\" rel=\"noopener\">Leaker Ice Universe</a> also mentions the XZ4 having three cameras on the back, and adds the camera will have a large sensor and optical image stabilization.</p>",
            "<p>The phone also doesn’t appear to have a fingerprint sensor on the back. MySmartPrice speculates that the sensor may be embedded in the power button on the side, which <a href=\"https://m.weibo.cn/detail/4313609813258733\" rel=\"noopener\">a leak</a> from Ice Universe also states. Rumors the phone could have an in-display fingerprint sensor seem to have not come to fruition.</p>",
            "<p>We’ll update this article as we hear more about the new Sony Xperia XZ4.</p>",
            "<p><em>Updated on February 1, 2019: Added new details regarding the Xperia XZ4’s potentially record-breaking camera specs.<br>\n</em></p>"
        ]
    },
    {
        "title": "\n\t\tBest smartphones of IFA 2018\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>We’re never quite sure what to expect at <a href=\"https://www.digitaltrends.com/ifa/\">IFA</a> on the smartphone front. Occasionally a big name will release a flagship phone, but the majority of manufacturers seem to use it as a place to unveil lesser mid-range devices or skip it altogether. Samsung has already shown off its wares, Apple and Google are due to do so within the next couple of months, but there were still some smartphones of note on show in Berlin.</p>",
            "<p>The clear headliner at <u><a href=\"https://www.digitaltrends.com/ifa/\">IFA 2018</a></u> was Sony’s new flagship Xperia XZ3. The design is a refinement of the <u><a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz2-review/\">Xperia XZ2</a></u>, which saw Sony belatedly overhaul the old angular, big bezel look in favor of curves front and back. Those bezels are slimmed down slightly further in the XZ3, but it’s the screen that’s exciting as it’s the first OLED that Sony has put in a phone. It’s a gorgeous 6-inch display flanked by front-facing speakers, which makes the XZ3 a great choice for movie watching.</p>",
            "<p>The main, single-lens, 19-megapixel camera is unchanged from the XZ2, but the selfie camera has been bumped up to 13 megapixels. There’s plenty of power here in terms of performance and battery life, there’s support for wireless charging, and it’s IP68-rated. It also runs <u><a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a></u> out of the box. All in all, it’s a stylish smartphone with plenty of high notes, but the $900 price tag might prove hard to swallow.</p>",
            "<p style=\"text-align: center;\"><strong>Read our <u><a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz3-review/\">Sony Xperia XZ3 hands-on review</a></u> to learn more.</strong></p>",
            "<p>Keen to make it clear its back is business after a <u><a href=\"https://www.digitaltrends.com/mobile/commerce-bans-zte-from-exporting-technology-from-the-us/\">highly</a><a href=\"https://www.digitaltrends.com/mobile/commerce-bans-zte-from-exporting-technology-from-the-us/\">–</a><a href=\"https://www.digitaltrends.com/mobile/commerce-bans-zte-from-exporting-technology-from-the-us/\">publicized U.S. ban</a></u>, ZTE decided a new flagship smartphone was the best way to do it. This is ZTE’s follow-up to the ZTE Axon 7 – there was no 8. It jumps on the notch bandwagon with a 6.21-inch AMOLED display that ZTE promises is packed with TV smarts to help it optimize video.</p>",
            "<p>It has a Snapdragon 845 inside with 6GB of RAM, 128GB of storage, and a big 4,000mAh battery. There’s also a 20-megapixel front-facing camera with face unlock software and the main camera pairs 20-megapixel and 12-megapixel lenses. There’s little prospect of the Axon 9 Pro being sold in the U.S. but it is coming to Europe for 649 euros (around $750).</p>",
            "<p style=\"text-align: center;\"><strong>Find out more our <u><a href=\"https://www.digitaltrends.com/cell-phone-reviews/zte-axon-9-pro-review/\">ZTE Axon 9 Pro hands-on review</a></u>.</strong></p>",
            "<p>This svelte smartphone sports a 6.3-inch notched screen with a 2,340 x 1,080 resolution. There’s a Kirin 710 processor inside backed by 4GB of RAM. There’s a dual front-facing camera with lenses rated at 24 megapixels and 2 megapixels for perfect portrait selfies. You’ll find a similar combination in the main camera with 20 megapixels and 2 megapixels, though the aperture is wider for better low-light performance.</p>",
            "<p>It shows off Huawei’s skill at turning out desirable mid-range phones, and it’s a perfect teaser for Huawei’s main event – the <u><a href=\"https://www.digitaltrends.com/mobile/huawei-mate20-news/\">Mate 20 Pro</a></u> – which lands in October. The price is 380 British Pounds, which is just under $500.</p>",
            "<p style=\"text-align: center;\"><strong>Read our <u><a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-mate-20-lite-review/\">Huawei Mate 20 Lite hands-on</a></u> for more.</strong></p>",
            "<p>If you look beyond yet another notch-toting, derivative design, there’s a real bargain to be found here. For 280 British Pounds or 330 euros – there’s no U.S. release on the cards — you can snag a 6.3-inch screen, the Kirin 970 processor, and 4GB RAM. It has been built with gaming in mind, so there’s a grippy rear and something Honor calls GPU Turbo enhancements which boost frame rate and graphical quality.</p>",
            "<p>The camera features a single 16-megapixel, f/2.0 aperture lens with a secondary, f/2.4 aperture depth-sensing 2-megapixel sensor and there are some A.I. smarts in there for automatic object and scene recognition. You’ll find Huawei’s EMUI version 8.2 installed over the top of Android 8.1. There’s also a decent-sized 3,750mAh battery.</p>",
            "<p style=\"text-align: center;\"><strong>Find out more in our <u><a href=\"https://www.digitaltrends.com/cell-phone-reviews/honor-play-review/\">full Honor Play review</a></u>.</strong></p>",
            "<p>We weren’t sure what to expect from LG this year, but the stripped back LG G7 One was a surprise. This stock Android phone is part of the Android One program and it’s a step down from the flagship G7 ThinQ. It looks pretty similar, with a 6.1-inch notched display and the same build materials, but inside you’ll find last year’s Snapdragon 835, with 4GB of RAM, and just 32GB of onboard storage. It also has a single-lens 16-megapixel camera, but we’re not sure about the price just yet.</p>",
            "<p>The LG G7 Fit is another step down, with the two-year old Snapdragon 821 onboard, so presumably it will come in even cheaper.</p>",
            "<p style=\"text-align: center;\"><strong>Read more about the <u><a href=\"https://www.digitaltrends.com/mobile/lg-g7-one-and-g7-fit-news/\">LG G7 One and Fit</a></u>.</strong></p>",
            "<p>While it won’t be coming to the U.S., the U12 Life will be a tempting, affordable option where it’s available. Ostensibly a scaled back <u><a href=\"https://www.digitaltrends.com/cell-phone-reviews/htc-u12-plus-review/\">HTC U12 Plus</a></u>, the U12 Life actually has a couple of advantages in the shape of proper buttons – we didn’t like the digital buttons in the U12 Plus – and a headphone jack. It also boasts a 6-inch display, a mid-range Snapdragon 636 processor and choice of 4GB of RAM and 64GB of storage or 6GB of RAM and 128GB of storage.</p>",
            "<p>Rounding out a decent package, we find a fairly big, 3,600mAh battery, and a 16-megapixel camera. All this can be yours for 300 British Pounds, which is about $390 right now.</p>",
            "<p style=\"text-align: center;\"><strong>Find out more about the <u><a href=\"https://www.digitaltrends.com/mobile/htc-u12-life-news/\">HTC U12 Life</a></u>.</strong></p>",
            "<p>If you’re craving some keyboard action, but the <u><a href=\"https://www.digitaltrends.com/cell-phone-reviews/blackberry-key2-review/\">BlackBerry Key2</a></u> was out of your price range, then perhaps the Key2 LE is for you. It packs many of the same features, including the full QWERTY keyboard, into a cheaper, polycarbonate body with a Qualcomm Snapdragon 636 processor and 4GB of RAM inside. There’s a conservative slate finish and a champagne gold and blue, but it was the atomic red that caught our eye.</p>",
            "<p>There’s 32GB of internal storage with a MicroSD card slot for more. The dual camera pairs a 13-megapixel lens with a 5-megapixel lens, but the front-facing camera is still rated at 8-megapixels. The battery has also dropped to 3,000mAh. All this cutting back has dropped the price by around $250, so it will cost 350 British Pounds in the U.K. and 400 euros in Europe when it launches in September. It will probably be around $400 when it launches in the U.S.</p>",
            "<p style=\"text-align: center;\"><strong>Read our <u><a href=\"https://www.digitaltrends.com/cell-phone-reviews/blackberry-key2-le-review/\">BlackBerry Key2 LE hands-on</a></u>.</strong></p>"
        ]
    },
    {
        "title": "\n\t\tThe best Xperia XZ3 cases to keep your new Sony phone shiny\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Sony might not dominate the mobile landscape in the way that <a href=\"https://www.digitaltrends.com/mobile/debating-between-apple-and-samsung-phones-open-your-eyes-a-little-wider/\">Samsung and Apple do</a>, but it’s still putting out great smartphones with lots to offer. The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz3-review/\">Xperia XZ3</a> is the latest of these, and it’s equipped with powerful specs, a capable single-lens camera, a great display, and all the other fun features Xperia phones are known for.</p>",
            "<p>It’s also got a pretty design — but like many phones in 2018, it’s made from glass. Glass might be the go-to premium material of the moment, but it’s also fragile and capable of shattering when dropped. If you’ve just forked out $900 for a phone, the last thing you want to see is a shattered corner or broken glass back. But don’t wrap your phone in cotton — try a protective case instead. We’ve found you some of the best Sony Xperia XZ3 cases so you can keep your phone safe.</p>",
            "<p>You don’t have to sacrifice your phone’s style in order to get some protection. Clear gel is one of the classic types of case, and if you’re looking to get your hands on one, then you might be interested in this example from Olixar. It’s made from soft and flexible TPU, which is naturally nonabsorbent and grippy. It’s also very thin, adding barely any additional thickness onto your Xperia XZ3. There’s also a raised bezel around the edges of the case, which keeps your device from resting on surfaces. It won’t be as protective as a larger and bulkier case, but it will still provide a good level of all-around protection.</p>",
            "<p style=\"text-align: center;\"><strong></strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/d2f271f9d0ec558f5ba7d7bb995089f7e10579f9/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Olixar\">Olixar</a> <a href=\"https://www.digitaltrends.com/go/5aea219a6a48b7bd0ce4b7e9ddf79bf8d4f055c1/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a> <a href=\"https://www.digitaltrends.com/go/d9e96867a54953a5a92e113465bc60ed5436fa8c/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Mobile Fun\">Mobile Fun</a></p>",
            "<p>Looking for something on the harder side? Hard shells won’t provide the same level of shock-absorption, but they’ll do great work in turning aside more direct threats against your phone. This shell from Roxfit features a soft touch coating, which increases grip on the case and makes it feel more comfortable in the hand, while retaining the strength of the polycarbonate underneath. Roxfit is Sony’s certified accessory partner, so you can be sure of a great fit and quality. However, because it doesn’t flex, you won’t find any button covers here, leaving the sides of your phone exposed.</p>",
            "<p style=\"text-align: center;\"><strong></strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/3a735d58556c7b7c2a78d4d8d899ddfedbe23b74/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Roxfit\">Roxfit</a> <a href=\"https://www.digitaltrends.com/go/e7918c6bc5a30e482ea6f233e305c7f84b9d6e14/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Mobile Fun\">Mobile Fun</a></p>",
            "<p>Another clear option, this bumper case from Everstars comes with more protection than a simple gel case. It’s made from a combination of a TPU bumper and a polycarbonate (PC) backplate, which work together to provide great protection against a variety of threats. The TPU bumper offers a soft surface for increased grip, while the inside of the bumper contains an impact gel that provides military-grade protection, according to Everstars. While we can’t back that up, we can say that it’s light and not too thick, and also well-priced. Anyone looking for slightly more protection than usual might find a bargain here.</p>",
            "<p style=\"text-align: center;\"><strong></strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/9d921e9d0d9a94f95c8fb0bfb23f33044a386183/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>The Xperia XZ3 is already a stylish phone, but you can choose to add even more style to it by slapping on this leather wallet case from Krusell. You’ll find genuine Sunne leather on the outside of the case that will mature as the case ages. Your Xperia XZ3 clips into the internal shell, which holds it carefully in place, while the leather wraps fully around your device to provide complete coverage. The cover folds back to form a horizontal stand, and there are four internal slots included for easy stashing of cards or cash. On the minus side, it’s certainly expensive — but for genuine leather, it’s about what you’d expect.</p>",
            "<p style=\"text-align: center;\"><strong></strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/07231a60d3a44177d00b85270749789e87740cf2/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Krusell\">Krusell</a> <a href=\"https://www.digitaltrends.com/go/c6ee07e49ffaba231a044fdbe5a965a8c68181a3/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Mobile Fun\">Mobile Fun</a></p>",
            "<p>If you’re looking for the perfect case, why go to anyone but Sony itself? Sony offers a decent variety of official cases to go with the Xperia XZ3, but the Touch Cover is one of the best. The case offers full coverage, including a cover to keep your display protected while not in use. The front cover is completely transparent, and it’s touch-enabled, so you can use your XZ3 without ever flipping the cover off your case. It’s a good-looking case too, available in a variety of colors. An internal microfiber suede prevents internal scratching. It’s expensive, but it’s stylish, protective, and super-cool.</p>",
            "<p style=\"text-align: center;\"><strong></strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/1923d5dc0bb465e1750673a396dd474a75f373b5/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Mobile Fun\">Mobile Fun</a></p>"
        ]
    },
    {
        "title": "\n\t\tXperia XZ1 vs. Xperia XZ2: Sony’s new phone looks great, but can it compete?\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>Sony has turned a new page in its smartphone history. The company has finally taken the wraps off its latest and greatest smartphone, the Xperia XZ2. The phone features an all-new Sony design, top-of-the-line hardware under the hood, and some awesome camera features that we’ve come to expect from a flagship Sony smartphone.</p>",
            "<p>But just because there’s a new Sony flagship, that doesn’t mean we should forget entirely about the previous Xperia XZ1. How do the two phones compare? We put them head to head to find out.</p>",
            "<p>Both of these phones feature some pretty top-tier specs, though the Xperia XZ1’s specs are slightly dated compared to the new new Xperia XZ2. For example, while the XZ1 features the Qualcomm Snapdragon 835 processor, the XZ2 boasts the Qualcomm Snapdragon 845. Both phones offer 4GB of RAM, along with 64GB of storage — and they both offer a MicroSD card slot to expand upon that storage.</p>",
            "<p>It’s pretty clear who the winner is, but that may not matter to everyone. The Snapdragon 835 is still an excellent chipset — it’s just not quite as good as the Snapdragon 845.</p>",
            "<p><strong>Winner: Sony Xperia XZ2</strong></p>",
            "<p>Sony has long been criticized for its angular phones with sharper corners, but it looks like the company is finally changing that with the Xperia XZ2. The phone does look somewhat similar to previous Sony phones, but it features more rounded corners and an overall much more modern look. The device is covered largely in Gorilla Glass 5, which is partly why it offers wireless charging. On the back, you’ll find a fingerprint sensor and large camera sensor.</p>",
            "<p>The Xperia XZ1 features Sony’s older design style, with sharper corners. We’re not huge fans of the look of the phone — though obviously how it looks doesn’t necessarily impact how it performs. On the back of the phone you’ll find a camera sensor, which is found in the top left-hand corner, and that’s about it.</p>",
            "<p>Both phones offer some durability features too. They both boast IP68 water-resistance, but the XZ1 is largely built from metal, while the XZ2 features glass. In other words, the XZ1 may be a little more durable than the newer device.</p>",
            "<p>When it comes to the display, the Xperia XZ1 features a 5.2-inch LCD display with a resolution of 1920 x 1080 pixels. The Xperia XZ2 changes things a bit with an aspect ratio of 18:9, but the resolution hasn’t changed all that much. Because of the changed aspect ratio, the resolution sits in at 2160 x 1080 pixels, and, since the display is larger, the pixel density is a little lower on the XZ2.</p>",
            "<p>Still, the Xperia XZ2 simply looks better, and we like the 18:9 aspect ratio. It’s the clear winner here.</p>",
            "<p><strong>Winner: Sony Xperia XZ2</strong></p>",
            "<p>Sony always tries to put top-tier cameras in its phones, though often it ends up developing cameras with lots of bells and whistles — but that lack a little in image quality.</p>",
            "<p>Let’s start with raw specs. On the Xperia XZ1, you can expect a 19-megapixel rear-facing camera with an aperture of f/2.0, electronic image stabilization, predictive phase detection, and laser autofocus. The Xperia XZ2 also features a very similar sounding 19-megapixel sensor. One difference, however, is that the newer device can capture 1,080p video at 960 frames per second — while the older device can only capture 720p footage at 960 frames. The trade-off is that the newer phone can only record at such a high framerate for three seconds, compared to the XZ1’s six seconds in 720p.</p>",
            "<p>On the front, the new camera has a 5-megapixel sensor, while the XZ1 has a 13-megapixel sensor on the front.</p>",
            "<p>Until we get some time to test the XZ2 out in the wild and compare, we’ll call this a tie.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The battery in the XZ1 comes in at 2,700mAh, while the newer XZ2 offers a 3,180mAh battery. Because of the larger display, it’s possible that the larger battery won’t necessarily equate to a longer battery life. Still, it is nice to see — and means that it should at least last a similar amount of time.</p>",
            "<p>Both phones feature a USB-C port, and they both offer Quick Charge, so you’ll be able to juice your phones up nice and quickly. There’s one feature that the Xperia XZ2 offers that the Xperia XZ1 does not: Wireless charging.</p>",
            "<p>Between the wireless charging and the extra battery capacity, we’re awarding this one to the Xperia XZ2.</p>",
            "<p><strong>Winner: Sony Xperia XZ2</strong></p>",
            "<p>Both the Xperia XZ2 and the Xperia XZ1 feature Android, and the XZ1 has been updated to Android 8.0 — so for now, they should offer a very similar experience. Still, that doesn’t mean that they always will — the XZ2 will likely be supported by Sony for longer, so it’ll be updated to a later version of Android than the XZ1 will. We don’t know that for sure — Sony hasn’t announced how long it intends to support either phone, but we think it’s a pretty safe assumption to make.</p>",
            "<p>Sony has been working to improve the software it offers on its phones, while distinguishing it from other Android devices. The software is generally smooth, though there are some tweaks that die-hard Android fans may not appreciate.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The Sony Xperia XZ1 has been available for some time now, and as such it’s not too hard to get for yourself. The device is available, for example, straight from Amazon for a little under $500, which isn’t bad at all.</p>",
            "<p>The Xperia XZ2, on the other hand, isn’t available just yet. Sony says it’ll be releasing the phone to the public in “late spring,” but it hasn’t disclosed the price of the phone.</p>",
            "<p>Still, we can assume that it’ll be more expensive than the Xperia XZ1. Because of that, and the fact that the Xperia XZ1 is currently far more available, it’s the winner.</p>",
            "<p><strong>Winner: Sony Xperia XZ1</strong></p>",
            "<p>Did you think old would beat new? The Sony Xperia XZ2 not only offers improved specs and new features like wireless charging, but it also boasts a seriously improved design style, which we hope Sony continues to refine and tweak. The Sony Xperia XZ2 is clearly the way to go if you’re torn between these two phones.</p>"
        ]
    },
    {
        "title": "\n\t\tThe Sony Xperia XZ3: Everything you need to know\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>If you’re a die-hard Sony Xperia fan then few times of the year are more exciting than the release of a new Xperia XZ phone. It’s finally that time of year again, and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz3-review/\">Sony Xperia XZ3</a> is available now. With an all-new OLED display, super-tough aluminum frame, and Android 9.0 Pie included from launch, it’s a great time to be part of Sony’s Xperia party. Here’s everything you need to know about the <a href=\"https://www.sonymobile.com/us/products/phones/xperia-xz3/\">Sony Xperia XZ3</a>.</p>",
            "<p>Sony’s smartphones have always had a unique style, and you’d usually be hard-pressed to mistake them for another brand’s phones. At first glance, the Xperia XZ3 looks extremely similar to last year’s <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz2-review/\">Xperia XZ2</a>, but the Xperia XZ3 is packing some subtle changes that make the design its own.</p>",
            "<p>There are more curves than last year’s phone, and the corners of the display curve gently around, contrasting with the right-angled screens on the Xperia XZ2 and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz2-premium-review/\">XZ2 Premium</a>. Sony is also taking the bezel-less look more seriously on the XZ3. The bezels around the sides of the display have been slimmed down even more, with the phone now curving into the frame. The forehead and chin, while still fairly chunky by today’s standards, have also seen some shrinkage. Flip it over though, and it’s much the same as the Xperia XZ2, with a single camera lens and rear-mounted fingerprint sensor.</p>",
            "<p>The XZ3’s body is made from aluminum sandwiched between two sheets of Gorilla Glass 5, enabling wireless charging and ensuring smooth cellular connection. The aluminum is also an all-new 7000-series aluminum alloy, a material that Sony claims is one of the highest-strength aluminum-alloys available. The XZ3 is also IP68-rated for water and dust resistance, so it can survive an accidental dunk in the pool or a slip into a puddle.</p>",
            "<p>But it’s the new display that’s the real innovation here. The Xperia XZ3 is packing a huge 6-inch HDR OLED display running a 2,880 x 1,440 Quad HD resolution in an 18:9 aspect ratio. This is Sony’s first ever OLED smartphone display, and it’s likely to be an absolute stunner. It’s running Sony’s well-known Bravia TV technology and displays incredibly vivid colors and absolute blacks in the way that only an OLED display can. It’s also equipped with Sony’s X-Reality and <span class=\"fontstyle0\">Triluminos display</span>, and comes with full HDR support.</p>",
            "<p>It’s not just the screen that’s seen a size increase. The Xperia XZ2’s speakers were a disappointment, so Sony’s boosted the XZ3’s speaker size by 20 percent to combat that criticism. This change, as well as the usual inclusion of Hi-Res audio and <a href=\"https://blogs.sonymobile.com/2016/03/15/behind-the-acronym-dsee-hx-with-audio-engineer-kenichi-matsumoto/\">DSEE-HX support</a>, should make the XZ3 a stronger phone for audio.</p>",
            "<p>You’ll find a USB-C port down below, and there’s no headphone jack, much like the Xperia XZ2.</p>",
            "<p>The Xperia XZ3 is a 2018 flagship phone, and as a flagship phone, you expect it to showcase the very best the mobile world has to offer. The Xperia XZ3 doesn’t disappoint in that area, delivering solid specs.</p>",
            "<p>The Xperia XZ3 comes with the Qualcomm Snapdragon 845, the powerful chip that’s powered many of this generation’s most powerful phones, including the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Samsung Galaxy Note 9</a>, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/lg-g7-thinq-review/\">LG G7 ThinQ</a>, and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/oneplus-6-review/\">OnePlus 6</a>. Paired with 4GB of RAM, we’re expecting strong and smooth performance from the Xperia XZ3. You get 64GB of storage as standard, with the option of installing up to 512GB of additional storage with a MicroSD card.</p>",
            "<p>Backing up this power is a 3,330mAh battery which should last you the day, thanks to the power efficient OLED display and Snapdragon 845 processor. It comes with USB-C fast charging and wireless charging capabilities.</p>",
            "<p>Here’s some extremely welcome news — the Sony Xperia XZ3 comes with Android’s latest and greatest: <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a>. The XZ3 was one of the first non-Google phones to <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">feature the latest operating system</a> (having been narrowly beaten by the Essential Phone). That means you can expect all the latest fun additions to Android, including a <a href=\"https://www.digitaltrends.com/mobile/how-to-use-android-9-pie-gesture-navigation/\">new navigation system</a>, <a href=\"https://www.digitaltrends.com/mobile/how-to-use-google-digital-wellbeing-android-9-pie/\">Digital Wellbeing</a>, and <a href=\"https://www.digitaltrends.com/mobile/best-and-worst-features-android-9-pie/\">more</a>. Expect the XZ3 to be supported for at least two Android operating systems (so <a href=\"https://www.digitaltrends.com/mobile/possible-android-q-names/\">Android Q</a> and Android R), and for them to come fairly quickly.</p>",
            "<p>Aside from Android 9.0 Pie, you can also expect some other special features crammed into the phone. It comes with <a href=\"https://www.playstation.com/en-gb/explore/ps4/features/remote-play/\">PlayStation 4 Remote Play</a>, and a new one-handed UI feature called Side Sense that will allow you to access certain apps and features just by tapping the side of the phone. It sounds like a gimmick, but like the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-review/\">Pixel 2</a>‘s Active Edge, this could end up being a commonly used feature.</p>",
            "<p>With the release of the dual-camera Xperia XZ2 Premium, many might have assumed that Sony would finally make the leap into dual-lens on the XZ3 — but it’s not to be, and the Xperia XZ3 comes with a single lens mounted to the back of the phone.</p>",
            "<p>But don’t be put off by that — it’s a 19-megapixel Motion Eye monster, equipped with Sony’s latest sensor improvements. It’s capable of recording video in 4K HDR, as well as super-slow-motion video at 960 frames per second in 1080p HD. The camera app has also been streamlined, making it easy to swap between video and photo modes, and adding Google Lens support.</p>",
            "<p>The front-facing camera has also seen some upgrades. It’s now a 13-megapixel lens with an f/1.9 aperture, so it’ll let in even more light. Your selfies will look even better thanks to simultaneous beauty and portrait modes that preview in real-time — so you’ll always know how your next shot will turn out.</p>",
            "<p>The Sony Xperia XZ3 costs $900 and is available in the U.S. from Best Buy and <a href=\"https://www.digitaltrends.com/go/cfb685b7e84a093431bd48b8aac38783d8905d5d/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a> now.</p>",
            "<p><i>Updated on October 18: The Sony Xperia XZ3 is now available.<br>\n</i></p>"
        ]
    },
    {
        "title": "\n\t\tApple iPhone XS vs. Sony Xperia XZ3: Which is the best phone for you?\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>Sony and Apple have a long history of turning out great consumer electronics, but Japanese manufacturer Sony has struggled to gain a foothold in the smartphone market, while its American competitor has dominated. With both companies just releasing new flagship phones, we decided to compare the best each has to offer.</p>",
            "<p>Apple’s newly unveiled flagship is the iPhone XS, which comes hot of the heels of Sony’s latest contender, the Xperia XZ3. They’re both attractive, powerful, and expensive, but which is best? Let’s take a closer look.</p>",
            "<p>Apple has hit a new high thanks to the performance of its A12 Bionic processor. This chip is incredibly fast, offering tangible improvements in terms of speed when compared with its predecessor in the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a>. Apple has also equipped the XS with 4GB of RAM. Based on our early impressions and the benchmarks that are emerging, the iPhone XS could be the most powerful phone on the market right now. You can pick up the iPhone XS with 64GB, 256GB, or 512GB of storage.</p>",
            "<p>Sony has put the capable Snapdragon 845 processor in the Xperia XZ3, backed by 4GB of RAM. It’s speedy, slick, and plenty powerful for most people, but it can’t keep up with the iPhone XS. The Xperia XZ3 comes with 64GB of storage, but there is a MicroSD card slot for expansion up to 512GB.</p>",
            "<p>On paper, the Xperia XZ3 wins the battery contest with a 3,300mAh capacity. The iPhone XS has a 2,658mAh battery inside. We strongly suspect both will require daily charging. You can fast charge the Xperia XZ3, with the charger supplied, but if you want to fast charge the iPhone XS, you’ll have to buy a fast charger and cable separately. Both these phones support Qi wireless charging.</p>",
            "<p><strong>Winner: Apple iPhone XS</strong></p>",
            "<p>Sony overhauled its dated design with the XZ2, introducing “Ambient Flow,” a design language that continues with the XZ3. It’s all about curves. with rounded corners and a curved glass back that sits very comfortably in the hand. The display even curves into the metal frame at the edges, helping to make the device feel thinner than it is. There are still sizable bezels top and bottom of the screen — and we really dislike the fingerprint sensor placement on the back because it’s simply too low.</p>",
            "<p>Apple also overhauled its dated design last year with the iPhone X, introducing an edge-to-edge display with a notch at the top that houses the new camera module and supports secure face unlock. This was a necessity as Apple ditched the old home button and decided to drop the fingerprint sensor altogether. The iPhone XS is identical to its predecessor. The back is glass and there’s a steel frame, but there are no curves like you’ll find on the Xperia XZ3. Apple’s phone is smaller in every direction and a good bit lighter.</p>",
            "<p>Both phones will be prone to cracks and scratches because of all that glass, but they are water-resistant. The IP68 rating allows them to be submerged for up to half an hour in up to 2 meters of water. The Xperia XZ3 has an additional IP65 rating, which covers jets of water from any direction.</p>",
            "<p><strong>Winner: Apple iPhone XS</strong></p>",
            "<p>We’re excited to see Sony adopting OLED in its smartphones for the first time with the Xperia XZ3, something Apple did with the iPhone X last year. The XZ3 has a 6-inch OLED that looks absolutely gorgeous. It boasts a 2,880 x 1,440-pixel resolution, which makes it very sharp indeed at 537 pixels-per-inch (ppi). It’s easily the best display we’ve seen in a Sony phone and the company has drafted its TV division to add picture processing smarts.</p>",
            "<p>Apple’s iPhone XS has a 5.8-inch OLED with a resolution of 2,436 x 1,125 pixels, which translates to 458 ppi. It’s an excellent screen that’s a joy to read on, play games on, or watch movies on. Both the displays support HDR 10 and Dolby Vision. We need to spend a bit more time with these devices to determine which display is better, so this is a tie for now. Suffice it to say both are extremely good.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>As many manufacturers look to add more lenses to their cameras, we were surprised by Sony’s decision to go with a single 19-megapixel sensor in the main camera of the XZ3. It’s not that dual-lens cameras are always better — our <a href=\"https://www.digitaltrends.com/mobile/best-camera-phones/\">favorite phone camera</a> over the last year has been the single-lens Pixel 2 — but Sony did employ a dual-lens camera in the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz2-premium-review/\">XZ2 Premium</a>. In any case, Sony has nailed camera hardware, but often falls down in the software department, and we found the XZ2 Premium struggled to compete with phones like the iPhone X and Galaxy Note 9.</p>",
            "<p>With the same dual 12-megapixel lens setup as the iPhone X, but with a newer sensor and enhanced software, the iPhone XS looks to be a great performer. Apple has also added the ability to adjust the background blur after taking a portrait shot. There’s also support for Smart HDR, which combines frames to edit out exposure problems and create the best image every time.</p>",
            "<p>Sony’s front-facing camera is rated at 13-megapixels while Apple’s is the 7-megapixel TrueDepth camera, which can also securely unlock your phone by scanning your face and map Animojis so they’re animated along with you. Both phones can record slow-motion video, though only the Xperia XZ3 can do super slow motion.</p>",
            "<p><strong>Winner: Apple iPhone XS</strong></p>",
            "<p><a href=\"https://www.digitaltrends.com/mobile/android-vs-ios/\">Android or iOS</a> is down to personal preference nowadays as, both are accessible, slick operating systems with all the features you need. We’re pleased to see that the Xperia XZ3 ships with <a href=\"https://www.digitaltrends.com/mobile/android-9-pie-review/\">Android 9.0 Pie</a> on board, though there is a Sony user interface and some bloatware on top. This category is an easy win for Apple because it always updates its iPhones in a timely manner and they continue to get new versions of iOS for many years after release.</p>",
            "<p><strong>Winner: Apple iPhone XS</strong></p>",
            "<p>If you’re a gamer with a PlayStation 4, then the <a href=\"https://www.sonymobile.com/us/apps-services/remote-play/\" target=\"_blank\" rel=\"noopener\">PS Remote Play</a> support in the Xperia XZ3 might interest you, as it allows you to stream games on your phone. Sony also includes the 3D Creator app, which allows you to scan yourself and create a 3D avatar. There’s also Side Sense, so you can tap the side of your Xperia XZ3 to open a shortcuts menu, and Smart Launch for the camera, which will launch the camera when you hold your XZ3 up in landscape view as though you want to take a photo.</p>",
            "<p>Apple’s iPhone XS has the aforementioned TrueDepth camera for secure face unlocking that even works in low light, and Memojis have joined Animojis for messaging fun.</p>",
            "<p><strong>Winner: Sony Xperia XZ3</strong></p>",
            "<p>Neither Apple or Sony are known for reasonable pricing, so it won’t shock you to learn that these smartphones are expensive. The 64GB model of the iPhone XS will cost you $1,000, while the Xperia XZ3 is a touch cheaper at $900. You can pick up the iPhone from all the major carriers, but you’ll have to buy the XZ3 unlocked, and it won’t work with Verizon or Sprint.</p>",
            "<p>With unrivaled performance, a modern design, and a great camera, the <a href=\"https://www.digitaltrends.com/go/2869ef7e2bd2c6fba910a15a53acc25bb8e3405e/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Apple\">iPhone XS</a> is an attractive prospect whatever way you look at it. The <a href=\"https://www.digitaltrends.com/go/54c40c3ecbf3641f5a6fa2335f94ffd152b278da/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Sony Xperia XZ3</a> has its own high points and is probably the better pick for Android fans, but even the $100 price difference isn’t enough to paper over the areas where the XZ3 falls short. If we could only go home with one of these phones, it would have to be the iPhone XS.</p>"
        ]
    },
    {
        "title": "\n\t\tSony Xperia XZ3 vs. Galaxy Note 9: Can Sony topple Samsung’s giant?\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Sony’s new <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz3-review/\">Xperia XZ3</a> has been revealed, and it boasts everything that made the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz2-review/\">Xperia XZ2</a> a great phone — along with a few beneficial changes and Sony’s first-ever OLED smartphone display. Are these small tweaks enough to make the <a href=\"https://www.sonymobile.com/us/products/phones/xperia-xz3/\">Xperia XZ3</a> a contender against one of the biggest flagship phones of 2018? To see whether the Xperia XZ3 can hold its own against the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Galaxy Note 9</a>, we put the two phones head-to-head in a series of comparisons to decide which of these two amazing devices should be your next phone.</p>",
            "<p>Going by the numbers, the Note 9 has a slight edge on the XZ3 in terms of pure performance. Both phones are equipped with the powerful <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a> — but the <a href=\"https://www.digitaltrends.com/mobile/favorite-features-on-the-samsung-galaxy-note-9/\">Note 9’s water-cooling system</a> should mean that it can push harder and for longer, without as much risk of overheating. The Note 9 also has more RAM, with 6GB and 8GB options dwarfing the XZ3’s 4GB. To be fair, you’re unlikely to notice these differences in real-life use — but it’s clear that the Note 9 is the objectively more powerful phone.</p>",
            "<p>Storage options paint a similarly one-sided story. The Note 9’s 128GB model has twice the storage of the XZ3’s 64GB — and that’s without mentioning the ludicrously roomy Note 9 model with 512GB of storage. However, both have support for MicroSD cards up to 512GB in size, making it unlikely users of either phone will run out of storage quickly.</p>",
            "<p>The winner isn’t as clear in battery life and charging. The Note 9 comes with a massive 4,000mAh battery that comfortably lasts a day — and while the 3,330mAh battery in the XZ3 is clearly smaller, it should also easily see you through a day’s use, putting these two phones in similar positions. Both have Qi wireless charging available, which is convenient, but the XZ3’s quick charging tops the Note 9’s with support for QuickCharge 3.0.</p>",
            "<p>While the XZ3 claws back some points with speedy charging, it’s clear Samsung’s titan is the more powerful phone.</p>",
            "<p><strong>Winner: Samsung Galaxy Note 9<br>\n</strong></p>",
            "<p>Consumers in 2018 demands beautiful flagships, and neither phone lets us down in that regard. The XZ3 and the Note 9 are both desirable glass phones with aluminum frames, and curves that gently wrap around their bodies. However, the XZ3’s bezels aren’t as slim as the Note 9’s, and Sony’s Ambient Flow design has yet to catch up fully with the sleek and slick Samsung flagship range. If you’re still rocking your old wired headphones, it’s important to note that only the Note 9 is equipped with a headphone jack.</p>",
            "<p>In terms of durability, you’re likely to want a case for the XZ3 and <a href=\"https://www.digitaltrends.com/mobile/best-samsung-galaxy-note-9-cases/\">the Note 9</a> — glass is fragile and can be slippery, so the added protection and grip will be a must for some. These phones are otherwise well-protected, with IP68 ratings against water immersion and dust. The XZ3 goes a step further with an IP65 rating as well — giving it protection from jets of water from any direction, as well as full immersion protection.</p>",
            "<p>Style and beauty are subjective — but we think the majority of people would agree the Note 9 is the prettier of these two. While the XZ3 gets points for its IP65 rating, the headphone jack on the Note 9 seals the deal.</p>",
            "<p><strong>Winner: Samsung Galaxy Note 9<br>\n</strong></p>",
            "<p>Sony has been using LCD screens in its Xperia phones for years — so it’s a pretty big deal that the XZ3 now comes with the more advanced OLED display technology. It’s a beautiful screen, with inky blacks and deep, vibrant colors — it’s the most beautiful display we’ve ever seen on an Xperia phone.</p>",
            "<p>But can it beat the Note 9’s Super AMOLED display? DisplayMate named the Note 9’s display as <a href=\"http://www.displaymate.com/Galaxy_Note9_ShootOut_44N9.htm\">the best it had ever tested</a>, and using it makes it easy to see why. It’s exceptionally sharp, and the color reproduction is nearly perfect — as is the deepness of blacks.</p>",
            "<p>The Note 9 has one of the best displays around, and we’re not sure the Xperia XZ3 can beat it. If it turns out the XZ3’s screen outperforms the Note 9’s after further testing, we’ll change this verdict — but until then, the Galaxy Note 9 wins.</p>",
            "<p><strong>Winner: Samsung Galaxy Note 9<br>\n</strong></p>",
            "<p>It’s bad news for anyone hoping Sony would carry on the dual-lens camera seen on the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz2-premium-review/\">Xperia XZ2 Premium</a> — the XZ3 is equipped with just a single rear-facing lens. It’s very similar to the camera lens from the XZ2 — a 19-megapixel camera that provided good shots, but sometimes struggled with exposure. It wasn’t as good as the XZ2 Premium’s dual-lens set-up, and therefore isn’t as strong as the dual 12-megapixel lens setup on the Note 9.</p>",
            "<p>There’s a 13-megapixel lens around the front of the XZ3 though, and it’s likely that this monster of a front-facing lens will be the match of the Note 9’s 8-megapixel selfie shooter. Video is a closer race too. Both phones have support for 4K recording, as well as super slow motion video at 960 frames per second — but the XZ3 can record super slow motion video at 1080p, beating the Note 9’s 720p.</p>",
            "<p>But it’s too little, too late. It’s still early days for the XZ3, but the Samsung Galaxy Note 9 has the clearly superior camera. We haven’t even mentioned the Note 9’s <a href=\"https://www.digitaltrends.com/photography/what-is-variable-aperture-samsung-galaxy-s9/\">variable aperture</a> or A.I.-driven scene optimization — because we didn’t have to. The Note 9 runs away with this.</p>",
            "<p><strong>Winner: Samsung Galaxy Note 9<br>\n</strong></p>",
            "<p>You’ll find fairly heavily altered versions of Android on both of these phones. Samsung uses the Samsung Experience UI on its phones, and while it’s much better than the old TouchWiz UI, it’s pretty far from stock Android. Purists won’t have any more luck with the Xperia XZ3 though, as Sony uses its own custom UI and adds a lot of additional bloatware.</p>",
            "<p>However, the XZ3 has a serious advantage by being one of the earliest phones to adopt <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a>. Samsung’s update record isn’t as solid as Sony’s, and we suspect it’ll be months before Samsung upgrades the <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">Note 9 to Android Pie</a>. You can probably expect to get a quicker update to <a href=\"https://www.digitaltrends.com/mobile/possible-android-q-names/\">Android Q</a> from Sony’s phone as well, making the XZ3 the phone to get if you love sampling the latest Android treats soon after launch.</p>",
            "<p><strong>Winner: Sony Xperia XZ3<br>\n</strong></p>",
            "<p>You either love or hate the special features on the Xperia XZ3, as a lot of them are fairly niche. There’s the usual Xperia shoes-ins — <a href=\"https://www.sonymobile.com/us/apps-services/remote-play/\">PS Remote Play</a> for PlayStation 4 remote streaming, and the <a href=\"https://www.sonymobile.com/gb/apps-services/3d-creator/\">3D Creator</a> app. But the XZ3 has also seen some new and useful additions. Users can use Side Sense to bring up a menu with a single tap, and Smart Launch launches the camera app when the device is put into landscape mode.</p>",
            "<p>But the XZ3’s options pale in comparison to the Galaxy Note 9’s vast plethora of tools. The S Pen in particular has seen <a href=\"https://www.digitaltrends.com/mobile/all-the-s-pen-features-on-the-galaxy-note-9/\">some serious improvements</a>, including a low-power Bluetooth remote connection that supplements its usual uses. Samsung’s DeX desktop mode has been improved too, and no longer requires <a href=\"https://www.digitaltrends.com/gadget-reviews/samsung-dex-station-review/\">the expensive dock</a> to work. <a href=\"https://www.digitaltrends.com/mobile/how-to-use-bixby/\">Bixby</a> is more useful than before, and Note 9 owners also benefit from fast facial unlocking.</p>",
            "<p><strong>Winner: Samsung Galaxy Note 9<br>\n</strong></p>",
            "<p>The Galaxy Note 9 is currently available from most major carriers, with prices starting from a whopping $1,000. The Xperia XZ3 will cost $900 when it releases on October 17 — but keep in mind that it’ll only work on T-Mobile and AT&amp;T.</p>",
            "<p>The Galaxy Note 9 is among the <a href=\"https://www.digitaltrends.com/mobile/best-smartphones/\">best smartphones in the world</a> right now, so the Xperia XZ3 was always going to have a hard time topping it. It’s clear to us that the Note 9 is the superior phone in most categories, and that means it’s the Samsung you should be picking.</p>",
            "<p>However, the competition was not completely in the Note 9’s favor, and some categories are closer than the final score would have you believe. The Xperia XZ3 is still a powerful phone with a gorgeous display, and if you love Xperia phones, then it’s a great choice for you. But for everyone else, it should be the Note 9.</p>"
        ]
    },
    {
        "title": "\n\t\tEverything you need to know about the Sony Xperia XA3, Plus, and Ultra\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>The Sony Xperia XA2 and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xa2-ultra-review/\">Xperia XA2 Ultra</a> were released at CES in January 2018, and it looks like the company is gearing up for a follow-up one year later. Leaks surrounding the Sony Xperia XA3 and different versions of it have started popping up online, showing a phone with a slightly updated design and what will hopefully be better internal features.</p>",
            "<p>Here’s everything we know about the upcoming Sony Xperia XA3, Xperia XA3 Plus, and Xperia XA3 Ultra so far.</p>",
            "<p>Sony kicked off a new design philosophy in 2018, and it looks like the company could continue with that new style in 2019. Sony is expected to release at least two variants of the Xperia XA3, but it’s likely that the different versions of the phone will have a similar design. A leak of what is reportedly the Xperia XA3 was released by Twitter leaker @OnLeaks in conjunction <a href=\"https://www.mysmartprice.com/gear/sony-xperia-xa3/\" target=\"_blank\" rel=\"noopener\">with MySmartPrice</a>, and shows a device with a dual-sensor camera on the back and a relatively large display. The display isn’t quite as edge-to-edge as some flagship phones in 2018 and 2019, and because of that, the phone does look slightly dated.</p>",
            "<p>When it comes to dimensions, the Xperia XA3 comes in at 155.7 x 68.3 x 8.4mm, but with the camera bump, the device may be a little thicker. On the bottom, the device has a USB-C port, while on the top can be found a headphone jack. On the left, customers will get a fingerprint sensor placed in the power button.</p>",
            "<p>We also got a <a href=\"https://www.mysmartprice.com/gear/sony-xperia-xa3-ultra/\" target=\"_blank\" rel=\"noopener\">leak of the XA3 Ultra from My Smart Price</a>, which features a similar overall shape and look, also with a dual-sensor camera and a large display. Unlike the standard Xperia XA3, the phone has a black color scheme.</p>",
            "<p>We don’t yet have too much information about the specs the phone will feature under the hood, but given the fact that last year’s model was a midrange device, we can speculate. For example, we think that the device will feature a <a href=\"https://www.digitaltrends.com/computing/qualcomm-snapdragon-660-630/\">Qualcomm Snapdragon 660 processor</a>, or something similar, with around 6GB of RAM and at least 64GB of internal storage. We’ll have to wait for anything official, however.</p>",
            "<p>So when will we see the new device? Well, we don’t know for sure — but given the leaks, we expect the phone to be released soon. The Xperia XA2 Ultra was released at CES 2018, and it’s very possible that the XA3 could be shown off at <a href=\"https://www.digitaltrends.com/news/tech-trends-ces-2019/\">CES 2019</a>, which begins on Wednesday, January 9. Sony is actually holding a press conference a few days before CES, on January 7 — so it’s possible we’ll see the phone there.</p>",
            "<p>We’ll update this article as we hear more about the Sony Xperia XA3.</p>"
        ]
    },
    {
        "title": "\n\t\tSony’s Xperia XZ2 Premium has a crazy-high ISO for photos and video\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>iframe src=”https://www.youtube.com/embed/zq6iOiZHXVs” width=”560″ height=”315″ frameborder=”0″ allowfullscreen=”allowfullscreen”&gt;</p>",
            "<p>Just a month and a half ago at <a href=\"https://www.digitaltrends.com/mwc-2019/\">Mobile World Congress</a>, Sony teased it was <a href=\"https://www.digitaltrends.com/mobile/sony-xperia-xz2-news/\">working on a smartphone</a> that could hit 51,200 ISO for photos, and 12,800 ISO for videos. The company claimed the latter would be the world’s highest ISO in a phone. Well, that phone is already here, and it’s called the Xperia XZ2 Premium.</p>",
            "<p>The Sony Xperia XZ2 Premium may have been announced a few months ago, but it’s now finally up for pre-order — for $1,000. That’s quite a price for a phone, but it does come with a few goodies to help soften the blow — like the $280 Sony Xperia Ear Duo wireless headphones.</p>",
            "<p>The phone won’t be available fully until July 30 in the U.S. If you already know you want it, however, you can <a href=\"https://www.amazon.com/Sony-Premium-Unlocked-Smartphone-Wireless/dp/B07DV4HSTK/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=sl1&amp;tag=dt-incontent-btn-20&amp;linkId=a57f6354c29f6ee54107af7093c6960f\" target=\"_blank\" rel=\"noopener\">head to Amazon</a> to pre-order the phone.</p>",
            "<p>The 5.8-inch XZ2 Premium is the successor to last year’s <a href=\"https://www.digitaltrends.com/mobile/sony-xperia-2017-releases-hand-on/\">Xperia XZ Premium</a>, and it currently sits as the flagship of Sony’s 2018 lineup, ahead of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz2-review/\">Xperia XZ2 and XZ2 Compact</a> releasing this week. The XZ2 looks exactly like the Xperia XZ2, except for the extra camera on the rear. It follows the company’s new redesign, which highlights curves and elegance over the sharp and angular look on the XZ Premium; oh, and there’s a fingerprint sensor on the back. Sadly, it looks as though the Premium has chunkier bezels on the front surrounding the screen. It’s protected by <a href=\"https://www.corning.com/gorillaglass/worldwide/en/glass-types/gorilla-glass-5.html\">Gorilla Glass 5</a> on both sides of the phone, which allows for Qi wireless charging; and it’s IP65/IP68 water-resistant.</p>",
            "<p>The 4K screen (2,160 x 3,840) supports HDR content, bringing color accuracy on the screen closer to what the artist intended. The phone also utilizes Sony’s Dynamic Vibration System, which was first introduced in the Xperia XZ2. This means there’s a stronger vibration motor in the phone, and it’s tuned to offer feedback to various audio changes such as when there’s a gunshot in a film, or when you’re playing a game. There are front-facing speakers on the Premium, which Sony said is its loudest ever, for an even better immersive experience.</p>",
            "<p>Sony said it used Strategy Analytics’ <a href=\"https://www.sonymobile.com/global-en/legal/testresults/\">SpecTRAX Service</a> to run through the published specifications of more than 11,800 smartphones. The XZ2 Premium emerged as the winner for the highest ISO in video, as of February 2018.</p>",
            "<p>The camera system also offers a Portrait Mode, which adds a strong blurred background behind a subject, as well as a monochrome mode, when you want to shoot in black and white. Like the Xperia XZ2, you can capture video in 4K HDR, and shoot super slow motion video at 960 frames per second in 1080p. The latter slow-motion feature bests the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">Huawei P20 Pro</a> and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Samsung Galaxy S9</a>, which can only shoot 960fps in 720p. The front-facing camera has 13 megapixels.</p>",
            "<p>The Xperia XZ2 Premium is powered by the Qualcomm Snapdragon 845 processor and 6GB of RAM. That means it has slightly more RAM than the XZ2, and its bigger size means a larger 3,450mAh battery to boot. It comes with 64GB of internal storage, with support for MicroSD cards.</p>",
            "<p>The XZ2 Premium will ship with Android 8.0 Oreo. We anticipate the phone to be updated to Android P shortly after its release later this year.</p>",
            "<p>But it’s the camera that sets this phone apart from the competition. ISO is a tool available on all cameras that let you brighten an image. It’s handy when you are in low-light situations, but the downside of using it is the increased noise or grain in the photo. The higher the ISO, the grainier the photo. Still, having a high ISO is a good option because it makes the camera more versatile. Sony’s claiming that its incredibly high ISO capabilities with video and photo on the XZ2 Premium will offer up “true professional camera quality.”</p>",
            "<p>The increased ISO is possible thanks to the Motion Eye Dual Camera, along with Sony’s AUBE fusion image signal processor. This is Sony’s first smartphone with a dual-camera system on the rear (the <a href=\"https://www.digitaltrends.com/mobile/sony-xperia-xa2-ultra-xa2-and-l2-review/\">Xperia XA2 Ultra</a> has two cameras on the front). Like Huawei phones, the 12-megapixel camera has a f/1.6 aperture and shoots strictly in black and white, while the 19-megapixel f/1.8 camera shoots in color. The signal processor uses data from both camera sensors, and the end result is a system that offers incredibly high sensitivity for low-light environments. Don’t worry about hitting those high ISO numbers, because Sony said images will be “clean” and “noiseless.” Neither cameras have any kind of optical image stabilization.</p>",
            "<p>Sony said it used Strategy Analytics’ <a href=\"https://www.sonymobile.com/global-en/legal/testresults/\">SpecTRAX Service</a> to run through the published specifications of more than 11,800 smartphones. The XZ2 Premium emerged as the winner for the highest ISO in video, as of February 2018.</p>",
            "<p>The camera system also offers a Portrait Mode, which adds a strong blurred background behind a subject, as well as a monochrome mode, when you want to shoot in black and white. Like the Xperia XZ2, you can capture video in 4K HDR, and shoot super slow motion video at 960 frames per second in 1080p. The latter slow-motion feature bests the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/huawei-p20-pro-review/\">Huawei P20 Pro</a> and the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Samsung Galaxy S9</a>, which can only shoot 960fps in 720p. The front-facing camera has 13 megapixels.</p>",
            "<p>The Sony Xperia XZ2 Premium is now officially up for pre-order in the U.S., and can be order <a href=\"https://www.amazon.com/Sony-Premium-Unlocked-Smartphone-Wireless/dp/B07DV4HSTK/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=sl1&amp;tag=dt-incontent-btn-20&amp;linkId=a57f6354c29f6ee54107af7093c6960f\" target=\"_blank\" rel=\"noopener\">through Amazon</a>. Expect to see it on store shelves starting July 30.</p>",
            "<p>Pricing for the Xperia XZ2 Premium comes in at $1,000, though the phone will be bundled with Xperia Ear Duo.</p>",
            "<p><i>Updated on July 9: The Sony Xperia XZ2 Premium is now up for pre-order.</i></p>"
        ]
    },
    {
        "title": "\n\t\tXperia XZ3 vs. XZ2 Premium vs. XZ2 vs. XZ2 Compact: Smartphone battle royale\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz3-review/\">Sony Xperia XZ3</a> has been revealed, and it has Sony’s first ever smartphone OLED display. But while it’s the newest Xperia, it’s not the only one around. Should you be saving your pennies for Sony’s latest, or should you invest in other Sony flagship phones that were released within the past four months? Those include the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz2-premium-review/\">Xperia XZ2 Premium</a>, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz2-review/\">Xperia XZ2</a>, and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz2-compact-review/\">XZ2 Compact</a>. To find out, we put together a jumbo-sized battle royale, with your pocket space as the prize.</p>",
            "<p>Since all four are equipped with the powerful <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a>, you’re likely to find similar performance in each. The amount of RAM available in each phone varies, but since all have at least 4GB available, you’re unlikely to find much of a difference in real-world performance. They are all square on storage space too, with 64GB available in each and up to 512GB extra through a MicroSD card.</p>",
            "<p>Can the battery break the tie? Possibly. Each phone has a battery sufficient for at least a day’s worth of tapping, streaming, and watching. The <a href=\"https://www.sonymobile.com/gb/products/phones/xperia-xz3/\">XZ3</a> has a slightly larger battery than its counterpart, which puts the <a href=\"https://www.sonymobile.com/gb/products/phones/xperia-xz2/\">XZ2</a> out of the running — but the <a href=\"https://www.sonymobile.com/gb/products/phones/xperia-xz2-premium/\">XZ2 Premium</a> and <a href=\"https://www.sonymobile.com/gb/products/phones/xperia-xz2-compact/\">XZ2 Compact</a> both sport great batteries for their sizes, even with the Premium’s massive 4K resolution pulling hard on the 3,540mAh battery.</p>",
            "<p>There’s Quick Charge 3.0 on each of these phones, too, but the XZ2 Compact suffers slightly in lacking the convenience of wireless charging. With the Compact out of the running, it comes down to the XZ3 and the XZ2 Premium — and having 2GB more RAM just squeezes the win for the XZ2 Premium. Realistically, the XZ3 and XZ2 Premium are neck-and-neck.</p>",
            "<p><strong>Winner: Sony Xperia XZ2 Premium<br>\n</strong></p>",
            "<p>All four of these phones follow Sony’s new Ambient Flow design ethos, but there are small differences to be found. First off, the XZ2 Premium’s 16:9 aspect ratio display gives it some seriously chunky bezels at the top and the bottom of the device, putting it out of the running. The XZ2 and XZ2 Compact have a slimmer forehead and chin, but neither can compete with the more curved look Sony’s taken with the XZ3. The XZ3’s screen curves into the body, reducing the bezels on the sides, and it’s combined with further reductions of top and bottom bezels.</p>",
            "<p>Other than these differences, all four phones are pretty much the same. They all are IP68/65 rating for water and dust-resistance, none has a headphone jack, and they’re all on the heavier side for 2018 smartphones. All but the Compact are also extremely slippery glass phones, so it’s definitely worth <a href=\"https://www.digitaltrends.com/mobile/best-xperia-xz2-cases/\">picking up a case</a> for grip and protection. The Compact has a glass back and it’s easier to hold, which makes it slightly more durable.</p>",
            "<p>Still, the design changes made with the Xperia XZ3 make it the more attractive phone.</p>",
            "<p><strong>Winner: Sony Xperia XZ3<br>\n</strong></p>",
            "<p>The Xperia XZ3 is the first Sony smartphone to come with an OLED display, putting the IPS LCD displays in the XZ2 and XZ2 Compact to shame with deep inky blacks and bright vibrant colors. But can it beat the astoundingly sharp 4K resolution of the XZ2 Premium? It’s a hard choice to make, and one that’s likely to be personal — but for us, it’s so hard to tell the difference between the sharpness on the XZ3’s Quad HD+ resolution and the XZ2 Premium’s 4K resolution that the better OLED color reproduction and deep blacks on the XZ3 make the choice clear.</p>",
            "<p>The XZ3 might have the best screen we’ve ever seen on an Xperia phone, and it wins this round.</p>",
            "<p><strong>Winner: Sony Xperia XZ3<br>\n</strong></p>",
            "<p>Sony’s camera hardware is some of the best around, but it tends to fall slightly short of <a href=\"https://www.digitaltrends.com/mobile/best-camera-phones/\">true greatness</a>. The XZ2 and XZ2 Compact have capable cameras, but it’s the dual-lens XZ2 Premium that showed us what Sony’s really capable of with some exceptional low-light performance. The XZ3 should be the next step up in Sony’s evolution, but for some reason the company chose to step back down to the same 19-megapixel single lens from the XZ2. We’re expecting the XZ3 to have a strong camera — but we doubt it will be capable of matching the XZ2 Premium’s performance.</p>",
            "<p>Around the front of the XZ3 you’ll find a 13-megapixel selfie shooter that’s much the same as the XZ2 Premium’s. All four of the phones also support 4K HDR video recording and super-slow motion video at 1080p.</p>",
            "<p>Each of these phones have a capable camera suite, but we’re confident that the XZ2 Premium is the strongest of these four.</p>",
            "<p><strong>Winner: Sony Xperia XZ2 Premium<br>\n</strong></p>",
            "<p>Sony’s record with Android updates is strong, but the XZ3 takes an immediate lead straight out of the gate with the inclusion of <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9.0 Pie</a>. Sony <a href=\"https://www.digitaltrends.com/mobile/android-p-when-do-you-get-it/\">has confirmed</a> that the entire XZ2 range will receive Android 9.0 Pie eventually, but since that’s yet to happen it gives the XZ3 the lead. Being a newer phone, you can also expect the XZ3 to be supported for slightly longer than the XZ2 range.</p>",
            "<p>Outside of the more advanced operating system, you’ll find similar amounts of Sony’s usual bloatware applied to these devices.</p>",
            "<p>The Xpera XZ3’s use of Android 9.0 Pie gives it the win here.</p>",
            "<p><strong>Winner: Sony Xperia XZ3<br>\n</strong></p>",
            "<p>Being a Sony-made device, every one of these four devices comes with <a href=\"https://www.sonymobile.com/gb/apps-services/remote-play/?utm_source=marketing-url&amp;utm_medium=/gb/apps-services/remote-play/&amp;utm_campaign=http://www.sonymobile.com/remoteplay\">Sony’s PS Remote Play</a> that allows users to stream their PlayStation 4 gameplay to their Xperia smartphones, bypassing the need for a TV. Another niche feature is the <a href=\"https://www.sonymobile.com/gb/apps-services/3d-creator/\">3D Creator</a> app, which creates 3D models of objects using the phone’s camera. You’ll also get a more immersive experience from the <a href=\"https://blogs.sonymobile.com/2018/06/14/tested-dynamic-vibration-system-adds-new-dimension-gaming/\">Dynamic Vibration System</a> on the XZ3, XZ2, and XZ2 Premium that vibrates during videos to emphasize punches, gunshots, or other activities.</p>",
            "<p>Sony’s added more features to the XZ3 though, and you might find them more useful. <a href=\"https://www.sonymobile.com/gb/products/phones/xperia-xz3/design/\">Side Sense</a> is similar to Samsung’s Edge Sense, and it brings up a shortcut menu of frequent apps and actions when you tap the side of the screen. The Smart Launch feature launches the camera automatically when held in landscape.</p>",
            "<p>The Xperia XZ3’s additional features are still a little niche — but since it gets everything the XZ2 range gets, this is clear win for the XZ3.</p>",
            "<p><strong>Winner: Sony Xperia XZ3<br>\n</strong></p>",
            "<p>You can buy one of Sony’s Xperia XZ2 smartphones from a range of retailers right now, but you’ll commonly find them on <a href=\"https://www.amazon.com/s/ref=nb_sb_noss?url=search-alias=aps&amp;field-keywords=xperia&amp;tag=dt-incontent-btn-20&amp;tag=dt-incontent-btn-20\">Amazon</a> and <a href=\"https://www.bestbuy.com/site/sony-store/sony-cell-phones/pcmcat302400050019.c?id=pcmcat302400050019&amp;sp=-currentprice%20skuidsaas\">Best Buy</a>. The XZ3 will be available from Best Buy and Amazon from October 17.</p>",
            "<p>The Xperia XZ3 will set you back $900, while the XZ2 Premium retails for a staggering $1,000. The XZ2 costs $800 — and the XZ2 Compact is the cheapest of the lot, starting from $650.</p>",
            "<p>Xperia smartphones don’t work with CDMA networks, so there’s no support for Verizon and Sprint — but they will work fine with AT&amp;T and T-Mobile.</p>",
            "<p>The Xperia XZ3 is, in many ways, a very similar beast to the XZ2 range. There’s been no really big jump in power or design, and most of the improvements involve fine-tuning rather than an overhaul. But the differences that are present are enough to make the Xperia XZ3 the more solid choice out of the four on offer.</p>",
            "<p>The exception is the XZ2 Compact, which targets people who desire smaller phones. It’s one of <a href=\"https://www.digitaltrends.com/mobile/best-smallest-smartphones/\">your best choices</a> if you don’t want a massive device.</p>"
        ]
    },
    {
        "title": "\n\t\tKey settings you need to change on your Sony Xperia XZ3\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p>We’re big fans of the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/sony-xperia-xz3-review/\">Sony Xperia XZ3</a>, but it’s not perfect out of the box. You’ll want to spend some time customizing the look of your new phone, setting up shortcuts, and scheduling routines that suit you. We’ve got a few suggestions to help you get started right here. These are the key settings we think you should tweak.</p>",
            "<p>Tap and hold on an empty space on your home screen and you can tweak how it looks. You can <a href=\"https://www.digitaltrends.com/mobile/best-wallpaper-apps/\">pick a wallpaper</a><span style=\"font-size: 16px;\"> that suits you, </span><a href=\"https://www.digitaltrends.com/mobile/best-widgets-for-android/\">choose widgets</a><span style=\"font-size: 16px;\">, and set shortcuts, but there’s more. Try out some different <em>Transitions</em> as they determine how the move between home screens is animated when you swipe left or right. You can also resize the grid to determine how many icons are displayed or dive into <em>Home settings</em> and dig deeper into specifics on how icons are displayed, and what you’d like to appear by default.</span></p>",
            "<p>Too much <a href=\"https://www.digitaltrends.com/mobile/does-blue-light-ruin-sleep-we-ask-an-expert/\">blue light before bed can make it harder to get to sleep</a>, so most phones now come with an option to filter the blue light out of the display temporarily. The XZ3 is no exception as it offers a Night Light feature.</p>",
            "<p>We recommend scheduling Night Light to turn on and off automatically, so you can forget about it. Go to <em>Settings &gt; Display &gt; Advanced</em> and scroll down to <em>Night Light</em>, then tap <em>Schedule</em> and choose specific hours or <em>Turns on from sunset to sunrise</em>. It’s available in your notification drawer as a quick settings tile so you can quickly turn it off if needed.</p>",
            "<p>Pull down the notification shade and tap the little pencil icon at the bottom right to edit the quick toggles that appear. You can tap and drag any icon to add or remove it from the quick settings panel or to change the order they appear in.</p>",
            "<p>You can extend your Xperia XZ3’s battery life by using Sony’s Stamina mode. Go to <em>Settings &gt; Battery &gt; Stamina mode</em>, toggle it on and choose when you want it to kick in automatically. We generally set it to switch on when our battery hits 15 percent.</p>",
            "<p>Go to <em>Settings &gt; Lock screen &amp; security &gt; Lock screen preferences</em> and you’ll find a treasure trove of handy options. You can decide what should wake the screen, how you want the Ambient display to work, set your own photos to pop up on the Ambient display, choose your preferred clock style, decide if music should display album art, and lots more.</p>",
            "<p>You don’t want apps you didn’t pick using up system resources or taking up space, so get rid of them immediately. Go to <em>Settings &gt; Apps &amp; notifications</em> and tap <em>See all apps</em>. If you see anything you don’t plan to use, then tap on it and select <em>Uninstall</em> or <em>Disable</em>.</p>",
            "<p>Side Sense allows you to tap the side of your XZ3 and trigger a shortcut panel with frequently used apps, some quick toggles, and shortcuts for things like One-handed mode. If you look in <em>Settings &gt; Display &gt; Advanced &gt; Side Sense </em>you’ll find the option to toggle it on and off.</p>",
            "<p>If you want to keep it on, then we suggest tweaking the sensitivity to suit you and choosing which apps and games you do and don’t want to appear, all of which is an option in this Side Sense menu.</p>",
            "<p>You can set up alerts and hard data limits, so you know when your data allowance is close to running out and you can avoid exceeding it. Go to<em> Settings &gt; Network &amp; internet &gt; Data usage &gt; Data warning &amp; limit</em>. You can choose your data cycle set the stages at which you want to receive a warning or even set up a hard limit to ensure you never go over your allowance.</p>",
            "<p>If you look in <em>Settings &gt; Sound,</em> you’ll find the <em>Dynamic Vibration</em> option. Toggle it on and it will vibrate when you play some music, video, or games. It’s supposed to increase immersion, which we think works for games, but not so much for movies and music. If you tap the <em>Volume up</em> or <em>Volume down</em> button, then you’ll see a separate slider next to the volume slider for <em>Dynamic Vibration,</em> and you can tweak the level of intensity or switch it off completely.</p>",
            "<p>You shouldn’t be responding to messages in the dead of night or wondering why your phone screen lit up as you’re drifting off to sleep, so set up some automatic downtime when your Xperia XZ3 won’t disturb you. Go to <em>Settings &gt; Sound &gt; Do Not Disturb</em> and look for <em>Turn on automatically</em> under <em>Schedule</em>. Pick the hours that suit you and enjoy the peace and quiet.</p>"
        ]
    }
]