[
    {
        "title": "\n\t\tShrinking demand forces Apple to slow down iPhone X production\t",
        "author": [
            "\n\t\t\t\t\t\tEric Brackett\t\t\t\t\t"
        ],
        "text": [
            "<p>The iPhone X <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">launched to stellar reviews</a> and equally strong sales, but Fast Company is reporting that <a href=\"https://www.fastcompany.com/40564691/source-apple-will-produce-only-8-million-iphone-x-units-in-q2\" target=\"_blank\" rel=\"noopener\">demand has slowed considerably</a>. A source within Apple’s supply chains has said that the company plans to make a mere eight million units for the second quarter of this year.</p>",
            "<p>Part of the problem stems from the simple fact that the rush of holiday sales convinced Apple to produce too many iPhone X units and now needs to “burn off” its supply. In total, Apple sold more than 77 million iPhones during the 2017 holiday season. Tim Cook has said that the iPhone X outsold all other models every week of the first quarter since its release. This tracks with Above Avalon analyst Neil Cybart’s estimate that the iPhone X accounted for about 35 percent of all smartphone sales during the holiday season.</p>",
            "<p>Demand for the device has slowed down considerably since then, however, and Apple’s supply chain reflects this new reality. TSMC, which produces many of the chips used in the iPhone X, warned investors of falling demand for its chips. Analysts expected TSMC to earn about $8.8 billion, but the company’s quarterly guidance reports say that number is closed to $7.8 to $7.9 billion.</p>",
            "<p>Australia-based AMS, which makes some of the components used in Apple’s facial recognition system, warned that it expects its second-quarter revenue to be half what it was in the first.</p>",
            "<p>Internally, there are reports that some within Apple are disappointed in the iPhone X sales and have questioned the wisdom of releasing a $1,000 smartphone. This mindset may help determine Apple’s game plan for 2018. The company is expected to release three new iPhones this year, <a href=\"https://www.digitaltrends.com/mobile/iphone-xs-iphone-xs-max-iphone-xr-news/\">including a 6.1-inch LCD model</a>.</p>",
            "<p>The LCD phone could be priced as low as $550. Some sources within Apple say that the company expects this more affordable iPhone to account for as much as 50 percent of unit sales once it is launched.</p>",
            "<p>None of this means that the iPhone X is a failure. Cybart estimates that, by the time the 2018 iPhones launch, the iPhone X will have sold 60 million units and earned Apple $59 billion in revenue. There are plenty of companies that would love to have that level of “disappointment.”</p>"
        ]
    },
    {
        "title": "\n\t\tLooking to upgrade? These are the best iPhone deals for January 2019\t",
        "author": [
            "\n\t\t\t\t\t\tLucas Coll\t\t\t\t\t"
        ],
        "text": [
            "<p>When it comes to high-quality devices, like the iPad, MacBook, HomePod, or Apple Watch, people seem to either love them or hate them. The popularity of these sleek devices endures, however. This is undoubtedly owed to the excellent build quality of Apple hardware, as well as the devices’ sleek modern aesthetics, highly functional and intuitive software, and the company’s reputation for delivering “fashionable” tech. A new iPhone can cost you a pretty penny, though, which is one of the reasons that Android <a href=\"https://www.cultofmac.com/442781/ios-falls-as-androids-market-share-skyrockets/\" rel=\"noopener\">still commands the lion’s share of the smartphone market</a>.</p>",
            "<p>Nonetheless, the venerable iPhone still enjoys royal status in the world of smart tech. <a href=\"https://www.cultofmac.com/488454/ios-evolution-iphone-os/\" rel=\"noopener\">If you’ve just gotta have iOS</a> (and aren’t the type to wait in line to pay in store prices on launch day),  then you’re not out of luck. Seasonal deals and new product rollouts offer a lot of chances to score some deep discounts on your cell phone. To keep you up to date with the latest offers, promo codes, and cell phone plans, we’ve curated an up-to-date list of the best iPhone deals and cheap iPhone options for January:</p>",
            "<p>The iPhone SE was designed as a downsized and less costly alternative to its cousins, making it the best iPhone option for buyers who want an affordable iOS device. The SE model has a lot more going for it than its low price, however, as it’s <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-se-review/\">a fantastic little wireless phone</a> in its own right. Though you may need to hold off an downloading an app or two.</p>",
            "<p>The SE was first introduced in 2016. Its compact frame sports a four-inch display, harking back to the older model iPhones. Plus It runs on hardware similar to the iPhone 6, and features a 1.85 GHz dual-core CPU and 2GB of RAM. It often comes in Rose Gold or Space Gray, but if you don’t like either of those classic iPhone colors, you can always cover it up with an iPhone case.</p>",
            "<p>With a retail price of $399, which is shockingly low when it comes to iPhones – the SE is hands down <a href=\"https://www.cultofmac.com/420686/iphone-se-proves-size-doesnt-matter-reviews/\" rel=\"noopener\">the go-to budget pick</a>. We’re all about those smartphone deals, though, so you can pay even less with the following cheap iPhone discounts you won’t find in a store. Whether you chose a phone plan with unlimited minutes, unlimited texts, or unlimited GB data is entirely up to you, however.</p>",
            "<p style=\"text-align: center;\">($184) <a class=\"m-aff-button\" href=\"https://www.amazon.com/Apple-Factory-Unlocked-Certified-Refurbished/dp/B0751RGH6W/?tag=dt-incontent-btn-20\" www.>Amazon</a></p>",
            "<p style=\"text-align: center;\">($206) <a class=\"m-aff-button\" href=\"https://www.amazon.com/Apple-iPhone-GSM-Unlocked-64GB/dp/B0774YPFLW/?tag=dt-incontent-btn-20\" www.>Amazon</a></p>",
            "<p style=\"text-align: center;\">($125) <a class=\"m-aff-button\" href=\"https://goto.target.com/c/123412/81938/2092?u=https%3A%2F%2Fwww.target.com%2Fp%2Fsimple-mobile-iphone-se-32gb-rose-gold%2F-%2FA-52556306%3F\" data-affiliate-link=\"1\" data-affiliate-name=\"Target\">Target</a></p>",
            "<p style=\"text-align: center;\">($250) <a class=\"m-aff-button\" href=\"https://www.ebay.com/itm/NEW-SEALED-Apple-iPhone-SE-32GB-Space-Gray-AT-T-1-Year-Warranty/263697949607?epid=238382366&amp;hash=item3d659f63a7:g:VT0AAOSwMD5a~1Wx\" data-affiliate-link=\"1\" data-affiliate-name=\"Ebay\">Ebay</a></p>",
            "<p>The iPhone 6 was one of the most popular phones ever made (as well as <a href=\"https://www.digitaltrends.com/cell-phone-reviews/iphone-6-review/\">one of our all-time favorites</a>), so it’s no surprise to find it still on the market today despite being released in 2014 – a year that feels like a long time ago in the high-speed world of iPhone release cycles. Its 2015 successor, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-6s-review/\">fantastic iPhone 6S</a>, also proved immensely successful, with record-breaking launch sales. This iPhone was a huge advancement after the iPhone 5 and iPhone 4, making it a revolutionary piece of technology that is still relevant today.</p>",
            "<p>Like the iPhone 7, the Apple iPhone 6 and 6S <a href=\"https://www.cultofmac.com/296213/iphone-6-6-plus-meta-review-bigger-really-better/\" rel=\"noopener\">remain highly capable smartphones</a>, and the company is still pumping them out as long as people are willing to buy them. In fact, the iPhone 6’s enduring popularity led to it being quietly reintroduced to the market in 2017 after being temporarily discontinued and excluded from online iOS retailers.</p>",
            "<p>This particular smartphone runs on a 1.4 GHz dual-core 64-bit CPU, a quad-core PowerVR GPU, and 1GB of RAM. The 6S boasts improved specs with a 1.85 GHz dual-core processor and an upgraded 2GB of RAM. Both of these phones started at the usual $649 retailer price upon their release but are now much, much cheaper, and these iPhone 6 and iPhone 6S discounts sweeten the unlocked savings even more. If you’re looking for an iPhone with decent battery life that you won’t need to make monthly payments on or sign a contract for, these unlocked savings are for you:</p>",
            "<p style=\"text-align: center;\">($170) <a class=\"m-aff-button\" href=\"https://www.amazon.com/Apple-iPhone-GSM-Unlocked-16GB/dp/B00YD547Q6/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=sl1&amp;tag=dt-incontent-btn-20&amp;linkId=9d89708c23a9068722996898c6afbd9e&amp;language=en_US&amp;tag=dt-incontent-btn-20\" www.>Amazon Refurbished</a></p>",
            "<p style=\"text-align: center;\">($145) <a class=\"m-aff-button\" href=\"http://rover.ebay.com/rover/1/711-53200-19255-0/1?icep_ff3=2&amp;pub=5575108333&amp;toolid=10001&amp;campid=5337754495&amp;customid=&amp;icep_item=132825047880&amp;ipn=psmain&amp;icep_vectorid=229466&amp;kwid=902099&amp;mtid=824&amp;kw=lg\" data-affiliate-link=\"1\" data-affiliate-name=\"Ebay\">Ebay</a></p>",
            "<p style=\"text-align: center;\">($250) <a class=\"m-aff-button\" href=\"https://www.amazon.com/Apple-iPhone-6S-Unlocked-64GB/dp/B01CR1AA90/?tag=dt-incontent-btn-20\" www.>Amazon Refurbished</a></p>",
            "<p style=\"text-align: center;\">($243) <a class=\"m-aff-button\" href=\"https://www.amazon.com/Apple-iPhone-Fully-Unlocked-64GB/dp/B06XRHJWNC/?tag=dt-incontent-btn-20\" www.>Amazon Refurbished</a></p>",
            "<p style=\"text-align: center;\">($145) <a class=\"m-aff-button\" href=\"https://www.ebay.com/itm/NEW-Apple-iPhone-6-16GB-32GB-64GB-UNLOCKED-Gold-Silver-Space-Gray-GSM/153152298151?\" data-affiliate-link=\"1\" data-affiliate-name=\"Ebay\">Ebay</a></p>",
            "<p>If you’re not fussy about having the latest bleeding-edge gadgets, preferring instead to have something established and reliable (not to mention considerably cheaper), then last-gen devices like <a href=\"https://www.cultofmac.com/446018/iphone-7-review/\" rel=\"noopener\">the iPhone 7</a>  or iPhone 7 Plus offer the perfect way to score some still-great brand-new tech at deep discounts and leave your wallet in good condition.</p>",
            "<p>This particular iPhone may not be the new hot phone anymore following the rollout of the iPhone 8 and X, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-7-review/\">but it’s no slouch</a>. A 2.34 GHz dual-core CPU, hexa-core 7XT GT7600 Plus graphics processor, and 2GB to 3GB of RAM (2GB for the iPhone 7 and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-7-plus-review/\">3GB for the 7 Plus</a>) combine to deliver great performance alongside the famous reliability, user-friendly software, and app store the company is known for.</p>",
            "<p>Prices for this iPhone started at $649 at its launch, and given that it’s more than a year old, now is the time to grab a brand-new iPhone 7 Plus or the original for cheap with a limited time offer or sale:</p>",
            "<p style=\"text-align: center;\">($327) <a class=\"m-aff-button\" href=\"https://www.amazon.com/d/Unlocked-Cell-Phones/Apple-iPhone-Fully-Unlocked-128GB/B01N25DJ2B/?tag=dt-incontent-btn-20\" www.>Amazon Refurbished</a></p>",
            "<p style=\"text-align: center;\">($529) <a class=\"m-aff-button\" href=\"https://www.amazon.com/Apple-iPhone-Unlocked-Phone-32/dp/B01M1P7JXE/?tag=dt-incontent-btn-20\" www.>Amazon</a></p>",
            "<p style=\"text-align: center;\">($498) <a class=\"m-aff-button\" href=\"http://linksynergy.walmart.com/fs-bin/click?id=9e1vMmumXG0&amp;subid=0&amp;offerid=599494.1&amp;type=10&amp;tmpid=1082&amp;RD_PARM1=https%253A%252F%252Fwww.walmart.com%252Fip%252FStraight-Talk-Prepaid-Apple-iPhone-7-32GB-Black%252F173622323\" data-affiliate-link=\"1\" data-affiliate-name=\"Walmart\">Walmart</a></p>",
            "<p style=\"text-align: center;\">($308) <a class=\"m-aff-button\" href=\"https://www.amazon.com/Apple-iPhone-Plus-Unlocked-128GB/dp/B07939SR6N/?tag=dt-incontent-btn-20\" www.>Amazon Refurbished</a></p>",
            "<p style=\"text-align: center;\">($360) <a class=\"m-aff-button\" href=\"https://www.amazon.com/Apple-iPhone-Plus-Unlocked-32GB/dp/B01NB1FOM3/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=sl1&amp;tag=dt-incontent-btn-20&amp;linkId=8a52c15753c80d27cb93fca5ce31f210&amp;tag=dt-incontent-btn-20\" www.>Amazon </a></p>",
            "<p style=\"text-align: center;\">($479) <a class=\"m-aff-button\" href=\"https://aos.prf.hn/click/camref:1101l7vG/destination:https%3A%2F%2Fwww.apple.com%2Fshop%2Fproduct%2FFNQH2%2FRefurbished-iPhone-7-Plus-32GB-Black\" data-affiliate-link=\"1\" data-affiliate-name=\"Apple\">Apple</a></p>",
            "<p style=\"text-align: center;\">($500) <a class=\"m-aff-button\" href=\"https://www.ebay.com/itm/IPHONE-7-32GB-BLACK-FACTORY-UNLOCKED-APPLE-32-GB-GSM-MATTE-BRAND-NEW/273189058712?hash=item3f9b563898:g:bLsAAOSwBMRa1R92\" data-affiliate-link=\"1\" data-affiliate-name=\"Ebay\">Ebay</a></p>",
            "<p>Last year saw the launch of two new flagship mobile devices from the fruit-themed tech giant: The iPhone 8 and iPhone 8 Plus dropped alongside the iPhone X as the traditional successor to the previous iPhone.</p>",
            "<p>Under the hood, the iPhone 8 isn’t radically different than the X. It boasts the same 2.39 hexa-core processor, although the standard wireless iPhone 8 only utilizes 2GB of RAM compared to the X’s 3GB (<a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-8-plus-review/\">the larger iPhone 8 Plus</a> features the full 3GB). It also performs similarly to the iPhone X when it comes to its excellent camera and speedy wireless charging, also akin to a newer Galaxy phone. Since the battery life is also similar, the main difference between the iPhone 8 and the iPhone X is screen size and a touch screen home button, but you can still get both in that classic Space Gray color you know and love.</p>",
            "<p>Although its more traditional design <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-8-review/\">isn’t as groundbreaking as iPhones of the past</a>, the iPhone 8 still delivers the solid build quality and performance we’ve come to expect. Plus with a starting retail price of $699 for this iPhone and a $799 price tag for the iPhone 8 Plus, as well as that classic Space Gray finish, it’s not quite as pricey as the X. If you’re looking for a great phone, but don’t feel like making monthly payments to upgrade to the newest model, you can save some cash with these ongoing Apple iPhone 8 deals and GSM carrier sales:</p>",
            "<p style=\"text-align: center;\">($489) <a class=\"m-aff-button\" href=\"https://www.amazon.com/Apple-iPhone-AT-64GB-Refurbished/dp/B07D6TT174/?tag=dt-incontent-btn-20\" www.>Amazon Refurbished</a></p>",
            "<p style=\"text-align: center;\">($433) <a class=\"m-aff-button\" href=\"https://www.amazon.com/Apple-iPhone-Unlocked-Certified-Refurbished/dp/B078P5BK5G/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=sl1&amp;tag=dt-incontent-btn-20&amp;linkId=03b05d60393b4d78d2fc3ed73d01c2e8&amp;tag=dt-incontent-btn-20\" www.>Amazon Refurbished</a></p>",
            "<p style=\"text-align: center;\">($599) <a class=\"m-aff-button\" href=\"https://aos.prf.hn/click/camref:1101l7vG/destination:https%3A%2F%2Fwww.apple.com%2Fshop%2Fbuy-iphone%2Fiphone-8\" data-affiliate-link=\"1\" data-affiliate-name=\"Apple\">Apple</a></p>",
            "<p style=\"text-align: center;\">($490) <a class=\"m-aff-button\" href=\"https://www.ebay.com/itm/Apple-iPhone-8-64GB-GSM-Unlocked-Smartphone/253572190763\" data-affiliate-link=\"1\" data-affiliate-name=\"Ebay\">Ebay</a></p>",
            "<p style=\"text-align: center;\">($539) <a class=\"m-aff-button\" href=\"https://www.amazon.com/Apple-iPhone-Plus-Unlocked-64GB/dp/B0775FLHPN/?tag=dt-incontent-btn-20\" www.>Amazon Refurbished</a></p>",
            "<p style=\"text-align: center;\">($599) <a class=\"m-aff-button\" href=\"https://www.amazon.com/Apple-Gray-Smartphone-Certified-Refurbished/dp/B07755LZ67/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=sl1&amp;tag=dt-incontent-btn-20&amp;linkId=453a3166bbc13c918587b2c636e280ce&amp;tag=dt-incontent-btn-20\" www.>Amazon</a></p>",
            "<p style=\"text-align: center;\">($699) <a class=\"m-aff-button\" href=\"https://aos.prf.hn/click/camref:1101l7vG/destination:https%3A%2F%2Fwww.apple.com%2Fshop%2Fbuy-iphone%2Fiphone-8\" data-affiliate-link=\"1\" data-affiliate-name=\"Apple\">Apple</a></p>",
            "<p style=\"text-align: center;\">($560) <a class=\"m-aff-button\" href=\"https://www.ebay.com/itm/Apple-iPhone-8-Plus-Carrier-Option-AT-T-T-Mobile-Verizon-Unlocked-64-256GB-New/183272774939?hash=item2aabe89d1b:rk:1:pf:0&amp;var\" data-affiliate-link=\"1\" data-affiliate-name=\"Ebay\">Ebay</a></p>",
            "<p>Speaking of fashionable tech, the high-end iPhone X definitely turned heads (and caused more than its share of sticker shock) when the new line was announced in fall 2017. Marketed as something of a luxury item, considering it doesn’t have a headphone jack, the iPhone X perhaps uniquely represents the reason behind the “love it or hate it” attitudes that Apple inspires among the masses. But with an improved battery, iOS 11, a slo-mo camera, Face ID, and connectivity for earpods, it’s the best iPhone you can buy right now — despite the expensive upfront cost.</p>",
            "<p><a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">It’s a great piece of kit</a>, however, with an incredible edge-to-edge OLED touch display, a fantastic front camera, and lightning-fast speed thanks to its snappy 2.39 GHz hexa-core processor and 3GB of RAM. It also features wireless charging capability, finally bringing the iPhones up to speed with their Android competitors such as the Samsung Galaxy S8 and HTC. With all of that screen space for your iPhone apps to fit in, the X is really something to behold — though you will need to get a new pair of compatible headphones.</p>",
            "<p><a href=\"https://www.cultofmac.com/512381/iphone-x-review/\" rel=\"noopener\">The iPhone X is a high-end phone</a> with a price tag to match — it retailed for an upfront cost of$999 upon its pre-order launch, which made it the most expensive new iPhone yet. But don’t worry because these iPhone discounts can save you a little extra cash the iPhone X you’ve been dreaming of, you can even trade-in your old phone if you’re worried about having to pay the full amount. If you buy directly from Apple, you can even find some great finance plans to lower your monthly cost. Take a look at the latest next-gen offerings:</p>",
            "<p style=\"text-align: center;\">($715) <a class=\"m-aff-button\" href=\"https://www.amazon.com/Apple-iPhone-Fully-Unlocked-256GB/dp/B0775451TT/?tag=dt-incontent-btn-20\" www.>Amazon Refurbished</a></p>",
            "<p style=\"text-align: center;\">($730) <a class=\"m-aff-button\" href=\"https://www.ebay.com/itm/Apple-iPhone-X-64GB-Space-Gray-Verizon-LTE-Cellular-CDMA-GSM-MQCK2LL-A/142846881286?epid=239092975&amp;hash=item2142566e06:rk:4:pf:0\" data-affiliate-link=\"1\" data-affiliate-name=\"iPhone X\">Ebay</a></p>",
            "<p>The newest mobile devices from Apple is officially available for purchase — the iPhone XS and iPhone XR. Though not much has changed <a href=\"https://www.digitaltrends.com/mobile/apple-iphone-xs-vs-apple-iphone-x/\">between the X and the XS</a>, the price is still hovering right around $1,000. If you’re looking to buy the latest tech from Apple, you can do so right now, but the deals are few and far between. We’ve been scouring the web for the latest discounts, and we will be continually updating this page as the savings continue to roll in. Make sure to check back as Black Friday and Cyber Monday draw closer for some of the iPhone XS and iPhone XR deals for 2018.</p>",
            "<p style=\"text-align: center;\">($875) <a class=\"m-aff-button\" href=\"https://www.ebay.com/itm/Apple-iPhone-XR-128GB-All-Colors-GSM-CDMA-UNLOCKED-BRAND-NEW/153232799841?\" data-affiliate-link=\"1\" data-affiliate-name=\"Ebay\">Ebay</a></p>",
            "<p style=\"text-align: center;\">($800) <a class=\"m-aff-button\" href=\"https://www.t-mobile.com/cell-phone/apple-iphone-xr?color=white&amp;memory=128gb&amp;ds_rl=1254214&amp;ds_rl=1260234\" data-affiliate-link=\"1\" data-affiliate-name=\"T-Mobile\">T-Mobile</a></p>",
            "<p style=\"text-align: center;\">($999) <a class=\"m-aff-button\" href=\"https://aos.prf.hn/click/camref:1101l7vG/destination:https%3A%2F%2Fwww.apple.com%2Fshop%2Fbuy-iphone%2Fiphone-xs\" data-affiliate-link=\"1\" data-affiliate-name=\"Apple\">Apple</a></p>",
            "<p style=\"text-align: center;\">($1,000) <a class=\"m-aff-button\" href=\"https://click.linksynergy.com/fs-bin/click?id=9e1vMmumXG0&amp;subid=0&amp;offerid=624111.1&amp;type=10&amp;tmpid=13128&amp;RD_PARM1=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fapple-iphone-xs-64gb-gold-at-t%2F6009643.p%3F\" data-affiliate-link=\"1\" data-affiliate-name=\"Best Buy\">Best Buy</a></p>",
            "<p>Looking for more stuff? Find <a href=\"https://www.digitaltrends.com/dtdeals/best-smartphone-deals/\">smartphone deals</a> and more on our curated <a href=\"https://www.digitaltrends.com/deals/\">deals page</a>.</p>",
            "<p style=\"text-align: center;\"><a class=\"twitter-follow-button\" href=\"https://twitter.com/dealsDT?ref_src=twsrc%5Etfw\">Follow @dealsDT</a></p>"
        ]
    },
    {
        "title": "\n\t\tThe most common iPhone X problems, and how to fix them\t",
        "author": [
            "\n\t\t\t\t\t\tSimon Hill\t\t\t\t\t"
        ],
        "text": [
            "<p><span style=\"font-weight: 400;\">The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a> is completely different from any of its predecessors. It’s the first iPhone to boast a stunning OLED screen, as well as the first to do away the iconic home button. </span></p>",
            "<p><span style=\"font-weight: 400;\">But like any smartphone, there are always a few issues that crop up. We’ve compiled a list of iPhone X problems, after scouring through support threads and forums, and we also have fixes and workarounds to make sure your new iPhone keeps working perfectly.</span></p>",
            "<p>People have quickly gotten used to unlocking their iPhones with their faces, but it seems that Face ID has not been performing perfectly for everyone. Posts in the <a href=\"https://forums.imore.com/iphone-x/401086-faceid-suddenly-not-working-90-time.html\" rel=\"noopener\">iMore forum</a> and the <a href=\"https://forums.macrumors.com/threads/face-id-not-working-suddenly.2108047/\" rel=\"noopener\">MacRumors forum</a> describe an increasingly erratic Face ID which inexplicably fails some of the time. This issue may crop up after a software update.</p>",
            "<p>We’ve seen a few reports at the <a href=\"https://discussions.apple.com/thread/8214240\" rel=\"noopener\">Apple</a> <a href=\"https://discussions.apple.com/thread/8222365\" rel=\"noopener\">forums</a> and the <a href=\"https://forums.macrumors.com/threads/iphone-x-screen-staying-on.2085795/\" rel=\"noopener\">MacRumors forum</a> about the iPhone X screen refusing to turn back on, refusing to turn off, or freezing up intermittently. There are a few possible causes of this.</p>",
            "<p><span style=\"font-weight: 400;\">Shortly after the release of the iPhone X, Apple put out a <a href=\"https://support.apple.com/en-us/HT208191\" rel=\"noopener\">statement</a> about the OLED display used in the phone. The company noted that over time, “image persistence” or “burn-in” could appear. </span>Burn-in occurs when a static image is left on the screen for a long time and gets burned into the display permanently. For example, if you leave your iPhone X screen on for quite a while sitting on the home screen, the icon of an app may get burned into the screen, so much so that you can see its faint outline when watching a video.</p>",
            "<p><span style=\"font-weight: 400;\">Apple is being proactive here and warning users that burn-in could occur on the iPhone X in the future, as OLED screens are <a href=\"https://www.digitaltrends.com/mobile/google-addresses-pixel-2-xl-screen-burn-in/\">often prone</a> to the problem, but it’s not likely to happen to most people.</span></p>",
            "<p><span style=\"font-weight: 400;\">A number of users on <a href=\"https://www.reddit.com/r/iphone/comments/7bnann/iphone_x_screen_not_responsive_in_the_cold/\">Reddit</a> have reported that the iPhone X stops working when they are in cold temperatures. The problem typically only lasts a few seconds, though some users have experienced a longer freeze-up. Luckily, Apple is aware of the problem and is working on a software update that should address the issue.</span></p>",
            "<p><span style=\"font-weight: 400;\">Apple Insider </span><a href=\"http://appleinsider.com/articles/17/11/10/some-iphone-x-owners-report-mystery-green-lines-appearing-on-displays\"><span style=\"font-weight: 400;\">reports </span></a><span style=\"font-weight: 400;\">a small number of iPhone X users see a persistent green line on the left or right side of the screen. People who have experienced the issue say the line does not appear when you first turn on the phone, but after using it. Samsung, the manufacturer of the iPhone X display, had a similar problem with the <a href=\"https://www.digitaltrends.com/mobile/galaxy-s7-edge-problems/\">Samsung Galaxy S7</a>, leading people to believe this may be a hardware problem.</span></p>",
            "<p>Posts in the <a href=\"https://discussions.apple.com/thread/8289339\" rel=\"noopener\">Apple forums</a>, on <a href=\"https://www.reddit.com/r/apple/comments/7t58eh/iphone_x_speaker_crackling/\" rel=\"noopener\">Reddit</a>, and in the <a href=\"https://forums.macrumors.com/threads/iphone-x-crackle-speakers.2084292/\" rel=\"noopener\">MacRumors forum</a> describe a crackling noise when iPhone X speakers are at a high volume. The problem seems to be limited to a small number of phones and continues after the unit is replaced. A similar problem on the <a href=\"https://www.digitaltrends.com/mobile/common-iphone-8-problems-and-how-to-fix-them/\">iPhone 8</a> was attributed to a software issue and a patch was released to address the problem. It’s unclear whether the iPhone X problem is a software or hardware issue at this point but Apple is currently looking into it.</p>"
        ]
    },
    {
        "title": "\n\t\tThis $4,600 solar charger comes with an iPhone X attached\t",
        "author": [
            "\n\t\t\t\t\t\tTrevor Mogg\t\t\t\t\t"
        ],
        "text": [
            "<p>If you’re in the market for an <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a>, and pricey battery packs also happen to be your thing, then this flashy new offering from Caviar is a match made in heaven.</p>",
            "<p>The Russian accessory maker, which some of you will recall also brought us the gold-plated iPhone 5S engraved with <a href=\"https://www.digitaltrends.com/mobile/caviar-supremo-putin-gold-iphone/\">an image of Vladimir Putin’s face</a>, has just started selling the solar-powered “<a href=\"http://caviar.global/news-en/the-sales-start-of-iphone-x-tesla-with-an-infinite-charge-level-by-caviar.-the-first-copy-will-go-to-ilon-mask/?currency=USD\" target=\"_blank\" rel=\"noopener\">iPhone X Tesla</a>” (phone included) for the princely sum of $4,600. The first one off the production line is being sent to Tesla CEO Elon Musk as a gift, apparently.</p>",
            "<p>The handset comes with a solar panel attached to the back, and, according to the images, it looks almost as if it’s part of the phone. But it definitely isn’t. If you look closely, the handset bulks up a bit with the addition of the expensive case.</p>",
            "<p>The design features a carbon base with gold decorative elements and a battery charge indicator. It begins charging the iPhone with the press of a button.</p>",
            "<p>You’ll be pleased to know that to create the case, Caviar’s engineers carried out more than 100 tests “proving the effectiveness and safety of this system,” though unfortunately details regarding power specifications aren’t shown on the product’s page.</p>",
            "<p>The company says three people inspired it to build the iPhone X: Tesla “Steve Jobs, Nikola Tesla and <em>Ilon Mask</em>.” We’re betting on that being a spelling error rather than a mysterious inventor no one’s heard of yet.</p>",
            "<p>The production run has been limited to 999 units, with Caviar promising that “every smartphone has its own number.” We think we know what it means.</p>",
            "<p>The 64GB iPhone X Tesla costs 284,000 rubles ($4,600), while the 256GB model will set you back 299,000 rubles ($4,850). Add local taxes and customs duties for the final price.</p>",
            "<p>There’s no indication of any formal relationship between Musk’s electric-car company and Caviar, or indeed if the CEO is cool with Caviar using the Tesla name, but the iPhone X Tesla can now be yours if you have a bit of spare cash knocking around.</p>",
            "<p>Alternatively, if you’d prefer a solar charger for your phone that costs considerably less than the iPhone X Tesla, do take a moment to check out <a href=\"https://www.digitaltrends.com/cool-tech/best-solar-chargers/\">Digital Trends’ selection</a> of some of the best ones currently on the market. Prices start at $40 and top out at $265.</p>"
        ]
    },
    {
        "title": "\n\t\tApple will halve iPhone X production after limp holiday sales, report says\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p></p>",
            "<p>The initial estimates, set during the November launch window of the <a href=\"https://www.digitaltrends.com/go/3a1390a407196eecdfb07e2e78841104bbde8bbc/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Apple\">iPhone X</a>, were for 40 million units. According to Nikkei’s unsourced report, the company informed suppliers that the number has been revised to 20 million units after international sales during the holiday season were less than anticipated. Not long after the news broke on Nikkei, the stock market responded to the news and <a href=\"https://www.cnbc.com/2018/01/29/apple-falls-as-iphone-x-order-cut-reports-mount.html\">Apple’s share prices fell 1.9 percent</a> — a loss of $45 billion.</p>",
            "<p>This isn’t the first we’ve heard of issues surrounding the iPhone X. Last week, <a href=\"https://www.digitaltrends.com/mobile/iphone-x-end-of-life/\">an analyst from KGI Securities</a> predicted that the iPhone X would be permanently retired in the summer of 2018, following sales that were less than expected.</p>",
            "<p>Interestingly, production numbers for the iPhone 8, 8 Plus, and iPhone 7 have not been altered, with Apple still expecting to maintain a production target of 30 million units for the cheaper, less advanced models. This tallies with <a href=\"https://www.digitaltrends.com/mobile/iphone-x-sales/\">another previous report from analysts Cowen &amp; Co.</a> that customers preferred cheaper iPhones to the more expensive iPhone X and blamed the extremely high $999 iPhone X price tag as the reason that many Apple consumers were gravitating to the other models.</p>",
            "<p>The reason for the high price tag is likely for a handful of reasons. Apple’s iPhone has always been a premium brand but the iPhone X broke new ground even in that marketplace. <a href=\"https://asia.nikkei.com/Business/Companies/Apple-to-halve-iPhone-X-production-in-1Q\">Most commentators</a> point to the price of OLED displays as being a large part of the reason that the iPhone X’s price was so inflated above the market average. The OLED screen on the iPhone X was Apple’s first, and with mobile competitor Samsung being the only supplier who could supply enough displays for Apple’s needs, the iPhone giant would have likely been paying <a href=\"https://www.digitaltrends.com/mobile/samsung-makes-billions-from-iphone-x-displays/\">top dollar for each display</a>.</p>",
            "<p>Regardless of this news, Apple’s iPhones continued to sell well toward <a href=\"https://www.digitaltrends.com/mobile/iphone-8-iphone-7-sales-apple/\">the tail end of 2017</a>. While $45 billion may also be a large sum of money, it’s not a massive relative drop for Apple, which is on track to becoming the <a href=\"https://www.digitaltrends.com/mobile/apple-1-trillion/\">world’s first company valued at $1 trillion</a>.</p>"
        ]
    },
    {
        "title": "\n\t\tBuy any iPhone X, XS, or XS Max from Verizon and score an iPhone XR totally free\t",
        "author": [
            "\n\t\t\t\t\t\tLucas Coll\t\t\t\t\t"
        ],
        "text": [
            "<p>This year has been a pretty good one for flagship phones – 2018 has seen the release of some great mobile devices, from <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-note-9-review/\">Samsung’s Galaxy Note 9</a> to the impressive <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-3-review/\">Google Pixel 3</a>. Apple also got in on the action, revealing its new flagship lineup which includes the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-review/\">iPhone XS</a>, the larger <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-max-review/\">XS Max</a>, and one surprise that few saw coming – the more budget-friendly iPhone XR.</p>",
            "<p>It’s no secret that Apple hardware is expensive. The iPhone X turned heads last year with its launch price of $1,000, and the iPhone XS isn’t any cheaper. Apple took a surprising turn when it also revealed a third device this year, the iPhone XR, with a starting price of only $750, and Verizon customers (or those willing to switch) can even score one for free. Read on to find out how.</p>",
            "<p>Brand-name flagships are typically released in two variants: A standard-sized smartphone and a second oversized one with a larger display, and the iPhone XS and XS Max followed this model. It seems that the designers at Apple headquarters have been paying attention to consumer demand for less expensive flagships, though, and so we saw the Cupertino, California-based company also roll out the iPhone XR as a third and more affordable alternative to the very pricey XS.</p>",
            "<p>The iPhone XR’s hardware isn’t quite as good as that of its beefier (and more expensive) siblings, but it still boasts <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xr-review/\">excellent flagship-like specs for a competitive price</a>. If you’re a Verizon customer or are looking to switch service providers, then the best way to score a deal on the new iPhone XR right now is the carrier’s ongoing “buy one, get one” iPhone offer. This promotion gives you $750 toward a new iPhone XR when you purchase an <a href=\"https://www.digitaltrends.com/go/12db152366f271fa2c867478e0a0d31ed86a08b7/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Verzion\">iPhone X</a>, <a href=\"https://www.digitaltrends.com/go/9d63fb26473072ed4060d103d17ea8182605a3a1/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Verizon\">iPhone XS</a>, or <a href=\"https://www.digitaltrends.com/go/b597acfbaaf7403024c576cd284858a21926d0e3/\" rel=\"nofollow\" target=\"_blank\" class=\" h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Verizon\">iPhone XS Max</a>.</p>",
            "<p>Note that this discount comes in the form of a rebate via bill credits, so you’ll need to buy both phones first and then you’ll receive the cost of the iPhone XR ($750) back over 24 months. This $750 rebate covers the price of the standard 64GB iPhone XR, but you can also apply it toward a 128GB or 256GB iPhone XR – just bear in mind that you’ll be on the hook for the extra cost of the models with extra storage.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/03c926607a7326fc636a3fb1761e65e7cba576ae/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Verizon\">Verizon</a></p>",
            "<p><a class=\"twitter-follow-button\" href=\"https://twitter.com/dealsDT?ref_src=twsrc%5Etfw\">Follow @dealsDT</a></p>",
            "<p>Looking for more <a href=\"https://www.digitaltrends.com/deals/\">great deals</a>? Find <a href=\"https://www.digitaltrends.com/dtdeals/best-iphone-deals/\">iPhone deals</a>, <a href=\"https://www.digitaltrends.com/dtdeals/best-apple-watch-deals/\">Apple Watch deals</a>, <a href=\"https://www.digitaltrends.com/dtdeals/best-cheap-macbook-deals/\">MacBook deals</a>, and more on our <a href=\"https://www.digitaltrends.com/dtdeals/black-friday-deals/\">Black Friday deals</a> page.</p>"
        ]
    },
    {
        "title": "\n\t\tThe best iPhone X battery cases\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.apple.com/iphone-x/\">iPhone X</a> has an incredible OLED display, gorgeous edge-to-edge design, and the exceptionally useful Face ID. But the battery life may not be up to scratch if you’re a heavy user. What if you’re away from the charger for a while? With so many amazing features, you want to use your <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a> without worrying about battery life. There’s an easy way to make sure you never come up short — just invest in a battery case for when you need power the most.</p>",
            "<p>We’ve scoured the internet for the best iPhone X battery cases, and narrowed down the list to the ones you can find below. So whether you want the slimmest case available, or just needs tons of power, we have you covered. Never worry about power again!</p>",
            "<p>Battery cases are bound to add some bulk to your slim phone because adding extra battery also means extra mass. This battery case from ZeroLemon adds an extra 12 hours of talk time to your iPhone X, and thanks to the slim profile, doesn’t add too much bulk. It’s easy to attach, with a slide-and-lock design, and a series of four LEDs that let you know the case’s charge level. Charging the case and syncing your phone to your PC is possible with a USB-C cable, so you won’t need to remove the case to charge it. ZeroLemon has also upgraded the original battery case and added a screen protector. The downsides? The additional chin at the bottom of the case ruins your phone’s edgeless display, it blocks wireless charging, and there’s no audio via wired headphones — Bluetooth only. Still, for $40, this provides a lot of extra juice.</p>",
            "<p style=\"text-align: center;\"><strong></strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/5d95df475d0690acd173a712c5b708708e91d17a/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a> <a href=\"https://www.digitaltrends.com/go/26b0dda053dd6c7b7f744fd72c5692776c6cb8df/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Zero Lemon\">ZeroLemon</a></p>",
            "<p>Another great choice for an all-around battery case, this wireless charging-enabled Alpatronix case adds a great amount of extra capacity in a subtle shell. Specially programmed to charge the phone first and the case second, it’s perfect for anyone who can’t bear to give up their new wireless charger for extra battery capacity. The 4,200mAh-rated battery should provide at least 12 extra hours of talk time, and the design will provide some protection against drops and bumps. The downsides? The case charges by Micro USB connection, and while you can still connect to your PC with that, that means no Lightning headphones. It’s also fairly bulky, adding a sizeable chin to the bottom of the device. Still, this is a solid battery case — oh, and it comes with a free <a href=\"https://www.digitaltrends.com/mobile/best-iphone-x-screen-protectors/\">iPhone X tempered glass screen protector</a> too.</p>",
            "<p style=\"text-align: center;\"><strong></strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/5d0557590422bd1e7746d9113d6ce51543d446cf/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>An increase in bulk and weight is one of the major downsides to using a battery case. Batteries are heavy, and it can feel like such a shame to shackle a device as light and thin as the iPhone X with such added heft. <a href=\"https://www.digitaltrends.com/mobile/best-portable-battery-chargers/\">Convenient power banks</a> exist for that reason, but attaching one can make your phone harder to use. Thankfully, Feekea has come up with a battery case with the added convenience of a power bank. This case comes in two parts: A thin, protective case, and a power bank that attaches magnetically to the case — and <a href=\"https://www.digitaltrends.com/mobile/does-wireless-charging-degrade-your-battery-faster/\">charges your phone wirelessly</a>. An extra 5,000mAh  capacity is a lot, and it should add up to 27 hours of extra call time. The power bank itself charges by Lightning cable — so you only need to carry the one charging cable for your phone and case. The case comes with a raised bezel to protect your phone, as well as a kickstand. This is a great case if you like battery cases, but don’t like the added weight and heft.</p>",
            "<p style=\"text-align: center;\"><strong></strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/6d5d0c6d8046b16825d494d613b87c0d71e61a4d/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>The iPhone X is a remarkable phone, but it’s probably best known for the bezel-free, chin-less design that sets it apart from its peers. When looking at battery cases, you might notice that a lot of them add an unattractive extra chin to the bottom of the device. That’s to house the connection to the Lightning port most of the time, but it’s still not something you want when you buy a phone like the iPhone X. The Tech Care battery case avoids that chin, and adds an amazing 6,000mAh of extra battery in the process — enough for an additional 28 hours of talk time. It’ll charge with your existing Lightning cable, but unfortunately will only support Bluetooth headphones. Despite that, it still adds 200 percent extra battery and displays your remaining charge on the rear side of the case with a set of LEDs that form a little smile. Aww.</p>",
            "<p style=\"text-align: center;\"><strong></strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/1703f08c4a964f5cc8236c0d2deed816dfcb8330/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Batteries can be fragile and volatile things, so we’d usually never recommend relying on a case’s protective qualities where a battery is concerned. However, this rugged battery case from Smiphee certainly seems to break that mold. It utilizes a more rugged design than most battery cases, with plenty of edges to enhance grip and elevate your phone away from grit and dirt on surfaces. There’s also a series of rugged airbags on each corner to help withstand impacts. Most importantly, it comes with 4,000mAh of extra power — enough for an additional 21 hours of talk time. It charges via Lightning cable, just like your phone, and it doesn’t restrict you to just using Bluetooth headphones, so feel free to plug in your Lightning headphones at any time.</p>",
            "<p style=\"text-align: center;\"><strong></strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/df8f30e76161e2982b93cc3ebb31ed3610597c5c/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Waterproofing isn’t something you’d normally expect from a battery case, but here we are looking at Vapesoon’s waterproof battery case. We’ll clear something out the way first, though — it’s IP67-rated, so it has the same level of water-resistance you already get in the iPhone X. You can’t take it snorkeling, but it should be fine if it gets dropped in the bath or in a puddle — just make sure to fish it out and dry it off properly afterwards. The case adds a decent 3,400mAh capacity to your iPhone X — about 20 hours talk time — and though it isn’t the slimmest case on this list, it adds some decent drop protection too. You can charge wirelessly through it, and it’ll let you charge and sync through the case as well.</p>",
            "<p style=\"text-align: center;\"><strong></strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/f811950972b3a2151983351c362c5ec5817cb26e/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>This is the most expensive case on the list — but there’s a good reason for that. <a href=\"https://www.encased.com/\">Encased</a>‘s AudioMod comes with a 4,600mAh battery, which Encased claims adds 36 hours of talk time and charges with an included MicroUSB cable. The big draw here though is the restoration of an old classic, which some probably still miss — the 3.5mm headphone jack. Even better, the AudioMod even comes with a built-in DAC to boost your headphone’s prowess. The case itself is slim and lightweight — though it does add the dreaded battery case chin — and it comes with a series of LEDs on the back to make sure you know when it’s time to recharge. If you miss the humble headphone jack and need that extra boost of power, the AudioMod is an expensive piece of kit, but one that might be worth it.</p>",
            "<p style=\"text-align: center;\"><strong></strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/20971c1f70993afc755b062ec7674f868a0a48bd/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>"
        ]
    },
    {
        "title": "\n\t\tApple iOS 12 review\t",
        "author": [
            "\n\t\t\t\t\t\tBrenda Stolyar\t\t\t\t\t"
        ],
        "text": [
            "<p>Last year’s <a href=\"https://www.digitaltrends.com/mobile/ios-11-review/\">iOS 11 update</a> added a little more customizability into the iPhone and iPad. It changed the way we interact with our Apple devices, but not significantly. <a href=\"https://www.digitaltrends.com/mobile/ios-12-features-release-date/\">iOS 12</a> takes it all to the next level. We’ve spent most of the summer using Apple’s beta program, and from grouped notifications to Siri Suggestions, iOS 12 helps make the iPhone a little more intelligent, and fixes a few pain points we’ve had with the operating system.</p>",
            "<p>With the new OS, behavior on your iPhone is significant to the way the operating system works. As with any artificial intelligence, the more you use it, the better it will work. Since you use your iPhone on a daily basis, it doesn’t require extra effort either. Slowly, but surely, you’ll find suggested apps to use, people to text back, reminders to attend or book certain events, and more. The process of training your iPhone to adapt to your lifestyle is simple with iOS 12.</p>",
            "<p>Apple’s primary goal with iOS 12 is to deliver an OS that’s faster and more responsive across all devices — new and old — which is why the update <a href=\"https://www.digitaltrends.com/mobile/ios-12-compatible-devices/\">works on more iPhone and iPad devices</a> than ever before. This means ramping up CPU performance to its highest state for performance and ramping it down to preserve battery life. Other improvements include animations that are smoother and faster.</p>",
            "<p>You should notice decent performance boosts on older iPhones — we certainly did. We installed the beta on an iPhone 6S and an iPhone 7 Plus, and performance was fluid and fast. If you’re still having issues, it could be <a href=\"https://www.digitaltrends.com/mobile/apple-iphone-battery-performance-dip/\">due to your battery efficiency</a>. You may want to take your device to an Apple Store and replace the battery.</p>",
            "<p>With each iOS 12 beta update, we did see a slight improvement with battery life. On the last developer beta, our 7 Plus managed to last a little bit longer with 27 percent remaining at 5:45 p.m. — lasting us throughout the entirety of a typical work day.</p>",
            "<p>With the final version of iOS 12, we found that our battery lasted only a little bit longer. After taking it off the charger at 8:30 a.m., it was at 86 percent by 10 a.m. By noon, it was at 56 percent (having taken a phone call) and at the end of our workday at 6 p.m it was at 16 percent. To be fair, it’s definitely a step up from when we used our iPhone 7 Plus with iOS 11 last year — which would reach about one percent by the early afternoon.</p>",
            "<p>But with Apple’s new A12 Bionic chip featured on its latest lineup of iPhones, it shouldn’t wear down the battery nearly as much. Apple says you’ll get 30 minutes more time from the iPhone X on the XS while the XS Max will have 90 minutes more. As for <a href=\"https://www.digitaltrends.com/mobile/apple-iphone-xr-news/\">the iPhone XR</a>, it should last an hour and a half more than the iPhone 8 Plus.</p>",
            "<p>After taking our iPhone XS off the charger at 7:45 a.m. at 100 percent, it was at 57 percent by 4 p.m. — this was after using it for text messaging, social media, and listening to Spotify while getting ready for the day. It was at 14 percent by the time we were getting ready for bed at 9 p.m. (having made a few quick phone calls), meaning it lasted us almost 12 hours before having to put it back on the charger. For a long day filled with notifications, social media, phone calls, and music streaming, we’d say a full day worth of battery life is plenty.</p>",
            "<p>Every iPhone or iPad user is familiar with the endless list of notifications on the lockscreen. Scattered text messages, news bulletins, social media notifications, emails — it’s tough navigating and staying on top of alerts. If the same person texted you multiple times, you’d have to scroll up and down to piece together what was said, or simply jump into the app.</p>",
            "<p>Thankfully, Apple is taking a feature from Android we’ve loved for a long time — <a href=\"https://www.digitaltrends.com/mobile/ios-12-notifications-update/\">grouped notifications</a>. Everything is neatly organized in stacks based on the type of notification or app. It dramatically improves the iOS experience, and allows us to look at each stack based on importance rather than having to sort through them all.</p>",
            "<p>You can also choose which notifications you want to turn off from the lockscreen, which is a nice way to control the barrage of notifications throughout your day. When you receive a notification, swipe to the left and tap on<em> Manage</em>, which allows you to turn them off completely. Alternatively, you can tap on <em>Deliver Quietly,</em> and the notification will appear in the Notification Center but not on the lockscreen.</p>",
            "<p>We can’t imagine going back to the way iOS used to handle notifications; it’s so much less work to sift through them now.</p>",
            "<p>When Do Not Disturb was first introduced, there weren’t any customization options other than the ability to toggle it on and off. With iOS 12, it’s now possible to set specific time frames for it to automatically kick in and turn off without having to worry about doing it manually.</p>",
            "<p>The one feature we were most excited to try was Do Not Disturb during bedtime mode, which prevents notifications from popping up on the lock screen during scheduled times. When it’s turned on, a notification sits on your lockscreen letting you know it’s on, and that all notifications and calls will be silenced and hidden. We’ve grown quite fond of it.</p>",
            "<p>At 10 p.m. each night, our display goes dim and stays silent throughout the entire night until 7 a.m. the next morning. We’re trying to fall asleep, and not having to see our display flashing or hear our phone vibrating is relieving — we look forward to it every night. It has also kicked our habit of constantly checking notifications throughout the night.</p>",
            "<p>When bedtime Do Not Disturb ends, the “good morning” greeting that pops up on the lock screen with the weather is a nice touch, and a good way to start the day.</p>",
            "<p><a href=\"https://www.commonsensemedia.org/technology-addiction-concern-controversy-and-finding-balance-infographic\">Smartphone addiction</a> has been a growing topic of discussion over the years, but more so in 2018. Both Apple and Google <a href=\"https://www.digitaltrends.com/mobile/apple-screen-time-and-google-digital-wellbeing/\">have added tools</a> in their respective operating system updates this year to address increasingly high smartphone usage. iOS 12 adds a new section in the Settings app called Screen Time. It offers a summary of your smartphone use, and the ability to set time limits on specific apps.</p>",
            "<p>We were happy to see the feature and were surprised to see our smartphone usage statistics — such as how many times we pick up our phone per hour — but the curiosity quickly wears off. It didn’t really make us want to change our habits. Sometimes we’d receive alerts that provide a summary of our Screen Time for the week. Call it denial, but we rarely ever tapped on it to view the results. It’s become a notification that we almost always clear from our lockscreen instead.</p>",
            "<p>With App Limits — which allow you to set a limit for how long you can use an app — it’s extremely easy to override the limit. The option to either turn off the restriction or delay it is offered to you via a pop-up, without having to take extra steps to get to your Settings.</p>",
            "<p>We did try to set App Limits to restrict our social media usage, but it only worked for about 10 minutes before we gave up on our attempt to stay off Instagram. It’s too easy to ignore App Limits.</p>",
            "<p>When we first started using Screen Time, we wanted to set limits for apps individually like on <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\">Android 9 Pie</a>, rather than have them bundled together by category (Social Media, Entertainment, Productivity, etc.). But after using the feature for a while, grouping all the apps together is the more productive approach. That way, you can attempt to condition yourself to stay off all social media apps or all entertainment apps. If you’re set on specific apps that you absolutely need at all times, you can add them to the “Always Allowed” category.</p>",
            "<p>The “Downtime” feature allows you to schedule a window of time where notifications are disabled — similar to Do Not Disturb at bedtime. The idea is to make sure work-related apps don’t disturb you when you’re at home, for example, and it works well enough. As with App Limits and Screen Time, Downtime requires personal restraint, because otherwise it’s easy to continue your old habits.</p>",
            "<p>We do wish we could also schedule a window of time with App Limits, the way we can with Downtime. Right now, all you can do is customize the days you want app limits to turn on and the amount of time you’d like for it to be enabled. It’d be more useful if we could set it to specific times each day that we know we don’t want to be on certain apps.</p>",
            "<p>Siri is finally a little more useful in iOS 12. With Siri Shortcuts, the voice assistant is capable of much more via quick actions that can all be assigned through the new Shortcuts app. There isn’t much you can do at the moment other than customize voice commands to trigger a specific action. For instance, by telling Siri our home address (or whatever phrase you want), we can have the Lyft app launch immediately.</p>",
            "<p>One of our favorite improvements to Siri is Siri Suggestions. Since we already use the Spotlight Search tool on a daily basis to access certain apps, suggestions conveniently show up underneath and they’re genuinely helpful.</p>",
            "<p>If we’re having a conversation with a friend via text and either haven’t responded or tend to text them more often than others, Siri suggests to send a message. When we missed a phone call from a family member, we received a suggestion to make a call back.</p>",
            "<p>We’ve become so reliant on Siri Suggestions, especially on extra busy days when there’s a lot on our mind, and Siri gives us that helpful reminder to call our parents back or answer a friend’s text message.</p>",
            "<p>When planning lunch or dinner plans via iMessage, it’ll also suggest adding the event to your calendar. These buttons are one click actions, so it doesn’t require much effort to follow through on Siri’s suggestions, which is handy.</p>",
            "<p>You can also customize where you’d like Siri Suggestions to appear. Go to <em>Settings &gt; Siri &amp; Search</em> and scroll towards the bottom. From there, you can choose to toggle off <em>Suggestions in Search</em>, <em>Suggestions in Look Up</em>, or <em>Suggestions on Lock Screen</em> — all depending on your preference.</p>",
            "<p>Even though Siri’s ability to transcribe hasn’t gotten any better in iOS 12, we’re happy to see it’s able to make itself useful in a meaningful way.</p>",
            "<p>Apple <a href=\"https://www.digitaltrends.com/mobile/how-to-use-the-measure-app-in-ios-12/\">introduced a new app called Measure</a>  — an app that utilizes ARKit 2.0 to identify the distance between objects and spaces in the real world with the phone’s camera. While the app still recommends to use a tape measure or measuring stick for precise measurements, we found it to be quite accurate if you need a rough estimate. It’s one of those apps you’ll only use for specific instances, though.</p>",
            "<p>The Photos app also received a few upgrades. With a new “For You” tab, photos are all organized based on highlights. Whether it was a concert in Philadelphia or a trip to Spain, the tab neatly places them into albums to look through. What we like more is the improved search, where we can look up specific venues or places to find our photos much faster.</p>",
            "<p>A few other apps got some love in this update. The Stocks app, which most people probably uninstall, now has Apple News built in. For those interested in finance, the redesign makes it easy to check on stocks while simultaneously reading through the news of the day. We also like how sleek it looks in comparison to the somewhat bland Stocks app before it.</p>",
            "<p>The Voice Memo app also has a new look that makes it more  contemporary. With the new version, the record button is at the bottom while past recordings are listed at the top — which makes it more comfortable and intuitive to use. You can also swipe up so the recorder is full screen, where there’s also the option to trim the audio.</p>",
            "<p>Following the abundance of iMessage features Apple released with iOS 10, we were bummed that iOS 11 failed to include any fun features. Thankfully, iOS 12 redeems itself with a few new capabilities. Not only can you create a Memoji of yourself through a quick and simple process, but you can also use them as stickers within the camera app on iMessage. Granted, you will need an iPhone X or later to utilize this feature.</p>",
            "<p>For those stuck on iPhone 8, 8 Plus, or earlier devices, there’s still fun you can have through iMessage. Tap the star icon in the camera app, and it’ll automatically bring you to selfie mode and let you to add stickers (depending on the sticker packs you download), text, filters, and shapes to your photos. It’s very similar to Snapchat or Facebook Messenger’s camera, and it’s handy to have built into iMessage.</p>",
            "<p>One minor tweak we’ve finally gotten used to is the Photos app, which is now located in the app drawer in iMessage. Rather than having to send photos through iMessage by tapping on the camera button and then on your photo album, iOS 12 makes it easier to access with one less step. The drawer will show all of your recent photos, and tapping on ‘All Photos’ in the right-hand corner will bring you to your entire photo album within the iMessage window to easily choose and send one over.</p>",
            "<p>Those with an iPhone X, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-xs-review/\">iPhone XS</a>, XS Max, or XR, also now have access to Animojis and iOS 12’s new <a href=\"https://www.digitaltrends.com/mobile/how-to-make-a-memoji/\">Memojis</a>. Using the TrueDepth camera on the front, you can now create Animojis that look just like you. You have the ability to customize the physical traits like eyes and hair, along with accessories like earrings and glasses. Since it mirrors your muscle movements, you can record 30-second videos with your Memoji to then send and replay within iMessage conversations.</p>",
            "<p>Let’s face it, memorizing all our passwords for the tons of accounts on our phone can be tough. With iOS 12, the new Passwords &amp; Accounts section allows you to save any password you’d like.</p>",
            "<p>Any password you save to your phone will autofill the username and password fields — that way, you don’t have to type it in manually or run the risk of forgetting it completely.</p>",
            "<p>Google introduced a similar feature in Android 8 Oreo, and we’re thrilled Apple has done the same. It’s convenient to have it built into the operating system. Any time we’re typing in a password, a notification appears that allows us to either save a new one or use an existing username and password — all with one tap.</p>",
            "<p>All of your passwords are logged in one place within your Settings and the list is neatly organized whenever you want to reference it.</p>",
            "<p>With iOS 12, Apple brings along necessary improvements that were missing in <a href=\"https://www.digitaltrends.com/mobile/ios-11-review/\">iOS 11</a>. This time around, the changes are much bigger — with more complex features that help make the user experience more fluid.  Thanks to machine learning, the iPhone learns your behavioral patterns and adapts over time, making it easier to get simple things done.</p>",
            "<p>But it also helps remind you that it’s important to take some time away from your phone as well. While its up to you to keep up with setting boundaries, Screen Time and Do Not Disturb are extremely useful tools in iOS 12 that can help you manage time on your smartphone better.</p>",
            "<p>On the iPad, iOS 12 requires using the exact same gestures as you would on the iPhone X. According to rumors, it’s been said that Apple does plan on removing the home button from the iPad in the future, so the gestures might make more sense soon. But on our iPad Mini, it felt a little foreign at first — especially since we were used to our iPhone 8 Plus.</p>",
            "<p>After a while though, we found ourselves accustomed to navigating the device. Without a notch, it might be tough to pinpoint exactly where to swipe down but the display is responsive enough that as long as you swipe down to the right or left, it’ll pull down the specific menu. As with the iPhone X, you’ll have to swipe down on the left side of the device to access the notification page and on the right side for the Control Center. Overall, the OS felt fluid on the iPad Mini and we didn’t find there was any lag or performance issues.</p>",
            "<p>To <a href=\"https://www.digitaltrends.com/mobile/how-to-get-ios-12/\">download iOS 12</a> on your device, simply go to <em>Settings &gt; General &gt; Software Update</em>. You may have to clear out some data first to allow it to download the update. Don’t forget to back up to the cloud, and make sure your device is compatible.</p>",
            "<p><em>Updated October 11: Added updated battery information and using iOS 12 with the iPad</em></p>"
        ]
    },
    {
        "title": "\n\t\tApple raked in more than half of all global smartphone revenue last quarter\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>Reports may suggest that Apple wasn’t all that impressed with sales of the iPhone X toward the end of last year, but in the last quarter, it hit a pretty massive milestone when it comes to smartphone sales. According to a <a href=\"https://www.strategyanalytics.com/strategy-analytics/news/strategy-analytics-press-releases/strategy-analytics-press-release/2018/02/15/strategy-analytics-apple-iphone-takes-huge-51-percent-share-of-global-smartphone-revenues-in-q4-2017#.Wocd1hPwaF1\" target=\"_blank\" rel=\"noopener\">report from Strategy Analytics</a>, Apple raked in more than half of all smartphone market revenue.</p>",
            "<p>Apple took in $61.4 billion (51 percent) of smartphone revenue, followed very distantly by Samsung. Samsung’s $18.9 billion in smartphone revenue last quarter, which ended December 31, equates to around 15.7 percent. In third place is Huawei, which made $8.4 billion (7 percent). After that, Strategy Analytics simply lists every other company as “others”; those companies account for 26.2 percent of the market.</p>",
            "<p>Contrary to previous reports, and according to Strategy Analytics, the huge revenue was due to “solid demand” for the iPhone X. The average price of the iPhone went up to a hefty $796, up from $695 in the same quarter last year. That makes sense considering the $1,000 base price of the iPhone X, which is Apple’s new flagship model.</p>",
            "<p>China in particular is an increasingly important market for Apple. While Android fans in China have a range of companies to choose from, those who buy iPhones in the country are generally dedicated Apple fans, according to a new <a href=\"https://www.fastcompany.com/40531950/iphone-x-remains-strong-in-china-but-mid-range-chinese-phones-hurt-overall-iphone-sales-says-analyst\" target=\"_blank\" rel=\"noopener\">report from Fast Company</a>. Still, only 3 percent of activated iPhones in China are the iPhone X. Just 2.63 percent are the iPhone 8 Plus, and 1.36 percent are the iPhone 8. That means the vast majority of people are still using older iPhone models — though that’s to be expected.</p>",
            "<p>According to a <a href=\"https://www.fool.com/investing/2018/02/15/apple-inc-just-hit-a-ridiculously-impressive-miles.aspx\" target=\"_blank\" rel=\"noopener\">report from The Motley Fool</a>, Strategy Analytics’ revenue forecast is slightly different from Apple’s. Strategy Analytics notes Apple made $61.4 billion, while Apple’s official figures come in at $61.6 billion — though that’s apparently because Strategy Analytics’ report doesn’t count wholesale revenues.</p>",
            "<p>Other companies are still holding their ground. Motley Fool notes that Huawei is gaining steam, thanks largely to its aggressive release of low-cost devices. Of course, Huawei could be gaining even more steam if it was selling phones in the U.S. — but U.S. lawmakers and law enforcement agencies have <a href=\"https://www.digitaltrends.com/mobile/senate-intelligence-committee-huawei-zte-news/\">expressed concern</a> with Huawei phones because of Huawei’s strong relationship with the Chinese government.</p>"
        ]
    },
    {
        "title": "\n\t\tHigh cost of OLED displays spells trouble for Samsung\t",
        "author": [
            "\n\t\t\t\t\t\tEric Brackett\t\t\t\t\t"
        ],
        "text": [
            "<p>Apple and Samsung are major rivals in the smartphone space, so one might expect that the latter would be pleased to hear of the weak demand for the iPhone X. However, it turns out that Samsung <a href=\"https://www.digitaltrends.com/mobile/samsung-makes-billions-from-iphone-x-displays/\">provided the OLED displays</a> for the iPhone X, and Nikkei Asian Review reports that those low sales have sent the South Korean electronics giant <a href=\"https://asia.nikkei.com/Business/Trends/OLED-panel-glut-looms-as-Apple-slashes-iPhone-X-production\" target=\"_blank\" rel=\"noopener\">looking for new buyers</a>.</p>",
            "<p>Samsung increased its production of the OLED panels in order to meet Apple’s expected demand, but lackluster sales of the iPhone X have left Samsung with a surplus of OLED panels and few buyers. Samsung was likely hoping that other smartphone makers would transition to OLED displays, but many are choosing to go with the less expensive LCD displays.</p>",
            "<p>Many of the major Chinese smartphone companies focus on the mid-range market, and few of them can afford to make extensiveuse of OLED displays. Roughly 5 to 10 percent of smartphones made by Oppo and Vivo make use of OLED displays. The problem is, once again, the cost. These panels can cost, on average, 40 percent more than LCD displays. Given that the budget and mid-range smartphone markets often compete on price, it is understandable that many would prefer to go for the cheaper panels.</p>",
            "<p>Cost appears to be the major issue for Samsung’s OLED displays. The panels offer bright colors and can be bent to narrow a phone’s bezels, but these displays can cost more than a $100, which is more than twice what the company’s LCD displays cost. The high price of the OLED displays were part of the reason the iPhone X retailed for $1,000.</p>",
            "<p>The expensive OLED displays are also causing trouble for Samsung’s own smartphone division. Not all of its phones make use of the pricey panels, but its flagship models do. IHS Market, a British research firm, noted that Samsung’s internal use of OLED panels declined in 2017.</p>",
            "<p>Worst of all for Samsung is that its market dominance may be coming to an end. The company currently controls 95 percent of the OLED market, but that is likely to change in the coming years. LG Display is preparing to increase production of its own OLED displays. as are Chinese rivals BOE Technology Group and Tianma Micro-electronics.</p>"
        ]
    },
    {
        "title": "\n\t\tIncreased LCD production hints at more affordable iPhones for 2018\t",
        "author": [
            "\n\t\t\t\t\t\tEric Brackett\t\t\t\t\t"
        ],
        "text": [
            "<p>When Apple announced the iPhone X, it was met with a bit of a mixed reaction. On one hand, everyone thought the phone looked amazing, but the $1,000 price tag was a bit much. Despite the phone selling very well during the holiday season, Apple appears to be poised to<a href=\"https://www.wsj.com/articles/iphone-x-pensive-apple-looks-to-keep-phones-with-cheaper-displays-1529051835\" target=\"_blank\" rel=\"noopener\"> focus its efforts on more affordable alternatives this year</a>. The Wall Street Journal has reported that Apple’s supply chains are producing a higher number of LCD panels which are used in Apple’s less expensive smartphones.</p>",
            "<p>Apple itself has not directly commented on its plans for the future and has said that the iPhone X was its best-selling smartphone for the first three months of 2018. That being said, many analysts believe that less expensive LCD-based phones make up the majority of Apple’s sales.</p>",
            "<p>This doesn’t mean that Apple is abandoning the OLED displays found in the iPhone X. In fact, it is widely believed that two of this year’s new iPhones will feature OLED panels, whereas only one will make use of an LCD display. Despite this, it has been reported that Apple’s suppliers are producing more LCD displays than OLED displays because the company expects that most consumers will prefer the more affordable option. The OLED panels were a major factor in the high price point of the iPhone X, with some analysts saying they cost about $100 compared to $40 LCD displays used in the iPhone 8.</p>",
            "<p>Regardless of which option consumers choose, they will likely be getting a similar phone to last year’s iPhone X, as it is believed that Apple intends to use the X’s design as the basis for 2018’s smartphones.</p>",
            "<p>If that is true, then it may be the end of the line for the design used by the iPhone 8, which has been a staple since the iPhone 6. At this point the design, while certainly iconic, does feel a bit dated. It can often be difficult to tell the iPhone 8 from the 7 or the 6, which makes this change a rather welcome one. Regardless of where you stand on the iOS v Android debate, there can be little doubt that the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X is one of the best looking smartphones on the market</a>.</p>"
        ]
    },
    {
        "title": "\n\t\tThe best iPhone X screen protectors\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>The <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a>, Apple’s redesigned iPhone, has a speedy <a href=\"https://www.digitaltrends.com/mobile/apple-iphone-x-news/\">A11 Bionic</a> processor, dual rear cameras, and a state-of-the-art facial recognition system — <a href=\"https://www.digitaltrends.com/mobile/apple-iphone-x-news/\">Face ID</a> — that’s more secure than <a href=\"https://www.digitaltrends.com/mobile/apple-iphone-x-news/\">Touch ID</a>. While it’s no longer the top-of-the-line iPhone, it’s still incredibly advanced, and you probably spent a lot of money on it.</p>",
            "<p>But iPhones are always an investment, and there’s no better reason to pick up a durable screen protector for your iPhone X. Apple’s flagship is <a href=\"https://www.digitaltrends.com/mobile/how-rugged-is-your-phone/\">IP67 rated</a> for water and dust-resistance, but the company makes no claims the glass back and front will survive drops on concrete, tile, or less forgiving surfaces. Luckily, accessory makers are more than happy to fill the need. Check out our list of the best iPhone X screen protectors and where to buy them. When you’re finished, don’t forget to check out our guide to the <a href=\"https://www.digitaltrends.com/mobile/best-iphone-x-cases/\">best iPhone X cases</a>.</p>",
            "<p>Tired of people looking over your shoulder at your phone? Maybe you want to use your mobile banking without worrying about watchers? Maybe you’re an international super-spy on a mission to save the head of KFC? Regardless of why, if you want to guard your privacy, you can get a screen protector that helps. This tempered glass screen protector from MaxBoost appears fully transparent when viewed from the front, but will block out vision from the sides of the device, keeping straying eyes away from your precious data. Plus, it offers the same benefits as normal glass screen protectors, with added scratch and drop-resistance, and an oleophobic layer to keep your screen clean. However, it does reduce your screen’s brightness, so you’ll need to crank it up.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/4aba101851603ec7facc00d305d52c98d37b56cb/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Anker is well known for a range of phone accessories including Bluetooth speakers, cables, and chargers, but recently has become known for its new protective options, including its screen protectors. These tempered glass screen protectors (it’s a twin pack) curve slightly to protect the front of your phone, as well as the slightly curved edge, but also don’t interfere with most cases you might use to protect the rest of your iPhone X. The GlassGuard also comes with Anker’s DoubleDefence tech, reinforcing it even further. Although there’s two in the pack, Anker wants you to get it right first time, so there’s an installation guide included too.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/6ab459d7436d950c832a8f850d4d669f9c150e09/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>If you work in a dusty or dirty environment, then you might not care too much about the possibility of a broken screen, but might worry more about keeping it clean. That’s where something like Supershieldz comes in. With a massive six pack on offer, each of these film screen protectors costs a buck each, making them perfect for throwaway protection against scratches and dirt. Just because they come in a big pack doesn’t mean they’re individually weak though — each protector is made from Japanese PET film, provides great clarity, and doesn’t reduce your touchscreen responsiveness.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/ae40d79921bde8c7c45989ac7fa271c7b6e06afd/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Case-Mate’s Glass Screen Protector is designed from the ground up to protect the iPhone X from impact damage. It boasts a 9H hardness rating and low profile that won’t mess with the touch responsiveness of the iPhone X’s screen or 3D Touch haptics. Case-Mate’s anti-fingerprint technology prevents smudges, and a multi-layer design guarantees a high degree of scratch resistance. It does have a few downsides — Case-Mate hasn’t been able to tailor it to cover the edges of the phone — but otherwise it’s a great screen protector for a great price.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/4af6fe8f0417d9801504d32772c57f1c03b0c033/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Case-Mate\">Case-Mate</a> <a href=\"https://www.digitaltrends.com/go/e37affa55c02538eed8a16bac44e61863705cc40/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Tozo’s super-thin Tempered Glass Screen Protector stretches the entire length of the iPhone X’s front, covering not just the display but the bezels around the screen. That makes it exceptionally good at protecting against falls, bumps, and scratches, and at resisting fingerprints (thanks to an oleophobic coating). Careful cutouts around the front-facing cameras and depth sensors let the iPhone X’s Face ID facial recognition see you clear as day.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/9e6651bab14b93b50984715fa2c00da6c5759926/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Tech21’s new iPhone X screen protector collection has something for everyone. Take the Impact Shield for example: It has a self-healing polymer surface layer that smooths over new scratches. Tech21’s BulletShield technology deflects forces safely away from the iPhone X’s screen, and its thin crystal layer ensures the phone’s touchscreen remains smooth and responsive. The <a href=\"https://www.tech21.com/en_us/impact-shield-iphone-x-self-heal\" target=\"_blank\" rel=\"noopener\">Impact Shield</a> is also available in an <a href=\"https://www.tech21.com/en_gb/impact-shield-iphone-x-anti-glare\" target=\"_blank\" rel=\"noopener\">anti-glare model</a> that makes the iPhone X’s screen easier to read in direct sunlight.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/86a4d387ae48d54874784261bb9780824bbe9dab/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Tech21\">Tech21</a></p>",
            "<p>Tech21’s other new iPhone X screen protector, the Evo Glass, utilizes 4 millimeters of tempered glass that works to shield your phone’s screen against accidental scratches and drops. It’s bendable, durable, and fingerprint-resistant, and thin enough to avoid dulling the iPhone X screen’s colors.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/0865dd5f32d4b575d7b6ee0761796363cea5b5d3/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Tech21\">Tech21</a> <a href=\"https://www.digitaltrends.com/go/d8be73d427d8d121fe60b7a4782c2c2bea5f25d9/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>InvisibleShield, a brand with a long history in the iPhone accessories business, has a new screen protector designed for the the iPhone X: The <a href=\"https://www.zagg.com/us/en_us/invisibleshield/apple-iphone-x-screen-protector/glass-plus-apple-iphone-x\" target=\"_blank\" rel=\"noopener\">Glass+</a>. It features Ion Matrix technology, a blend of ultra-strong impact material and surface fracture-filling finish. With a thorough inspection process that weeds out imperfections, InvisibleShield claims the Glass+ is two times stronger than most of the competition. <a href=\"https://www.zagg.com/us/en_us/invisibleshield/apple-iphone-x-screen-protector/glass-plus-apple-iphone-x\" target=\"_blank\" rel=\"noopener\">Glass+</a> starts at $40.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/79d25fbf8567af9ed546c9938567cfcc39a511a0/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Zagg\">Zagg</a> <a href=\"https://www.digitaltrends.com/go/7bec0c08899b69be7d46f3149495405e681aa78c/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Potentially the first in a new generation of glass screen protectors, BodyGuardz Pure 2 uses a new type of glass to make this some of the best screen protection you can buy. Rather than the usual glass used in other screen protectors, the Pure 2 from BodyGuardz uses “aluminosilicate”, an ultra-thin, ultra-strong material that’s easy to handle, and apparently impossible to break or mark with five times more scratch resistance than the competition. While we can’t validate those claims, the Pure 2 is a great screen protector, being easy-to-apply with the included installation tray and precisely cut edges, and is even covered by BodyGuardz’s <a href=\"https://www.bodyguardz.com/advantage_program\">lifetime replacement scheme</a>.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/05a5ad2473aaebda77cd33954bc924e13625b53f/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"BodyGuardz\">BodyGuardz</a> <a href=\"https://www.digitaltrends.com/go/dae5dbd11618dbf8732af079e58a46f4cf4e285c/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Otterbox is an old hand at screen protection, and you can expect a certain level of expertise from one of its Alpha Glass screen protectors. And that’s exactly what we have here — a solid screen protector that will keep your device protected. Otterbox promises the Alpha Glass maintains perfect image quality (especially important on a device like the iPhone X), and fully retains all of the responsiveness you would have from an unprotected display. Anti-shatter technology stops the screen protector from shattering should the worst happen, and comes with everything you need to apply the protector quickly and easily.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/6d7c3730023e4316ba667ef83997be9334ebd710/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Otterbox\">Otterbox</a> <a href=\"https://www.digitaltrends.com/go/24c85ac6a16bb89902441a04904f23efc7732118/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Something slightly different from the usual film or glass screen protection options — Spigen’s GLAS.tR Nano Liquid is a liquid-based screen protector. Instead of adding a physical protector over the top of your display, this screen protection instead applies a layer of a nano-hydrophobic coating that stops dirt, grit, and grease from sticking to the surface of the phone, keeping it clean and stopping those particles from causing damage. And while it won’t lend the same sort of protection that you might get from a film or glass screen protector, it’s super-thin at less than 1,000-times thinner than a human hair, and is the perfect screen protection for anyone who hates having an extra barrier between them and their phone.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/efccec2882845a449aefc7de395c3cba625d0392/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Spigen\">Spigen</a> <a href=\"https://www.digitaltrends.com/go/4939cd4a605c8e108c0222e0d2af6398142ff85c/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Moshi is another company with a long pedigree of making fine accessories for Apple products, and the Airfoil Glass is the first screen protector it has on offer for the iPhone X. Experience shows — the Airfoil is 40-percent stronger than generic glass screen protectors, and thanks to Moshi’s special method of atomically strengthening their glass, it’s stronger too. Specially curved edges hug your phone, and Moshi’s Airfoil system underneath the protector reduce the likelihood of air bubbles getting stuck between the Airfoil Glass and the device.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/80333d01f92483e13d354ee2cf475b27cf01d261/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Moshi\">Moshi</a> <a href=\"https://www.digitaltrends.com/go/5d0c867c47cf7e7a435728a0aa3457f0a74401a0/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Offering more options for protecting your phone with either tough hardened glass or scratch-resistant film, Tech Armor’s Ballistic Glass screen protector is made of top-quality Japanese “Asahi” glass that provides 99.99-percent clarity, and full 3D Touch capabilities. Given it measures a mere 0.3 millimeters thick and comes with rainbow-free adhesive, it will seem like it’s barely there, and Tech Armor says it’s fully compatible with most cases. And the best part? There’s three of them in a pack, so you’ve got replacements close at hand if the worst happens.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/e3943a6531cf09c102801260852de839838cfe24/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Tech Armor\">Tech Armor</a>  <a href=\"https://www.digitaltrends.com/go/75cbd46d7e5d098e76ec4d23314c6264eb4ed75a/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Tech Armor has also put “countless hours” into the development of the HD Clear Film screen protectors. Made from high-quality Japanese PET material, Tech Armor promises that the HD Clear provides incredible screen clarity, and resists bubbling during application with a silicone-based adhesive. Tech Armor has also included “TruTouch” technology to ensure that the screen’s sensitivity is unaffected — and best of all, this comes in a triple-pack, ensuring great value for money.</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/41178b979992fe784fecd0303ba7bddab75a4383/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Tech Armor\">Tech Armor</a>  <a href=\"https://www.digitaltrends.com/go/3d3585e114e5657e6f65c496e9a05565290b2464/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a></p>",
            "<p>Formerly the most expensive protector on this list, but for a good reason. <a href=\"https://www.whitestonedome.com/products-2/\">Whitestone</a> has been quietly making a name for itself thanks to a range of glass screen protection that’s applied using a unique UV lamp, curing the adhesive beneath and ensuring a perfect bond between the phone and the screen protector. The protector itself is rated at 9H hardness, cuts blue light by 25 percent (helping your eyes), and adds scratch and drop-resistance to your device. Because of the wet application method, touch sensitivity is increased, and any small cracks that develop in the protector will be filled in by the liquid, adding longevity. It can even be applied to a broken screen after the fact — the liquid runs into the cracks, securing them against any further damage. Perfect!</p>",
            "<p style=\"text-align: center\"><strong></strong></p>",
            "<p style=\"text-align: center\"><a href=\"https://www.digitaltrends.com/go/b213371e3a51fa79c8e66bf6125eeca9d0e0cf36/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Amazon\">Amazon</a> <a href=\"https://www.digitaltrends.com/go/0caa832fac8cfefb8b714c32b05e3b9d8d6c774e/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Mobile Fun\">Mobile Fun</a></p>"
        ]
    },
    {
        "title": "\n\t\tApple faces patent infringement charges over dual-lens iPhone camera tech\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Apple is being sued over the dual-lens camera tech used to power the exceptionally capable camera suites in the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a>, <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-8-plus-review/\">iPhone 8 Plus</a>, and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-7-plus-review/\">iPhone 7 Plus</a> smartphones.</p>",
            "<p>In a claim that <a href=\"http://www.patentlyapple.com/patently-apple/2017/11/one-of-the-pioneers-in-dual-camera-technologies-corephotonics-sues-apple-on-four-counts-of-patent-infringement.html\">originated in November 2017</a>, Israeli firm <a href=\"http://corephotonics.com/\">Corephotonics</a> alleges that Apple <a href=\"https://www.scribd.com/document/363778355/1-Corephotonics-vs-Apple-Inc-Patent-Infringement#from_embed\">unlawfully copied its dual-lens technology</a> after being rebuffed for a potential partnership. According to Corephotonics, after Apple refused the offer of an alliance, it then went on to develop its own version of the camera tech anyway. <a href=\"https://www.reuters.com/article/us-apple-patents-lawsuit/israeli-start-up-says-apple-copied-its-patented-smartphone-camera-technology-idUSKBN1D72M0\">According to Reuters</a>, Apple praised the tech during a meeting with Corephotonics Chief Executive David Mendlovic, and after refusing to license it, apparently made a comment that it could simply bypass the patents on the hardware without consequence.</p>",
            "<p>The lawsuit <a href=\"https://www.engadget.com/2017/11/07/israeli-company-claims-apple-copied-its-dual-camera-tech/\">originally only concerned</a> the dual-lens iPhone 7 Plus, but <a href=\"http://www.patentlyapple.com/patently-apple/2018/05/corephotonics-files-second-patent-infringement-case-against-apple-over-the-iphones-dual-lens-camera.html\">has been expanded</a> to include the other dual-lens camera phones under the Apple iPhone brand — the iPhone X and the iPhone 8 Plus. Corephotonics’ patents concern the construction of a telephoto zoom within the extremely small confines of a smartphone, and how this technology would interact within a dual-lens system to create a combination of optical and digital zoom.</p>",
            "<p>The crux of the allegation against Apple appears to be that the technology was shown to Apple before Apple then went on to develop its own version — the implication being that Apple simply lifted the techniques and put them into its own camera designs. Apple has been granted patents for its own cameras.</p>",
            "<p>According to <a href=\"http://www.patentlyapple.com/patently-apple/2018/05/corephotonics-files-second-patent-infringement-case-against-apple-over-the-iphones-dual-lens-camera.html\">Patently Apple</a>, one of the patents included in the updated lawsuit was only granted in January 2018 — after both the iPhone 8 Plus and iPhone X were released to the public, raising questions of how an ungranted patent was willfully infringed on before it had been granted. Regardless, this may well become a thorny issue for Apple, which is no stranger to lawsuits, having been <a href=\"https://www.digitaltrends.com/business/apple-vs-qualcomm-news/\">engaged in multiple legal battles</a> against some of <a href=\"https://www.digitaltrends.com/mobile/apple-vs-samsung-supreme-court/\">the largest names</a> in the tech industry.</p>"
        ]
    },
    {
        "title": "\n\t\teBay HeadGaze app lets physically impaired control iPhone X with head movements\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p>Accessibility options for the physically impaired just got a huge boost, thanks to eBay’s open-source release of its HeadGaze software that allows users to control an <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a> with simple head movements.</p>",
            "<p>The software only works on the iPhone X at the moment, and uses the phone’s revolutionary <a href=\"https://www.digitaltrends.com/computing/apple-patent-faceid-imac/\">FaceID system</a> to track the user’s head movements, and translate them directly onto the screen. The software creates an on-screen cursor that’s then controlled by the user’s movements. Triggering a button or keypress is done by lingering the cursor over the desired button, and users can scroll or turn pages by lingering the cursor on specific parts of the screen. It’s a control scheme that won’t be unfamiliar to anyone who’s used a phone-based virtual reality headset like the Gear VR — but with the added benefit of not needing a bulky headset.</p>",
            "<p>The technology was created by eBay’s computer team with guidance from PhD candidate and eBay intern Muratcan Cicek. While the software hasn’t yet been released on eBay’s app, eBay has <a href=\"https://vimeo.com/289180466\">released a video</a> that shows the software working on the app. In an altruistic move, the auction giant has also released the <a href=\"https://github.com/ebay/HeadGazeLib\">source code on GitHub</a>, so other developers can benefit from the software.</p>",
            "<p>The software is primarily aimed at increasing accessibility options for the physically impaired. It is hoped this software could be incorporated into future mobile operating systems, giving more options to those who may struggle with the touch-based systems currently used in most mobile phones. With a system like HeadGaze, a phone could be held in position while a user uses head movements to browse. Future improvements in voice-based A.I. could also play a role in these accessibility options, helping to open the world of tech to a larger community of people.</p>",
            "<p><a href=\"https://venturebeat.com/2018/09/11/ebay-open-sources-headgaze-so-you-can-control-an-iphone-x-screen-with-head-movements/\">Speaking to VentureBeat</a>, Cicek said that the team is working on incorporating other movements into the system, including tracking eye movement. He also pointed out the uses this technology could have beyond the options it offers for the physically impaired, with examples from everyday life.</p>",
            "<p>“Tired of trying to scroll through a recipe on your phone screen with greasy fingers while cooking? Too messy to follow the how-to manual on your cell phone while you’re tinkering with the car engine under the hood? Too cold to remove your gloves to use your phone?”</p>",
            "<p>While touchscreens are likely going nowhere for a while yet, it’s likely we’ll see some serious developments in this area within the next few years. After all, a lot of us can unlock our phone with our eyes — why not control it with them, too?</p>"
        ]
    }
]