[
    {
        "title": "\n\t\tHow to use the Galaxy S9’s super slow-mo to give your videos a cinematic touch\t",
        "author": [
            "\n\t\t\t\t\t\tWill Nicol\t\t\t\t\t"
        ],
        "text": [
            "<p>Samsung’s new <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Galaxy S9 smartphone</a> may not look radically different from the previous year’s model, but it adds some nifty features like <a href=\"https://www.digitaltrends.com/mobile/ar-emojis-samsung-galaxy-s9-test/\">AR Emoji</a> and “super slow-mo,” the latter of which gives users the ability to record video in (small bursts of) slow motion. Super slow-mo records video at 960 fps in 720p resolution. It’s an easy feature to use, and once you learn how, you will be able to take some incredibly stylish shots. Here’s how to get started.</p>",
            "<p><strong>Step 1:</strong> Open the camera app. At the top of the screen, you will see the current mode the camera is in. Swipe right until you get to <em>Super Slow-Mo</em>.</p>",
            "<p><strong>Step 2:</strong> You can now choose whether to manually activate slow-mo, or have it trigger automatically.</p>",
            "<p>In manual mode, simply tap the record button to start recording video. Next, tap the button to the right to begin recording in slow-motion.</p>",
            "<p>The S9 will only record slow-motion in 0.2-second bursts (when the video is played, this ends up being about 6.4 seconds of footage). You can, however, tap the slow-mo button again, recording multiple slow-mo sections in one video.</p>",
            "<p>If you choose automatic slow-mo, tap the record button, and a square will appear in the camera’s viewfinder. When the camera detects motion within the square, it will begin recording in slow-motion (again, it will only do so for 0.2 seconds). Line up the viewfinder so the person or object you want to record will move through the square, and you should be good to go. As with manual mode, the S9 can record multiple bursts of slow-mo in one video.</p>",
            "<p><strong>Step 3:</strong> Once you finish recording your video, it will appear in the phone’s gallery. You can tell which videos have slow-motion segments because they will sport an icon depicting multiple circles. Once you select the video, you will see that same icon on the screen. Tap it, and the bar at the bottom of the screen (which tells you how far into the video you are) will display marks to show which segments are in slow-motion.</p>",
            "<p>You can edit the video, adding music, toggling slow-motion on or off, and trimming sections of the footage. Swipe up to get additional options, such as making the footage loop or play in reverse.</p>",
            "<p>That’s all there is to it. Have fun experimenting with slow-motion recording.</p>",
            "<p><em>David Cogen — a regular contributor here at Digital Trends — runs <a href=\"http://theunlockr.com/\" target=\"_blank\" rel=\"noopener noreferrer\">TheUnlockr</a>, a popular tech blog that focuses on tech news, tips and tricks, and the latest tech. You can also <a href=\"https://twitter.com/theunlockr?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\">find him on Twitter</a> discussing the latest tech trends.</em></p>"
        ]
    },
    {
        "title": "\n\t\tHere’s how to buy the brand-new Samsung Galaxy S9 and Galaxy S9 Plus\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>The Samsung Galaxy S9 and Galaxy S9 Plus are finally here, boasting the latest and greatest Qualcomm processor — the <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a> — plenty of RAM, and a revamped camera that Samsung hopes will make the Galaxy S9 the phone of choice for photography lovers.</p>",
            "<p>Now that the new phone is here, you might be wondering how you can get your hands on it for yourself. There are plenty of ways to buy the phone — and we’ve done the research on them so that you don’t have to. Whether you want to buy the phone through a carrier or directly from Samsung, here’s how to get your hand on the Samsung Galaxy S9 and Galaxy S9 Plus.</p>",
            "<p>Now that pre-orders are over, the Samsung Galaxy S9 and Galaxy S9 Plus are now available for purchase straight from the Samsung website. You’ll also be able to get your hands on the device from retailers like Best Buy, Amazon, Sam’s Club, Target, and Walmart.</p>",
            "<p>If you’re looking for the most diverse range of storage options, purchasing from Samsung is your best bet. In April, the smartphone manufacturer announced it would release a 128GB and 256GB storage option for the Galaxy S9 and Galaxy S9 Plus exclusively on its <a href=\"https://www.samsung.com/us/\">website</a>.</p>",
            "<p>The 128GB Galaxy S9 sells for $770 while the same storage configuration on the Galaxy S9 Plus will set you back $890. If you want to max out your storage a 256GB option of the Galaxy S9 will be available for $820, while the S9 Plus of the same size will sell for $940 — but only during pre-order. After pre-orders are finished, the pricing will go up to $840 for the 256GB Galaxy S9, and $960 for the Galaxy S9 Plus. Pre-orders began on May 1, and the devices will be available for purchase on May 18. If you pre-order a Galaxy S9 or S9 Plus with a 128GB or 256GB storage capacity before May 17, you’ll also opt for either a free Gear IconX or Samsung Gear S3 Frontier for $100.</p>",
            "<p>If you choose to pick up the Galaxy S9 or S9 Plus from <a href=\"https://www.samsung.com/us/\">Samsung.com</a> or through the <a href=\"https://www.samsung.com/us/explore/shop-samsung-app/\">Shop Samsung app</a>, then you can pick up an unlocked version of the Samsung Galaxy S9 for $720, or $30 a month for 24 months. The larger S9 Plus will set you back a little more — $840, or $35 a month, for 24 months.</p>",
            "<p>If you’re upgrading from an older Galaxy device, then Samsung is also offering a trade-in program that could save you up to $300 on a new Galaxy S9 or S9 Plus. The details of this trade in option are available on <a href=\"https://www.samsung.com/us/trade-in/\">Samsung’s site</a>, as is the list of models that can be traded in.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/7c9d7005a87d93da077fa21c116bc1e60bfbbdad/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Samsung\">See details</a></p>",
            "<p>For a limited time AT&amp;T is offering a pretty sweet promotion for AT&amp;T Next customers. Buy any Galaxy S9 and you’ll receive a bill credit for $395, cutting the price of Samsung’s newest flagship in half. If you’d rather give the Galaxy S9 Plus or Note 8 a go, AT&amp;T will provide the same $395 bill credit for these devices as well.</p>",
            "<p>After the limited promotion ends, we anticipate AT&amp;T will return to its regular promotion for  the Samsung Galaxy S9 and Galaxy S9 Plus. AT&amp;T Next customers can get the standard Galaxy S9 for $26.34 per month for 30 months, while the Galaxy S9 Plus will come in at $30.50 per month for 30 months. That comes out to a total of $790.20 for the standard Galaxy S9, or $915 total for the Galaxy S9 Plus.</p>",
            "<p>AT&amp;T has also announced that its MVNO, Cricket Wireless, are offering the Galaxy S9 and Galaxy S9 Plus in some select stores.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/4fe1d04cf96be36e55935ebc94d4c07860fb4804/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Samsung\">See details</a></p>",
            "<p>Like other carriers, Sprint is now offering the Samsung Galaxy S9 and Galaxy S9 Plus to its customers — with a slightly quirky deal. Customers that buy the Samsung Galaxy S9 or Galaxy S9 Plus will get a <a href=\"http://newsroom.sprint.com/ready-for-something-out-this-world.htm\" target=\"_blank\" rel=\"noopener\">star that they can name</a>. Yes, a literal star. The offer is only available “while supplies last.”</p>",
            "<p>The phones come at $33 per month for the Galaxy S9 or $38 per month for the S9 Plus on Sprint’s Flex lease program. Through Sprint, you’ll also be able to get a $150 gift card if you switch your phone number to Sprint.</p>",
            "<p>If you’re looking for two new Galaxy S9 phones, Sprint may have the perfect deal for you. The carrier is offering a limited-time lease offer that offers a monthly bill credit for one device when you lease two. For example, if you lease two Galaxy S9 phones, you’ll see a monthly lease charge of $66 as well as a bill credit for $33.</p>",
            "<p>Sprint says the phone is also available from Boost Mobile.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/0026acc6e9f21fdd4577460da2c90beec1643f8e/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Sprint\">See details</a></p>",
            "<p>As you would expect, the Galaxy S9 and Galaxy S9 Plus are also available from T-Mobile. T-Mobile is offering some pretty awesome trade-in deals, too. You’ll be able to get up to a hefty $360 if you trade-in some flagship phones, including the Galaxy S8, Galaxy S8 Plus, iPhone 8, and others. Older phones, including the LG G5, Galaxy S5, and others, will still get up to $200 — which is still not bad at all.</p>",
            "<p>If you’re looking to get your S9 or S9 Plus with the Un-Carrier, then you can choose from the following pricing choices:</p>",
            "<p><strong>Galaxy S9</strong></p>",
            "<p><strong>Galaxy S9 Plus</strong></p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/b0d390eaf0b8058f98edee96dc1f87aa744c4d89/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"T-mobile\">See details</a></p>",
            "<p>U.S. Cellular is offering both phones in Midnight Black, Coral Blue and Lilac Purple.</p>",
            "<p>Customers purchasing an unlimited data plan and turning in an eligible device can receive up to $350 off their purchase, via monthly bill credit — and can also get up to $250 off when purchasing an unlimited data plan, even if they aren’t trading in a device.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/ab5e370097ce50c3dc5f8ddfff275c71e1ec934e/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"US Cellular\">See details</a></p>",
            "<p>From Verizon, the Galaxy S9 costs $33.33 per month for 24 months — which equates to $799.92 — and the Galaxy S9 Plus is $38.74 per month for 24 months, for a total of $929.76. If, however, you’re interested in getting two devices instead of one, Verizon is offering a pretty sweet buy-one, get-one deal. If you buy a Galaxy S9 or Galaxy S9 Plus through Verizon, you’ll get $799.99 toward the purchase of another Galaxy S9 device — which will be applied in discounts over a 24-month period.</p>",
            "<p>The company also has a hefty six promotional offers running. Here’s the run-down of those promotional offers.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/9b42732d56c90a69e5e78c129c829297f9c92885/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Verizon\">See details</a></p>",
            "<p><a href=\"https://www.xfinity.com/mobile/\">Xfinity Mobile</a> is offering a $250 Visa prepaid card to existing customers who pick from the Lilac Purple, Midnight Black, and Coral Blue models of the S9 and S9 Plus that it has on offer. Additionally, if customers trade in an eligible device as a part of its trade-in scheme, they will also receive an additional $200 credit — giving customers a combined $450 off their phone.</p>",
            "<p style=\"text-align: center;\"><a href=\"https://www.digitaltrends.com/go/edb6b2a174f4ad77701503e219c3202adedf90c9/\" rel=\"nofollow\" target=\"_blank\" class=\"m-aff-button h-affiliate-link trackable\" data-event-type=\"affiliate-click\" data-event-action=\"manual\" data-event-param=\"Xfinity\">See details</a></p>",
            "<p><em>Updated on May 4: Clarified the difference between pre-order pricing and standard sale pricing for 256GB models.<br>\n</em></p>"
        ]
    },
    {
        "title": "\n\t\tU.S. Galaxy S9 handsets can be forced into a reboot by a ‘complex shader’\t",
        "author": [
            "\n\t\t\t\t\t\tMark Jansen\t\t\t\t\t"
        ],
        "text": [
            "<p><a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">The Samsung Galaxy S9</a>, one of the most advanced smartphones in the world, can be forced into a reboot by a particularly complex shader, says research by <a href=\"http://www.graphicsfuzz.com/\">U.K. GPU testing company GraphicsFuzz</a> and <a href=\"https://www.xda-developers.com/the-snapdragon-samsung-galaxy-s9-has-a-gpu-stability-bug-that-can-be-exploited-to-trigger-remote-reboots/\">XDA Developers</a>.</p>",
            "<p>According to GraphicsFuzz, the discovery came about during testing of the Galaxy S9’s rendering capabilities, and was not intended to be malicious. The issue stems from a problem with how the phone’s Adreno 630 graphics driver attempts to render a particularly complex shader inside Samsung’s default Samsung Internet app.</p>",
            "<p>According to a deeper investigation, the graphics driver starts the process of creating the shader, but fails at one of the initial steps of allocating resources. The browser fails to terminate the process properly, which causes the phone to panic and reboot.</p>",
            "<p>The issue is reproducible on other browsers — but though the shader does cause the phone to freeze, only on the Samsung Internet browser is the phone forced to reboot, meaning the problem is seemingly specific to Samsung’s browser. Since the issue only affects the Galaxy S9 models equipped with the <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Snapdragon 845</a> (unfortunately means the majority of the models in the U.S.), it seems that it’s the pairing of Samsung’s browser and Qualcomm’s graphics driver causing the problem.</p>",
            "<p>This assumption can be backed up by reproducing a similar error on the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-xl-review/\">Google Pixel 2 XL</a>. That phone is equipped with the Qualcomm Snapdragon 835 and Adreno 540 graphics driver, and when subjected to the same test on Samsung Internet, the browser slows to a crawl — though a reboot isn’t forced.</p>",
            "<p>A video of the problem has been made available, and shows the lengthy freeze, as well as the forced reboot of the device.</p>",
            "<p>The problem here is that the bug is reproducible, and capable of being deployed to remotely attack and force affected Samsung Galaxy S9 models into reboots. Thankfully, as soon as this became apparent to GraphicsFuzz, it reached out to XDA Developers in order to contact Samsung. In a disclosure timeline, XDA reported that a Samsung engineer had been assigned to the case on April 4, and it can be hoped that a fix will be deployed to rectify this problem soon.</p>"
        ]
    },
    {
        "title": "\n\t\tSamsung tapped Hollywood talent to bring AR Emoji to life\t",
        "author": [
            "\n\t\t\t\t\t\tBrenda Stolyar\t\t\t\t\t"
        ],
        "text": [
            "<p>Embedded into the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Samsung Galaxy S9’s</a> camera app, <a href=\"https://www.digitaltrends.com/mobile/how-to-use-ar-emoji/\">AR Emoji</a> allows you to use the front-facing camera to create and send digital cartoon avatars. Similar to Apple’s <a href=\"https://www.digitaltrends.com/apple/animoji-ios-11/\">Animojis</a> in concept, AR Emoji captures your facial movements and mirrors them in the form of a character or animal. But with its “Create My Emoji” feature, you can also create one of yourself by simply taking a selfie — allowing you to choose a skin tone, outfit, hairstyle, hair color, and glasses.</p>",
            "<p>With AR Emoji, Samsung set out to solve what it sees as a problem — finding a way to replace existing emojis with ones that are interactive. The company wanted to do this in a way that was simple, by providing users with the right tools to capture emotion but still allowed them to easily share the result on a variety of messaging platforms.</p>",
            "<p>So, how did Samsung create its AR Emojis? For starters, it went straight to the 3D animation experts who brought to life some of Hollywood’s most popular characters.</p>",
            "<p>To power the new feature, Samsung collaborated with <a href=\"https://www.loomai.com/\" target=\"_blank\" rel=\"noopener\">Loom.ai</a> —  a San Francisco-based startup specializing in 3D animation. The company’s software allows users to create fully personalized and customizable 3D avatars from a single photograph, without custom hardware or depth sensors.Through a partnership and a software development kit (SDK), Samsung combined Loom.ai’s technology with the S9’s camera tech (augmented reality and facial recognition) to make custom AR Emoji possible.</p>",
            "<p>The vision behind Loom.ai all started with movies — cartoons and superheros to be exact. Having previously worked at popular visual effects companies like DreamWorks and Lucasfilm, Loom.ai’s founders –Mahesh Ramasubramanian and Kiran Bhat — have helped bring well-known characters, such as Shrek and the Hulk, to the big screen.</p>",
            "<p>To inject personality into those characters, they used performance-capture technology to incorporate the actors who played them — recording the movements of the actor, not their visual appearance. But after seeing how movie audiences reacted to their 3D creations, Ramasubramanian and Bhat decided to take that technology further — beyond Hollywood — by starting Loom.ai, which focuses on smartphones.</p>",
            "<p>“People instantly react to having these characters come to life when it’s driven by human actors,” Ramasubramanian, who serves as CEO and co-founder, told Digital Trends. “We started Loom.ai with the goal that we need to be able to find an easy way for every individual to be able to see themselves in 3D, and for that we had to build a new technology.”</p>",
            "<p>With feature films, creating a 3D avatar requires tons of equipment — expensive hardware and software, makeup, and a studio setting. But Loom.ai found a way to simplify the process of capturing a person’s features without the usual tools; instead, its patented technology uses a single photograph and deep learning to analyze an image. If a photograph is free of any facial expressions, the deep-learning algorithm looks at the pixels and automatically produces a face that encapsulates the correct muscle movement.</p>",
            "<p>“When Samsung’s partnership rolled around we had a chance to implement that sophisticated technology on a device, which we feel is already a pretty compelling engineering task by itself,” Bhat, Loom.ai’s CTO and co-founder, told Digital Trends. “It’s a big technology jump in being able to take some of those ideas and aspirations from the big screen and bring it to mobile.”</p>",
            "<p>Incorporating this technology into the Galaxy S9 hardware required Loom.ai to restructure its algorithms, in order to run on the device. But Loom.ai did not create AR Emoji alone: Both Ramasubramanian and Bhat credit Samsung in dedicating tremendous effort into optimizing the software. By providing the SDK to integrate into smartphones, the Loom.ai founders think Samsung can make the framework much richer by adding more content and customizability options in the future.</p>",
            "<p>So, how exactly does the S9 (and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-plus-review/\">S9 Plus</a>) create AR Emojis? While Samsung didn’t reveal its secret sauce, it gave Digital Trends a look under the hood.</p>",
            "<p>Working off Loom.ai’s technology, the phone’s camera captures and processes a 2D image into 3D. To enhance this further, the S9 uses additional software — facial tracking and Samsung’s Blend Shape technology — to provide facial expressions for the AR Emoji.</p>",
            "<p>You’re then left with a cartoon-like version of yourself that can emote 18 different expressions — which Samsung plans on slowly expanding to 54 — ranging from joy and pleasure, to sorrow and anger. All data is also local to the device, and doesn’t get stored anywhere else.</p>",
            "<p>Both working together, facial tracking technology tracks over 100 facial features in real time (such as winking or smiling) to capture individual emotions, while Blend Shape helps to deliver a greater range of them — which blends expressions together based on 75 basic human facial features. Samsung says, for Blend Shape, it conducted at least 100 tests on a weekly basis within its labs, in order to make sure there is enough data that would entice its users. (Blend Shape is also used to create its Disney AR Emojis, like Mickey and Minnie Mouse.)</p>",
            "<p>In our own <a href=\"https://www.digitaltrends.com/mobile/ar-emojis-samsung-galaxy-s9-test/\">AR Emoji test</a>, a majority of us felt our characters looked extremely inaccurate. One writer felt there was a lack of skin-tone options available, with no dark-skinned tones to choose from. Others felt their AR Emoji didn’t look anything like them, which made editing the avatar seem like more of a chore than an enjoyable task.</p>",
            "<p>According to Loom.ai, creating an accurate AR Emoji relies heavily on the way the selfie is shot. Users should go about taking the photo the same way they’d take a passport photo. “You want even lighting, nothing covering your face, and a neutral expression so that we can add the expressions later,” Ramasubramanian explained. “It’s a matter of people getting a little accustomed to it and then seeing the possibilities of animating it and using it.”</p>",
            "<p>Ramasubramanian also said that users should treat it the way they would while taking any selfie — meaning, you can take tons of photos until you’re satisfied with the photo. Since AR Emoji allows you to create multiple avatars, you can compare them to find the one you like best. Each one you create also saves to your phone, so you can switch up the version you use depending on your mood.</p>",
            "<p>The latest update to AR Emoji includes additional hairstyles, headwear such as a hijab, and other options. The update is currently rolling out to unlocked versions of the Samsung Galaxy S9 and S9 Plus in Korea, China, and Europe. European carrier devices and U.S. unlocked devices should have the update available for download this week. The update for U.S. carrier devices will be rolling out over the coming weeks. Samsung says AR Emoji will continue to evolve in the future, but for now, is staying tight lipped on exact details.</p>"
        ]
    },
    {
        "title": "\n\t\tThe Samsung Galaxy S9 can download up to 37 percent faster than the iPhone X\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>There are a few things to consider when buying a smartphone — you’ll want to think about a phone’s design, camera, performance, and so on. But what about how quickly phones can upload and download files? If speedy internet access is important to you, a new study has been released detailing the fastest phones out there — and it turns out that Samsung is the winner.</p>",
            "<p>The study comes from <a href=\"https://www.digitaltrends.com/computing/best-internet-speed-tests/\">Ookla</a>, the company behind <a href=\"http://www.speedtest.net/\" target=\"_blank\" rel=\"noopener\">speedtest.net</a>, and highlights that the <a href=\"https://www.digitaltrends.com/mobile/samsung-galaxy-s9-news/\">Samsung Galaxy S9</a> and Galaxy S9 Plus significantly outperform other smartphones when it comes to downloading and streaming content. By how much? According to the study, the phones are up to 42 percent faster — which is no small feat.</p>",
            "<p>The speeds are largely thanks to the CAT 18 LTE modem built into the phones, which are able to deliver download speeds of up to 1.2 Gbps, though that obviously depends on network speeds. The real takeaway here is the fact that, depending on which phone you use, you could experience significantly different speeds, even on the same network and in the same area. The study highlights that the Galaxy S9 and S9 Plus boast speeds of up to 37 percent faster than the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a>, 17 percent faster than the Google Pixel 2, and 38 percent faster than the Galaxy S7.</p>",
            "<p>“This summer, consumers are going to be on the road, at the beach, and relying on their phones more than ever, but without the latest and fastest network technology that’s available in the Galaxy S9 and S9+, their phones may quite literally slow them down,” said Justin Denison, senior vice president, Mobile Product Strategy and Marketing at Samsung Electronics America, in an emailed statement.</p>",
            "<p>The Samsung Galaxy S9 and Galaxy S9 Plus aren’t just fast — they also boast the latest and greatest Qualcomm processor, the Snapdragon 845, along with either 4GB or 6GB of RAM, and 64GB of storage.</p>",
            "<p>Data speeds in general are only getting faster. As we move toward 5G, carriers are implementing LTE Advanced networks capable of delivering over 1 Gbps speeds. Of course, that not only hinges on carrier implementation, but also manufacturers taking advantage of new mobile modems that are capable of downloading files at such speeds.</p>"
        ]
    },
    {
        "title": "Samsung Galaxy S9 Review",
        "author": [
            "\n\t\t\t\t\t\tJulian Chokkattu\t\t\t\t\t"
        ],
        "text": []
    },
    {
        "title": "\n\t\tT-Mobile shows off the Samsung Galaxy S9 and S9 Plus in record fashion\t",
        "author": [
            "\n\t\t\t\t\t\tLulu Chang\t\t\t\t\t"
        ],
        "text": [
            "<p>No one has ever accused T-Mobile of being subtle, especially when it comes to the company’s marketing tactics. And the <a href=\"https://newsroom.t-mobile.com/news-and-blogs/samsung-galaxy-s9-guinness-world-record-launch.htm\" target=\"_blank\" rel=\"noopener\">latest stunt</a> the Un-carrier pulled to show off the new <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Galaxy S9</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-plus-review/\">S9 Plus</a> is certainly no exception to the provider’s over-the-top practices. T-Mobile has managed to set two Guinness World Records titles with the two new Samsung smartphones, and tomorrow, you’ll be able to buy the <a href=\"https://www.digitaltrends.com/mobile/samsung-galaxy-s9-news/\">S9 and S9 Plus</a> at the “industry’s best prices” from Un-carrier stores across the country.</p>",
            "<p>It’s not entirely clear what purpose was served by the two new world records T-Mobile now holds, but we suppose it makes for some fun video content. To achieve their spot in history, the team took to Lake Elsinore in California in order to test out the new so-called super phones. The idea was to launch “the world’s most ‘extra’ speed test,” which involved several water-skiers, a very large magenta blimp, and the fastest Samsung phones on what T-Mobile claims to be the fastest network in the country.</p>",
            "<p>So what exactly were the world records? One was the fastest text on a touch screen mobile phone while water skiing (honestly, it’s shocking that anyone holds that record), while the other was the longest distance water skied while being towed behind a blimp. Again, unclear why that record exists in the first place. But regardless, bragging rights are bragging rights, and as mobile service providers continue to bicker over who’s best, it always pays to have an extra talking point.</p>",
            "<p>In more useful information, T-Mobile notes that you’ll pay about 10 percent more for the Galaxy S9 if you buy it at AT&amp;T or Sprint, and even more still if you go to Verizon. The Un-carrier, on the other hand, will offer the Midnight Black, Lilac Purple, or Coral Blue Galaxy S9 for $30 a month, or the larger S9 Plus for the same monthly payment but with a $120 down payment. You can also get half off the S9 or $360 off the S9 Plus via bill credits if you trade in your phone. So if you’re looking for a new super device, the latest from Samsung may be calling your name.</p>",
            "<p><em>Check out our Galaxy S9 and S9 Plus <a href=\"https://www.digitaltrends.com/mobile/samsung-galaxy-s9-availability/\">buying guide</a> for more deals and pricing details. If you’re waiting for your device to arrive or are picking it up on March 16, check out our <a href=\"https://www.digitaltrends.com/mobile/best-samsung-galaxy-s9-and-s9-plus-accessories/\">best accessories</a>, as well as our <a href=\"https://www.digitaltrends.com/mobile/best-samsung-galaxy-s9-cases/\">best S9</a> and <a href=\"https://www.digitaltrends.com/mobile/best-samsung-galaxy-s9-plus-cases/\">S9 Plus cases</a> to complement your new phone.</em></p>"
        ]
    },
    {
        "title": "\n\t\tHow to secure your Samsung Galaxy S9 and keep it safe from sneaky snoopers\t",
        "author": [
            "\n\t\t\t\t\t\tAndy Boxall\t\t\t\t\t"
        ],
        "text": [
            "<p>The days of securing your phone with just a PIN code or a pattern are long gone, and although the new <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Samsung Galaxy S9 and S9 Plus</a> both offer those features, they have a selection of other more secure options too. These new security features rely on biometrics — in this case your fingerprint, iris, or facial features. When you first start up the <a href=\"https://www.samsung.com/us/smartphones/galaxy-s9/buy/s/Device/\" target=\"_blank\" rel=\"noopener\">Galaxy S9</a>, you may rush through these options in the excitement of actually using the phone; but they’re important and should be revisited.</p>",
            "<p>Here’s everything you need to know about setting up the security systems on your Galaxy S9 or Galaxy S9 Plus.</p>",
            "<p>You’ll need to dig into the Settings menu to find the right options.</p>",
            "<p>The most reliable way of unlocking your Galaxy S9 is to use the fingerprint scanner. The sensor is located just below the camera lenses on the back of the phone, in a slightly more sensible place than it was on the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s8-review/\">Galaxy S8</a>.</p>",
            "<p>Fingerprint verification can be used for <a href=\"https://www.digitaltrends.com/mobile/samsung-pay-news/\">Samsung Pay</a>, and an option for it is found under the same menu.</p>",
            "<p>This is Samsung’s hybrid face and iris unlock system, designed to be more reliable than using just one of these two biometric systems on its own. Even if you enable fingerprint recognition, we still recommend setting this up and giving it a try. We’ve seen varying results, with some people finding it more reliable than others.</p>",
            "<p>It’s not suitable for high-security features like Samsung Pay, and Samsung warns that Intelligent Scan could be fooled by someone who looks like you. It’s less secure than a PIN, pattern, or password. Lighting that’s different than when you set the system up may confuse it, along with glasses, hats, fake noses (probably), and other changes to your face following registration.</p>",
            "<p>Once you’ve read the warnings and advice, you’ll be guided to hold the phone up to your face, in adequate lighting, ready to register your face. This takes a very short amount of time. Next is iris recognition, and if you wear glasses or contact lenses, you should remove them.</p>",
            "<p>With this done, you’ll be prompted to activate Intelligent Scan. Returning to the main menu, we recommend making sure both <em>Intelligent Scan unlock</em> and <em>Screen-on Intelligent Scan</em> are activated.</p>",
            "<p>There are plenty of security options on the Galaxy S9, so why not use them all?</p>",
            "<p>Using Intelligent Scan may sound as simple as holding your phone up to your face, and it is — but there are a few things to know about using Intelligent Scan effectively. First, you should wake the phone to the lock screen using the sleep/wake key on the side of the phone. Look out for the red LED, which lights up when Intelligent Scan is active. Provided you’re in decent lighting, and aren’t too close to the phone’s screen, it should work on a consistent basis. If it’s not working, go back and re-register your face and iris again. Varying lighting conditions, especially during this stage, really do affect Intelligent Scan’s performance.</p>",
            "<p>The fingerprint sensor is the faster way to wake the phone, as touching the sensor unlocks the device without the extra step of pressing the sleep/wake key. To make it more convenient, register your index finger on both hands, so you don’t have to juggle the phone if you pick it up with the “wrong” hand.</p>",
            "<p>That’s about it for the security settings on the Samsung Galaxy S9, and all the instructions apply to the Galaxy S9 Plus as well. Protecting your phone with one or more of these methods is essential.</p>"
        ]
    },
    {
        "title": "Samsung Galaxy S9 Plus Review",
        "author": [
            "\n\t\t\t\t\t\tJulian Chokkattu\t\t\t\t\t"
        ],
        "text": []
    },
    {
        "title": "\n\t\tSamsung Galaxy S9 vs. Galaxy S9 Plus: Is bigger always better?\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>The Samsung Galaxy S9 and Galaxy S9 Plus are finally here, showcasing a number of awesome new features, top-tier specs, and what could turn out to be a pretty ground-breaking new camera. The new phones may not look all that different from their predecessors, the Galaxy S8 and Galaxy S8 Plus, but they clearly still have a lot to offer.</p>",
            "<p>But which one is the one for you? The Galaxy S9 Plus isn’t just a bigger version of the Galaxy S9 — it also offers a few extra features that might be important. Here’s our comparison of the two phones, aimed at helping you figure out which phone is the best choice for your needs.</p>",
            "<p>The two phones feature similar specs, to be sure, but the Galaxy S9 Plus clearly has an advantage under the hood.</p>",
            "<p>Let’s start with the similarities between the two devices. For starters, you’ll get the same <a href=\"https://www.digitaltrends.com/mobile/qualcomm-snapdragon-845/\">Qualcomm Snapdragon 845</a> processor, which is Qualcomm’s latest and greatest smartphone mobile chip. You’ll also get the same 64GB of storage, and a MicroSD card slot to expand upon that storage if you so choose.</p>",
            "<p>There’s one big difference here, and that’s the fact that the Galaxy S9 Plus features 6GB of RAM, rather than the 4GB of RAM you’ll find in the standard Galaxy S9. That could help make the larger phone a little more powerful, especially for those that multitask a lot.</p>",
            "<p>The phones are similar, and most will find the Galaxy S9 plenty powerful, but, because of its extra RAM, the Galaxy S9 Plus edges out the smaller phone.</p>",
            "<p><strong>Winner: Samsung Galaxy S9 Plus</strong></p>",
            "<p>The phones don’t just feature similar specs. They also offer almost identical designs. It’s a very nice design though. The front is largely taken up by the beautifully curved Infinity Display, with features like the Iris Scanner and front-facing camera in a sleek forehead at the top of the phone.</p>",
            "<p>Around the back of the device, you’ll find the fingerprint sensor and camera. That’s one of the biggest differences between the standard Galaxy S9 and the Galaxy S9 Plus — the Plus model features a dual-sensor camera, and you’ll see that in the slightly bigger camera module on the back. On the back, you’ll also find that the fingerprint sensor has been moved a little, which is a good thing. The sensor is now much more accessible, and should be far easier to use. The phones also still feature the Bixby button, which you’ll probably either love or hate.</p>",
            "<p>The display on the phone is also pretty similar, though it’s bigger on the Galaxy S9 Plus. The standard-sized phone features a 5.8-inch AMOLED display, while the larger phone boasts a 6.2-inch AMOLED display. Both devices feature a resolution of 2,960 x 1,440 pixels, and as a result the pixel density on the smaller device is a little higher. Still, it’s a fair trade-off for a slightly bigger screen, and most people won’t be able to tell the difference anyway.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The camera is perhaps the biggest point of difference between the Galaxy S9 and the Galaxy S9 Plus, though both cameras offer some pretty awesome features. The standard Galaxy S9 features a 12-megapixel rear-facing camera, while the Galaxy S9 Plus features a dual rear-facing camera with a 12-megapixel main lens and a 12-megapixel telephoto lens.</p>",
            "<p>Both devices offer one feature that we’ve never seen on a smartphone before: A variable aperture. What that means is that users can switch the aperture between f/1.5 and f/2.4, which should help make for <em>much</em> better low-light shots, and better control for those that like to dive into manual shooting. You’ll actually see the aperture change on the back of the phone as you switch it — it’s a mechanical feature.</p>",
            "<p>The camera also offers some other pretty cool features. For example, it boasts ultra high-speed video recording at a massive 960 frames per second, though it can only record for a fraction of a second.</p>",
            "<p>As mentioned, the Galaxy S9 Plus offers a dual rear-facing camera, which unlocks a few new features — including a portrait mode, live focus, and 2x optical zoom.</p>",
            "<p>Because of those new features, the Galaxy S9 Plus is the winner here.</p>",
            "<p><strong>Winner: Samsung Galaxy S9 Plus</strong></p>",
            "<p>Because the Galaxy S9 Plus is a bigger phone, there’s simply more room for the battery. The standard Galaxy S9 features a 3,000mAh battery, while the bigger phone offers a 3,500mAh battery. It does have a larger display to power, but we think that it’ll still boast longer battery life.</p>",
            "<p>The phones offer a few great charging options. The S9 and S9 Plus, like many Samsung phones before them, feature wireless charging through both the Qi and PMA standards. There’s also fast charging through Qualcomm’s Quick Charge 2.0. Because of the larger battery, we’re awarding this one to the Galaxy S9 Plus.</p>",
            "<p><strong>Winner: Samsung Galaxy S9 Plus</strong></p>",
            "<p>Both the Galaxy S9 and Galaxy S9 Plus feature Android 8.0 Oreo, and over the top you’ll find Samsung’s own software. The phones offer all the features you would expect from Android Oreo — including the likes of picture-in-picture mode. Of course, you’ll also get Samsung-specific features such as Bixby.</p>",
            "<p>In general, Bixby hasn’t been very highly reviewed, and it doesn’t seem as though the digital assistant has been upgraded a whole lot for the new phone.</p>",
            "<p>The software on the Samsung Galaxy S9 and Galaxy S9 Plus isn’t all that different from what you’ll find in the Galaxy S8. That’s not necessarily a bad thing — many love Samsung’s take on Android, especially in recent years.</p>",
            "<p><strong>Winner: Tie</strong></p>",
            "<p>The Samsung Galaxy S9 and Galaxy S9 Plus are set to be pretty widely available. The phones will be available for pre-order starting on March 2, with March 16 set to be the date that they become widely available online and in-store. Through Samsung, you’ll be able to get the standard device for $720, while the larger Galaxy S9 Plus comes at $840. The phone is also available through all major carriers in the U.S., as well as unlocked through other outlets. You can check out our <a href=\"https://www.digitaltrends.com/mobile/samsung-galaxy-s9-availability/\">full buying guide for the Galaxy S9 here</a>.</p>",
            "<p>The phones are available from all the same outlets — so here it’s down to price. Because of the fact that the Galaxy S9 is cheaper, it’s the winner here.</p>",
            "<p><strong>Winner: Samsung Galaxy S9</strong></p>",
            "<p>The better, more powerful phone is the Samsung Galaxy S9 Plus. Not only does it feature a little more RAM, but it also offers a slightly improved camera.</p>",
            "<p>But that doesn’t necessarily mean you should go for the Galaxy S9 Plus over the standard version. If you don’t really care about the dual-sensor features, don’t multitask a lot, and don’t need a bigger display, then the Galaxy S9 is still an all-around excellent phone, with a ton of great features.</p>"
        ]
    },
    {
        "title": "\n\t\tMicrosoft is selling its own customized version of the Samsung Galaxy S9\t",
        "author": [
            "\n\t\t\t\t\t\tChristian de Looper\t\t\t\t\t"
        ],
        "text": [
            "<p>When the Samsung Galaxy S8 was released last year, Microsoft started selling its own customized version of the device, feature its apps and services front and center. Now, it looks like the deal between Microsoft and Samsung continues — the company has started selling a customized version of the Galaxy S9 and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-plus-review/\">Galaxy S9 Plus</a> on the Microsoft store.</p>",
            "<p>The phones look the same as the standard version at first glance, and the hardware is exactly the same. The operating system will be the same too. It’s the apps that are different — users will get access to a range of Microsoft’s apps, like Excel, Skype, Cortana, and so on, right after setting up the phone.</p>",
            "<p>To be clear, Microsoft’s apps are not preinstalled on the phone. Instead, you’ll simply be given the option to download and install the apps once the phone is set up and connected to Wi-Fi, according to a <a href=\"http://www.trustedreviews.com/news/microsoft-edition-galaxy-s9-pre-order-release-date-3420833\" target=\"_blank\" rel=\"noopener\">report from Trusted Reviews</a>.</p>",
            "<p>The Microsoft-customized phones won’t be for everyone, but they might be good for you if you’re plugged in to Microsoft’s apps and services and regularly use a Windows computer. We actually really liked many of Microsoft’s Android apps, and we think that downloading them on Android offers a <a href=\"https://www.digitaltrends.com/mobile/microsoft-launcher-edge-android/\">better Microsoft mobile experience</a> than Windows Phone ever did. Why? Well, Android is simply a better operating system, and if you use apps like Edge on both operating systems, it’s easy to switch seamlessly between devices.</p>",
            "<p>To get the Microsoft version of the Samsung Galaxy S9 for yourself, you can head straight to the <a href=\"https://www.microsoft.com/en-us/store/d/samsung-galaxy-s9-s9-unlocked/8mwx9nv6qt9j?ranMID=24542&amp;ranEAID=nOD%2frLJHOac&amp;ranSiteID=nOD_rLJHOac-fAtEGVHlB1uWpbt_HoshCA&amp;tduid=(2a8a2198b5d775e5c2c31ce3edbcfd42)(256380)(2459594)(nOD_rLJHOac-fAtEGVHlB1uWpbt_HoshCA)()&amp;activetab=pivot%3aoverviewtab\" target=\"_blank\" rel=\"noopener\">Microsoft Store</a>, where the phones are available for pre-order. Thankfully, they cost the same amount of money as the standard versions of the Samsung Galaxy S9.</p>",
            "<p>So far, the Galaxy S9 has been getting <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">pretty good initial reviews</a>. The phone features a pretty nice design and big, beautiful display. Under the hood it’s pretty impressive too — it offers Qualcomm’s latest and greatest chipset, the Snapdragon 845, along with 4GB of RAM in the standard Galaxy S9, or 6GB in the Galaxy S9 Plus. Perhaps the most interesting thing about the new phones, however, is the camera — which is among the first to offer a <a href=\"https://www.digitaltrends.com/photography/what-is-variable-aperture-samsung-galaxy-s9/\">variable aperture</a>.</p>"
        ]
    },
    {
        "title": "\n\t\tSamsung to offer same-day repairs for Galaxy smartphone owners\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>With just days until its official release, some lucky folks are already finding the new Samsung Galaxy S9 on their doorsteps. While the new features alone are sure to delight Galaxy S9 owners, Samsung is making it easier to repair your new device should it become damaged. The smartphone giant is partnering with uBreakiFix to offer same-day, in-person authorized service for Galaxy S9 and S9 Plus owners as well as older Galaxy devices including Galaxy S6, S7, S8 models, the Note8, and the Note5.</p>",
            "<p>Samsung’s partnership with uBreakiFix is just the latest in a series of new services meant to improve overall user experience Last year the company introduced the Samsung Premium Care program, offering in-home support and repair options. Now with the addition of uBreakiFix in-store repair options, users have even more flexibility when choosing a repair option. Michael Lawder, Samsung’s senior vice president of customer experience, called the partnership a “huge investment in customer experience” for Galaxy owners.</p>",
            "<p>The partnership with uBreakiFix doesn’t just benefit Samsung Premium Care customers, however — all Galaxy owners now have a convenient repair option with more than 300 authorized locations across the country for both in-warranty and out-of-warranty service. While the current number of authorized repair locations is impressive alone, Samsung hopes to add nearly 200 more locations to the mix by early 2019.</p>",
            "<p><a href=\"https://www.samsung.com/us/support/ubreakifix/\">Service appointments can be made online</a>, or you can simply walk into any authorized uBreakiFix location. While in-warranty repairs will be covered for free, pricing for any out-of-warranty repair is readily available on the <a href=\"http://ubreakifix.com/samsung\" target=\"_blank\" rel=\"noopener\">uBreakiFix website</a>, so there are no surprises. All on-site repairs are done by Samsung certified pros using genuine parts, meaning you won’t have to worry any issues down the road from aftermarket hardware. And the best part is that Samsung promises most repairs will be done in two hours.</p>",
            "<p>Samsung isn’t the first smartphone manufacturer to partner with uBreakiFix to provide authorized service. Google uses uBreakiFix as an authorized repair site for its Pixel devices as well. The company also offers out-of-warranty service for a number of smartphone manufacturers. Lawder told Digital Trends that Samsung chose to partner with uBreakiFix for authorized repairs because the company offers excellent customer service as well as convenient locations across the U.S.</p>",
            "<p>Of course, it is better to avoid repairs at all, if possible. The easiest ways to protect your Galaxy S9 or S9 Plus is with a <a href=\"https://www.digitaltrends.com/mobile/best-samsung-galaxy-s9-cases/\">good case</a> and <a href=\"https://www.digitaltrends.com/mobile/best-galaxy-s9-and-s9-plus-screen-protectors/\">screen protector</a>. Should you need a repair, extended warranty plans can save you a lot of money. While most carriers offer some form of extended warranty for their devices, the <a href=\"https://www.samsung.com/us/support/premium-care/\">Samsung Premium Care</a> plan offers excellent coverage with lots of additional perks for $12 a month.</p>"
        ]
    },
    {
        "title": "\n\t\tSamsung now offers 128GB and 256GB Galaxy S9, S9 Plus on website\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>Just months after Samsung launched its newest flagships, the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-review/\">Galaxy S9</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/samsung-galaxy-s9-plus-review/\">Galaxy S9 Plus</a>, the smartphone giant announced two new storage configurations for the phones. Both the Samsung Galaxy S9 and Galaxy S9 Plus will soon be available with 128GB and 256GB storage options.</p>",
            "<p>Samsung will offer the 128GB and 256GB versions of the Galaxy S9 and S9 Plus exclusively on its website. You can pre-order the phones beginning May 1 and will be able to purchase them on the Samsung website on May 18.</p>",
            "<p>The 128GB version of the Galaxy S9 will set you back $770, while the same storage configuration on the Galaxy S9 Plus comes in at $890. If you want to max out your internal storage, the 256GB Galaxy S9 sells for $820, and the S9 Plus will cost $940. Mind you all Galaxy S9 phones come with a MicroSD slot that will allow you to add up to 400GB of external memory.</p>",
            "<p>The decision to release extended storage options for the Galaxy S9 and S9 Plus in the U.S. is a nice surprise: In 2017 Samsung released a Galaxy S8 with 128GB of storage and 6GB of RAM, but the phone was only available in South Korea and China. While Samsung is selling two extended storage options of its flagships in the U.S. this year, neither include additional RAM.</p>",
            "<p>Samsung released the Galaxy S9 and S9 Plus this February at Mobile World Congress to rave reviews. While the phone features a powerful Qualcomm 845 (or Exynos 9810) processor and 4GB of RAM, many felt the 64GB of onboard storage was a little chintzy. The addition of a 128GB and 256GB storage option now places the Galaxy S9 and S9 Plus on a level playing field with other flagships like the <a href=\"https://www.digitaltrends.com/cell-phone-reviews/apple-iphone-x-review/\">iPhone X</a> and <a href=\"https://www.digitaltrends.com/cell-phone-reviews/google-pixel-2-xl-review/\">Pixel 2XL</a>.</p>",
            "<p>While the additional storage may be enough to convince some to pick up a Galaxy S9 or S9 Plus, Samsung is sweetening the deal for people who pre-order the device. If you pre-order either phone on the <a href=\"http://www.samsung.com/global/galaxy/galaxy-s9/\">Samsung</a> website between May 1 and May 17, you can pick up a <a href=\"https://www.digitaltrends.com/headphone-reviews/samsung-gear-iconx-2018-review/\">Gear IconX</a> (2018) for free or get a <a href=\"https://www.digitaltrends.com/wearables/samsung-gear-s3-tumi-edition-news/\">Gear S3 Frontier</a> for $100.</p>"
        ]
    },
    {
        "title": "\n\t\tSluggish Galaxy S9 sales lead to second-quarter slump for Samsung\t",
        "author": [
            "\n\t\t\t\t\t\tSteven Winkelman\t\t\t\t\t"
        ],
        "text": [
            "<p>After four quarters of record profits, things have taken a turn for Samsung.  The South Korean tech giant announced that its second quarter net profit was flat, due in part to a drop in smartphones profitability.</p>",
            "<p>Overall Samsung reported quarterly revenue at 58.48 trillion South Korean won ($52.27 billion), a 4-percent drop from this time last year. Overall profit however came in at 14.87 trillion won ($13.28 billion), around a six-percent increase year-over -year</p>",
            "<p>For its second quarter, Samsung posted a decline in revenue for its mobile business. Revenues for the quarter came in at 24 trillion won ($21 billion), down 20 percent from this time last year. Operating profit also took a sharp turn, down to 2.67 trillion won ($2.38 billion) from 4.06 trillion won ($3.63 billion) this time last year.</p>",
            "<p>The mobile phone division however is eager to make a turnaround for the third quarter and is taking aggressive steps to do so. It’s releasing its flagship Samsung Galaxy Note 9 on August 9, earlier than anticipated to allow more sales in the third quarter. It also stated it will become more aggressive on pricing.</p>",
            "<p>The report confirmed an earlier report by analyst Lee Seung-woo of Eugene Investments, who predicted slow sales of the  Galaxy S9 would dampen earnings this quarter. He expects the Samsung to ship about 31 million Galaxy S9 handsets in 2018. That number falls far below Samsung’s sales target of <a href=\"http://www.theinvestor.co.kr/view.php?ud=20180312000687\">43 million Galaxy S9</a> handsets.</p>",
            "<p>In addition to slow sales for the Galaxy S9, Samsung also stated softer sales on smartphone displays affected overall earnings for the quarter. In its quarterly statement Samsung reported that “weak demand for flexible OLED panels in the second quarter while the shipment and price for LCD panels also fell.” Additionally, Apple’s reported decision to shift more handsets from OLED displays to LCDs may have have something to do with the slump.</p>",
            "<p>The company was boosted however by strong sales of memory chips. Samsung Electronics became the <a href=\"https://www.marketwatch.com/story/samsung-passes-intel-as-worlds-no-1-chip-maker-2017-07-30\">No. 1 supplier of semiconductors</a> worldwide in 2017 and its sales of memory chips continue to outpace its competitors by a long distance. Strong demand for DRAM chips and NAND flash memory helped the company improve its quarter overall.</p>",
            "<p>Samsung may see a boost in fourth-quarter sales, though. The company is expected to announce new hardware in August, including the <a href=\"https://www.digitaltrends.com/mobile/samsung-galaxy-note-9-news/\">Galaxy Note 9</a>, <a href=\"https://www.digitaltrends.com/wearables/samsung-galaxy-watch-news/\">Samsung Gear S4</a>, and <a href=\"https://www.digitaltrends.com/mobile/samsung-galaxy-tab-s4-news/\">Samsung Galaxy Tab S4</a>. The products would likely go on sale during the third quarter, giving an extra bump to sales before the holiday season starts.</p>"
        ]
    }
]