[
    {
        "title": "Leaked Video of Alleged Pixel 3 Lite Details Almost Everything, Including a Launch Date",
        "author": "Sam Rutherford",
        "text": [
            "<p>It seems Google has a real problem with secrets, because after a <a href=\"https://gizmodo.com/this-could-be-the-cheap-pixel-3-people-were-hoping-for-1830501985\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/this-could-be-the-cheap-pixel-3-people-were-hoping-for-1830501985', {metric25:1})\">Russian blog shared info about the upcoming Pixel 3 Lite</a> late last year, now there’s a complete review of what appears to be a pre-production <a href=\"https://www.youtube.com/watch?v=pwaT4u-1Y60&amp;feature=youtu.be\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.youtube.com/watch?v=pwaT4u-1Y60&amp;feature=youtu.be', {metric25:1})\">Pixel 3 Lite on YouTube</a>. </p>",
            "<p>In accordance with previous leaks, Andro News claims the Pixel 3 Lite shown off in the video goes by the code name “Sargo.” The device seemingly confirms a few details from previous reports, such as its plastic body, Snapdragon 670 processor, and 5.5-inch screen. </p>",
            "<p class=\"has-video media-large video-embed align--bleed\"><span class=\"flex-video widescreen\"><iframe allowfullscreen=\"allowfullscreen\" data-chomp-id=\"pwaT4u-1Y60\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=youtube-video-pwaT4u-1Y60&amp;start=0\" data-recommend-id=\"youtube://pwaT4u-1Y60\" height=\"450\" id=\"youtube-pwaT4u-1Y60\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"800\" frameborder=\"0\"></iframe></span></p>",
            "<p>However, there are some notable changes and tidbits of new info about the Pixel 3 Lite in this video, including a possible release window.  Andro News says be Pixel 3 Lite will be available around Google I/O 2019, which typically takes place in May. Additionally, this apparent Pixel 3 Lite also sports a headphone jack, which is something <a href=\"https://gizmodo.com/this-could-be-the-cheap-pixel-3-people-were-hoping-for-1830501985#_ga=2.137127922.316976217.1547477548-1220318864.1537376527\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/this-could-be-the-cheap-pixel-3-people-were-hoping-for-1830501985#_ga=2.137127922.316976217.1547477548-1220318864.1537376527', {metric25:1})\">Rozetked</a> claimed the phone didn’t have in its leak from 2018. </p>",
            "<p>Other differences between this device and the standard Pixel 3 include bottom-mounted speakers instead of front-facing stereo speakers on the Pixel 3, slightly larger bezels, and what appears to be a new pale blue color option. Also, unlike the Pixel 3, the device  only comes with 32GB of base storage, which feels a bit skimpy for new phone in 2019. However, as a mid-range phone and with the support of Google’s various cloud storage options, the Pixel 3 Lite’s somewhat limited storage wouldn’t be a deal breaker. </p>",
            "<p>According to Andro News, the real exciting part about the Pixel 3 Lite is its picture taking abilities. That’s because while the Pixel 3 Lite  only features a single 12-MP rear camera, it apparently comes with a new autofocus sensor and  image quality similar to the standard Pixel 3. That’s a pretty big claim, but since much of the Pixel 3's photo magic lies in software, it’s not an entirely unbelievable.</p>",
            "<p>Based on the Russian language setting seen on this early Pixel 3 Lite, it’s possible that Andro News’ and Rozetked could share the same source when it comes to obtaining prototype units. However the new color scheme and headphone jack in this leak suggest that Andro News may have obtained a slightly more up-to-date sample.<br></p>",
            "<p>Either way, if the Pixel 3 Lite ends up being similar to what’s been shown off in leaks so far, we could be looking at a really solid mid-range phone and possibly the true spiritual successor to the now defunct Nexus phone line. The only major detail we don’t have much info on yet is price, however, if past history is any indication, I expect we’ll get more clues as we get closer to Google I/O in May. </p>",
            "<p>[<a href=\"https://www.youtube.com/watch?v=pwaT4u-1Y60\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.youtube.com/watch?v=pwaT4u-1Y60', {metric25:1})\">Andro News</a>]</p>"
        ]
    },
    {
        "title": "Google's Incredible Night Sight Mode Was Worth the Wait",
        "author": "Sam Rutherford",
        "text": [
            "<p>As good as the <a href=\"https://gizmodo.com/google-pixel-3-review-the-other-way-to-make-a-killer-p-1829749807\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-pixel-3-review-the-other-way-to-make-a-killer-p-1829749807', {metric25:1})\">Pixel 3</a> is, when Google released the phone last month, it sort of felt incomplete. Part of that feeling is due to Google’s software-first approach to smartphone design which means there’s always code being tinkered with, but the other part was simply because Google still hadn’t delivered two major Pixel 3 features the company teased prior to launch.<br></p>",
            "<p>But starting today, one of those missing additions, <a href=\"http://www.blog.google/products/pixel/see-light-night-sight/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'http://www.blog.google/products/pixel/see-light-night-sight/', {metric25:1})\">Night Sight</a>, is finally rolling out to Pixel 3 owners, and after having the chance to test it out for a few days, I can safely say Google’s sophisticated camera feature was worth the wait.</p>",
            "<p>Previously, when faced with certain low-light situations, the Pixel 3 sometimes struggled to best phones with larger aperture lenses like the <a href=\"https://gizmodo.com/samsungs-galaxy-note-9-is-the-best-big-phone-1828348138\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/samsungs-galaxy-note-9-is-the-best-big-phone-1828348138', {metric25:1})\">Galaxy Note 9</a>, or top sophisticated low-light techniques like Huawei’s impressive Night Mode, which really pushed the use of HDR photo processing when it debuted earlier this year on the <a href=\"https://gizmodo.com/huaweis-triple-camera-p20-pro-is-too-cool-for-america-1825647834\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/huaweis-triple-camera-p20-pro-is-too-cool-for-america-1825647834', {metric25:1})\">P20 Pro</a>.</p>",
            "<p>However, Night Sight changes all that, and thanks to Google flexing its computational photography skills, the Pixel 3 is now capable of capturing some incredible low-light pics. And to prove it, I took all the best smartphone cameras out for a side-by-side nighttime shootout.</p>",
            "<p>One quick note before we get to the pictures. Accessing Night Sight is as easy as scrolling over to the More tab in Google’s camera app and then tapping the icon for Night Sight. But when you actually shoot a picture, it’s not a simple click and you’re done. Similar to Huawei’s Night Mode, Night Sight shoots multiple images during a three to four-second window, and then combines those images together to create a final pic that looks better than each original frame on its own. That means to get the best results, you really need to try to hold your phone as steady as possible.</p>",
            "<p>OK, now onto the photos. To set a baseline, I started by taking two shots with the Pixel 3, one with Night Sight off and one with Night Sight on. And while in some respects, I like the pic taken without Night Sight more because its richer colors and darker exposure make for a moodier final image, when it comes to details and sharpness, the photo taken with Night Sight is clearly superior. Text on signs is clearer, the overall image is much less grainy, and you can even make out each individual brick in the building no matter where you’re looking.</p>",
            "<p>Next, I moved on to a face-off between the Pixel 3 and the Galaxy Note 9; a battle of computer smarts versus a wider f/1.5 lens aided by a touch of AI tuning. This time at a local bar, while both photos look pretty good zoomed out, you can still see things like the overly yellow color cast often produced by Samsung cameras in low light.</p>",
            "<p>But when you start pixel peeping at 100 percent, you can really appreciate little details from the general sharpness on every sign and sticker to the Pixel 3's ability to clearly capture the wood grain on the framed chalkboard and the texture on various beer taps.</p>",
            "<p>For the Pixel 3's third challenge, I shot a nighttime cityscape with it and Huawei’s new Mate 20 Pro. And once again, while the Pixel 3's pic does show some signs of over-sharpening like the hard pink outline on the lights at the top of the building in the middle, Night Sight still bested Huawei’s Night Mode, which up till now, was the best way to capture challenging low-light scenes.</p>",
            "<p>Also, while I was up there, I decided to see if Night Sight could work in combination with Google’s Super Res Zoom feature, and it seems it does. But the bigger shock is that for a camera with a supposed 3x zoom, the Mate 20 Pro’s Night Mode pic was a blurry mess compared to the Pixel 3's image. Now part of this may have been due to having to hand hold both phones, which is far from ideal, but both pics were shot one after another under the exact same circumstances, and I’m still struggling to work out why things turned out so poorly for the Mate 20 Pro. </p>",
            "<p>Finally, in what may have been the most difficult challenge, I took a shot using the Pixel 3 and an iPhone XS of a pizza lit almost solely by a single candle. And the difference couldn’t be more apparent. The colors in the Pixel 3's pic are brighter, it features better contrast, and despite a fair amount of noise in the dark background, everything else is just so much clearer. Suffice to say, if you take a lot of pics in dimly lit restaurants, the Pixel 3 and Night Sight is probably your ticket to way better food photography.</p>",
            "<p>Night Sight is exactly what the Pixel 3 needed to really round out its photo toolkit. But in strange way, the biggest winners of all this may be Pixel 1 and Pixel 2 owners, who will also be getting Night Sight over the next few days. Night Sight is available as an update the Pixel 3's camera app via a Play Store update starting today.<br></p>"
        ]
    },
    {
        "title": "Delightful Google Bug Seemingly Gives Pixel 3 XLs an Extra Helping of Notches",
        "author": "Andrew Liszewski",
        "text": [
            "<p><span class=\"\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=imgur-nmAUv69&amp;autosize=1\" id=\"imgur-nmAUv69\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"640\" frameborder=\"0\"></iframe></span></p>",
            "<p>Until Apple, Google, and the like find a way to hide front-facing cameras and sensors beneath their smartphones’ displays, notches are a hideously unfortunate design solution to maxing out screen real estate. The Pixel 3 has one of the worst notches, and making matters even worse for some Pixel 3 XL users is a <a href=\"https://twitter.com/kylegutschow/status/1055943231022788608\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://twitter.com/kylegutschow/status/1055943231022788608', {metric25:1})\">bizarre bug that’s reportedly putting even more notches</a> on their displays.<br></p>",
            "<p><span class=\"twitter-embed\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=twitter-1055943231022788608&amp;autosize=1\" height=\"159\" id=\"twitter-1055943231022788608\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"500\" frameborder=\"0\"></iframe></span></p>",
            "<p>Users such as <a href=\"https://twitter.com/kylegutschow/status/1055943231022788608\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://twitter.com/kylegutschow/status/1055943231022788608', {metric25:1})\">Kyle Gutschow</a> and <a href=\"https://twitter.com/UrAvgConsumer/status/1055215243637460992\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://twitter.com/UrAvgConsumer/status/1055215243637460992', {metric25:1})\">Judner Aura</a> have <a href=\"https://twitter.com/kylegutschow/status/1055943231022788608\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://twitter.com/kylegutschow/status/1055943231022788608', {metric25:1})\">shared images on Twitter</a> and <a href=\"https://www.reddit.com/r/GooglePixel/comments/9pu2qa/google_decided_i_needed_to_notch_that_ass_up/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.reddit.com/r/GooglePixel/comments/9pu2qa/google_decided_i_needed_to_notch_that_ass_up/', {metric25:1})\">Reddit</a> of a weird glitch where the UI element that Android uses to ‘hide’ the Pixel 3 XL’s front-facing camera and sensors shows up on the side of the display, in addition to the top. Some users claim that when simply rotating the phone between portrait and landscape modes, which forces a screen refresh, the additional notch will disappear, while others claim that a full reboot is needed to make it go away.</p>",
            "<p><span class=\"twitter-embed\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=twitter-1055215243637460992&amp;autosize=1\" height=\"159\" id=\"twitter-1055215243637460992\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"500\" frameborder=\"0\"></iframe></span></p>",
            "<p>We’ve reached out to Google for comment, but the company has <a href=\"https://www.androidpolice.com/2018/10/29/hilarious-pixel-3-xl-bug-adds-second-notch-side-screen/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidpolice.com/2018/10/29/hilarious-pixel-3-xl-bug-adds-second-notch-side-screen/', {metric25:1})\">already provided a statement to Android Police</a>, confirming the bug is known and will be addressed in a future software update. It is apparently not, as I initially suspected, an attempt to improve notch acceptance by flooding screens with more notches, and then removing all but one so that by itself it doesn’t seem so bad. </p>",
            "<p>(It still does.)</p>",
            "<p>[<a href=\"https://www.theverge.com/2018/10/29/18039170/pixel-3-xl-glitch-second-notch-fix\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.theverge.com/2018/10/29/18039170/pixel-3-xl-glitch-second-notch-fix', {metric25:1})\">The Verge</a>]</p>"
        ]
    },
    {
        "title": "Google Pixel 3 Users Say the Phone’s Best Feature is Borked Again",
        "author": "Victoria Song",
        "text": [
            "<p>There’s no doubting the <a href=\"https://gizmodo.com/google-pixel-3-review-the-other-way-to-make-a-killer-p-1829749807#_ga=2.89180123.1905119484.1542663688-1182680357.1539885723\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-pixel-3-review-the-other-way-to-make-a-killer-p-1829749807#_ga=2.89180123.1905119484.1542663688-1182680357.1539885723', {metric25:1})\">Pixel 3</a> has one of the best cameras out there. There’s also no denying it’s been beset by bugs since Google released it last month. Now, Pixel 3 owners say a yet another bug has the device serving up ‘fatal errors’ when they use the camera, and the issue apparently appears both in the main camera and through third-party apps.</p>",
            "<p>In lengthy threads on <a href=\"https://www.reddit.com/r/GooglePixel/comments/9sjfg1/very_frustrating_camera_problems_with_pixel_3/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.reddit.com/r/GooglePixel/comments/9sjfg1/very_frustrating_camera_problems_with_pixel_3/', {metric25:1})\">Reddit</a> and <a href=\"https://productforums.google.com/forum/?utm_medium=email&amp;utm_source=footer#!topic/phone-by-google/leO9GYO2irA;context-place=forum/phone-by-google\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://productforums.google.com/forum/?utm_medium=email&amp;utm_source=footer#!topic/phone-by-google/leO9GYO2irA;context-place=forum/phone-by-google', {metric25:1})\">Google’s Product Forums</a>, several users have described their Pixel 3 cameras quitting on them after trying to use the feature in any third-party app. Since October 22, there have been at least 108 replies to the Google Forum post alone. Users are reporting crashes in photo-heavy social media apps like Instagram, and some say the bug also impacts mobile deposits in banking apps, messaging, and even the flashlight app. Users have screen-capped the Pixel 3 camera simply showing a <a href=\"https://i.imgur.com/h4MgXKE.png\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://i.imgur.com/h4MgXKE.png', {metric25:1})\">blank screen</a>, or a message saying the camera encountered a “<a href=\"https://i.imgur.com/j3IYgp5.png\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://i.imgur.com/j3IYgp5.png', {metric25:1})\">fatal error</a>.”</p>",
            "<p>Rebooting the phone or performing a factory reset seems to solve the problem for some folks, while others say their cameras are still borked. One possible solution cited by users involves revoking third-party camera access. In a statement to <a href=\"https://www.buzzfeednews.com/article/mathonan/google-pixel-3-review-android\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.buzzfeednews.com/article/mathonan/google-pixel-3-review-android', {metric25:1})\">BuzzFeed</a>, Google said a fix was coming soon: “We’ve looked into reports of this issue and have identified a fix that will roll out in the coming weeks,” a spokesperson said. We’ve reached out to the company for more info.</p>",
            "<p>When it comes to Pixel 3 bugs, we’ve seen everything from <a href=\"https://gizmodo.com/delightful-google-bug-seemingly-gives-pixel-3-xls-an-ex-1830080828\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/delightful-google-bug-seemingly-gives-pixel-3-xls-an-ex-1830080828', {metric25:1})\">extra notches</a> to <a href=\"https://gizmodo.com/pixel-3-users-claim-their-text-messages-are-vanishing-1830434609\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/pixel-3-users-claim-their-text-messages-are-vanishing-1830434609', {metric25:1})\">disappearing text messages</a>. But these recent reports are worrying, as the Pixel 3's camera is its main selling point. To be clear, the device’s camera quality hasn’t technically changed—as we said last week, we were super impressed with <a href=\"https://gizmodo.com/googles-incredible-night-sight-mode-was-worth-the-wait-1830432540#_ga=2.256615243.1905119484.1542663688-1182680357.1539885723\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/googles-incredible-night-sight-mode-was-worth-the-wait-1830432540#_ga=2.256615243.1905119484.1542663688-1182680357.1539885723', {metric25:1})\">Google’s Night Sight</a> feature. But Google still has work to do to make sure the Pixel 3's best feature stays functional.</p>",
            "<p><strong>Update 5:57pm ET</strong>: A Google spokesperson later sent Gizmodo the following statement:</p>",
            "<p>[<a href=\"https://9to5google.com/2018/11/19/pixel-3-fatal-error-camera-bug-cant-connect-to-camera/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://9to5google.com/2018/11/19/pixel-3-fatal-error-camera-bug-cant-connect-to-camera/', {metric25:1})\">9to5 Google</a>, <a href=\"https://www.theverge.com/2018/11/20/18104506/pixel-3-camera-bug-third-party-apps-fix\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.theverge.com/2018/11/20/18104506/pixel-3-camera-bug-third-party-apps-fix', {metric25:1})\">The Verge</a>]</p>"
        ]
    },
    {
        "title": "The Pixel 3 Is Proof That Google Doesn't Care About Hardware",
        "author": "Sam Rutherford",
        "text": [
            "<p>After a rocky start with the <a href=\"https://gizmodo.com/the-google-pixel-is-too-dumb-and-ugly-to-replace-your-i-1787877249\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-google-pixel-is-too-dumb-and-ugly-to-replace-your-i-1787877249', {metric25:1})\">Pixel 1</a> (which remains one of the ugliest phones made this decade), a big—but still not fully realized—improvement on the <a href=\"https://gizmodo.com/pixel-2-review-google-sticks-to-what-it-does-best-1819557944\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/pixel-2-review-google-sticks-to-what-it-does-best-1819557944', {metric25:1})\">Pixel 2</a>, the <a href=\"https://gizmodo.com/google-pixel-3-review-the-other-way-to-make-a-killer-p-1829749807\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-pixel-3-review-the-other-way-to-make-a-killer-p-1829749807', {metric25:1})\">Pixel 3 came out</a> and finally made good on Google’s homegrown phone initiative. And unlike phones from Samsung or Huawei, the Pixel 3 achieved this not by hitting users over the head with tons of cameras or far-out hardware; it did it in the most Google way possible: With nifty software, intuitive design, and AI-powered smarts.<br></p>",
            "<p>But at the same time, the Pixel 3 is also one of the most frustrating phones of the year, because, for all of its upgrades and additions, it’s not difficult to see a number of small tweaks that would have made it so much better. And if you step back and look past the Pixel 3 itself, there are a lot of issues that show Google still has a long way to go before it can truly call itself a world-class phone maker.</p>",
            "<p>If you just look at the Pixel 3's specs, its price doesn’t make any sense. Sure, you get a Snapdragon 845 processor, which is the same chip found in every other flagship Android phone. But both the standard $700 Pixel and the $750 Pixel 3 XL—which have already been discounted $100 to $250 in the three months since its launch—only get 4GB of RAM.</p>",
            "<p>Compared to Samsung, while the <a href=\"https://gizmodo.com/samsung-galaxy-s9-review-the-best-android-phone-dont-n-1823575944\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/samsung-galaxy-s9-review-the-best-android-phone-dont-n-1823575944', {metric25:1})\">Galaxy S9</a> also has 4GB of memory, the S9+ gets 6GBs. But it’s OnePlus that really makes the Pixel 3's price look ridiculous by offering a config of <a href=\"https://gizmodo.com/oneplus-6t-review-the-no-bullshit-best-deal-in-smartph-1830066240\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/oneplus-6t-review-the-no-bullshit-best-deal-in-smartph-1830066240', {metric25:1})\">the OP6T</a> with 8GB of RAM and 128GB GBs of storage (both double what you get on a Pixel 3) for just $580. That’s an extra 64GB of room for stashing pictures, apps, videos, and anything else you save on your phone, while that extra RAM lets you keep multiple apps (games especially) suspended in the background, so you aren’t constantly forced to reload them into memory.</p>",
            "<p>What happened to the ethos of old Nexus phones that paired stock Android to well-built devices with reasonable price tags? With the cost of flagship phones hitting new highs every year, a really good $500 phone has never been more important, and yet, it’s a sector that so many companies are just ceding to OnePlus and other Chinese phone makers.</p>",
            "<p>Then there’s the Pixel 3's 5.5-inch 2160 x 1080 OLED screen. Compared to the 5.8-inch 2960 x 1440 display on the Galaxy S9, Samsung’s screen not only offers a higher pixel density, but it’s brighter and more vibrant as well. On top of that, like the iPhone, the Pixel 3 doesn’t have expandable storage or a headphone jack. So what are you paying for? Some black paint inside the USB-C port, wireless charging (a feature that should have been on last year’s Pixel 2), and a fancy soft-touch micro-etched glass back? The math just doesn’t add up.</p>",
            "<p>But what’s annoying is that as amazing as Google’s computational photography and HDR+ mode are, the Pixel 3 could be an even better picture taker if Google truly embraced the dual camera trend. It’s maddening because Google’s use of dual front-facing cams on the Pixel 3 for capturing super wide angle selfies demonstrates that the company is aware of the potential benefits of multiple cameras. And yet, on the back of the Pixel 3, one cam is all you get.</p>",
            "<p>Not even the larger Pixel 3 XL sports two, despite literally every other similarly-sized flagship phone this year featuring dual rear cams (or more in the case of the <a href=\"https://gizmodo.com/huaweis-mate-20-pro-is-a-technical-marvel-1830346004#_ga=2.240022085.73363231.1545052280-2135808592.1525885870\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/huaweis-mate-20-pro-is-a-technical-marvel-1830346004#_ga=2.240022085.73363231.1545052280-2135808592.1525885870', {metric25:1})\">Mate 20 Pro</a>, <a href=\"https://gizmodo.com/lgs-5-camera-phone-offers-a-snapshot-of-the-incredible-1829488124\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/lgs-5-camera-phone-offers-a-snapshot-of-the-incredible-1829488124', {metric25:1})\">LG V40</a>, and others). Just think how good the Pixel 3's long-distance photos could be if Google implemented Super Res Zoom on a camera with an optical 2x zoom lens. Or imagine how much better the Pixel 3's portrait mode would look if Google combined the extra depth info you’d get from a second image sensor with the sophisticated <a href=\"https://ai.googleblog.com/2018/11/learning-to-predict-depth-on-pixel-3.html\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://ai.googleblog.com/2018/11/learning-to-predict-depth-on-pixel-3.html', {metric25:1})\">learned depth</a> the Pixel 3 uses already.</p>",
            "<p>Then there’s the Pixel 3 XL’s big bathtub of a notch. Normally, I don’t care about notches—they are <a href=\"https://gizmodo.com/after-just-6-months-the-phone-notch-is-already-deeply-1823469447\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/after-just-6-months-the-phone-notch-is-already-deeply-1823469447', {metric25:1})\">simply an interim method for creating extra screen real estate while we wait for full bezel-less devices</a>. But the Pixel 3 XL’s notch is absolutely massive. It’s nearly two full rows of notifications tall, and even with that big bucktooth hanging down, the Pixel 3 XL still has an unusually large chin. WTF. You can have a notch <em>or</em> a chin, not both.</p>",
            "<p>All these inscrutable hardware decisions sort of hit on one overarching theme: That Google doesn’t really give a shit about hardware, at least not in the same way other gadget makers do. For a flagship, it feels like Google did the bare minimum needed to assemble the Pixel 3, and then relied on its software prowess to carry the phone the rest of the way. It’s not just the Pixel 3, just look across Google’s entire range of products, and in most cases, the company goes out of its way to avoid talking about specs or components.</p>",
            "<p>Instead, Google focuses on things like designs with bright, friendly colors and textured fabrics that fit in with modern living. It feels like Google hopes its devices will appear simple and innocuous like a light switch on a wall, which makes sense from an ease-of-use standpoint and for devices like the <a href=\"https://gizmodo.com/its-hard-not-to-love-the-google-home-mini-1819341054\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/its-hard-not-to-love-the-google-home-mini-1819341054', {metric25:1})\">Home Mini.</a> But if Google is really going to challenge Apple and Samsung, it needs to care more about hardware too.</p>",
            "<p>As for the Pixel 3's software, the company is doing amazing things to help combat robocalls with its built-in Call Screener, and streamline your life by letting the Google Assistant book your appointments. But at the same time, if Google is going to continue with its software-first approach to phone development, it needs to do a better job of crushing bugs. In the short time, the Pixel 3 has been out, the phone has suffered from<a href=\"https://gizmodo.com/the-pixel-3s-big-bug-fix-update-is-here-1830831935\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-pixel-3s-big-bug-fix-update-is-here-1830831935', {metric25:1})\"> RAM management issues that caused apps to close unexpectedly</a>, a <a href=\"https://gizmodo.com/google-pixel-3-users-say-the-phone-s-best-feature-is-bo-1830561287\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-pixel-3-users-say-the-phone-s-best-feature-is-bo-1830561287', {metric25:1})\">camera bug that caused photos not to save properly</a>, <a href=\"https://gizmodo.com/pixel-3-users-claim-their-text-messages-are-vanishing-1830434609\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/pixel-3-users-claim-their-text-messages-are-vanishing-1830434609', {metric25:1})\">disappearing texts</a>, <a href=\"https://9to5google.com/2018/11/08/pixel-3-overheating-charging/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://9to5google.com/2018/11/08/pixel-3-overheating-charging/', {metric25:1})\">issues with charging</a>, and more.</p>",
            "<p>Nothing ruins a new smartphone more than critical features like messaging or the camera not working, and as a reviewer, it’s frustrating to see people suffer from issues you didn’t experience while testing, especially when the only advice you can give is to say that “Google is working on patching the issue soon.”</p>",
            "<p>It’s a similar issue for features like <a href=\"https://9to5google.com/2018/11/28/comment-google-pixel-launch-buy/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://9to5google.com/2018/11/28/comment-google-pixel-launch-buy/', {metric25:1})\">Night Sight</a> and <a href=\"https://gizmodo.com/i-broke-google-duplex-but-its-still-impressive-1827131546\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/i-broke-google-duplex-but-its-still-impressive-1827131546', {metric25:1})\">Google Duplex</a>, because as good as they are, if you tease them at your launch event, they probably ought to be available when the phone first goes on sale. Is DLC something we need to worry about on phones now too?</p>",
            "<p>There are also other notable concerns like Google’s ramshackle quality control. For the <a href=\"https://gizmodo.com/google-is-investigating-an-issue-with-the-pixel-2-xl-s-1819765192\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-is-investigating-an-issue-with-the-pixel-2-xl-s-1819765192', {metric25:1})\">second year in a row</a>, Gizmodo got review devices featuring screens with markedly different color temperatures. And when I asked for comment on the issue, Google said some variances in manufacturing sometimes results in minor difference. But the thing is, iPhones and Galaxys don’t suffer from these kinds of issues, the Pixel shouldn’t either.</p>",
            "<p>Ben Schoon over at 9to5Google recently made a case that between all of the bugs and issues new Pixel owners tend to experience at launch—and all the price reductions that follow shortly after—<a href=\"https://9to5google.com/2018/11/28/comment-google-pixel-launch-buy/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://9to5google.com/2018/11/28/comment-google-pixel-launch-buy/', {metric25:1})\">that no one should buy a Pixel at launch ever again</a>. And while I won’t go that far (Google has one more chance to get it right), early Pixel adopters do seem to be treated more like beta testers more than buyers of any other phone.</p>",
            "<p>And when it comes to the way Google collects data from your phone, there’s unrest brewing. On the one hand, a lot of very handy features like traffic alerts for your daily commute, restaurants suggestions, and f<a href=\"https://gizmodo.com/googles-feature-for-predicting-flight-delays-actually-s-1831148930\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/googles-feature-for-predicting-flight-delays-actually-s-1831148930', {metric25:1})\">light delay predictions</a> are things that can only work if Google knows some pretty intimate details about you. But at the same time, concerns about privacy and data security are becoming more prevalent, and issues like <a href=\"https://www.apnews.com/828aefab64d4411bac257a07c1af0ecb\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.apnews.com/828aefab64d4411bac257a07c1af0ecb', {metric25:1})\">Android tracking</a> you even when you specifically turn the feature off isn’t helping anyone feel better about our new super-connected world.</p>",
            "<p>Lastly, Google’s partnership with Verizon as the “exclusive” retailer of the Pixel is bullshit. Yes, you can buy an unlocked Pixel 3 direct from Google and take it to pretty much any carrier you want, but if Google wants to compete with Apple and Samsung, the Pixel needs to be available in every carrier store, regardless of what name is on the sign outside.</p>",
            "<p>I still believe the Pixel 3 is the best phone for most people. But the gap between the Pixel 3 and other phones isn’t nearly as wide as it could have been. And after three years, while Google was finally able to put all the pieces together properly in creating the Pixel 3, until Google can offer the kind of quality control, stability, and value you get from iPhones and Galaxys, the Pixel may be forced to live in their shadows.</p>",
            "<p>  <a href=\"https://gizmodo.com/tag/smartphone-smackdown-2018\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/tag/smartphone-smackdown-2018', {metric25:1})\"><em>Smartphone Smackdown 2018:</em></a><em> This week we’re looking at the year’s very best smartphones—and what we didn’t like about them.</em></p>"
        ]
    },
    {
        "title": "This Could Be the Cheap Pixel 3 People Were Hoping for",
        "author": "Sam Rutherford",
        "text": [
            "<p><span class=\"twitter-embed\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=twitter-1063492014619144192&amp;autosize=1\" height=\"159\" id=\"twitter-1063492014619144192\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"500\" frameborder=\"0\"></iframe></span></p>",
            "<p>Back before the Pixel line was a thing, Google’s Nexus phones were prized for their solid builds, stock software (with day-one updates), and affordable prices. But after several generations of Pixels with flagship price tags, it’s seemed like making affordable phones was something Google left in the past. That may change, however, because a Russian gadget blog claims to have gotten its hands on the mid-range Pixel 3 people were hoping to see at Google’s most recent event.<br></p>",
            "<p>Acquired to <a href=\"https://rozetked.me/articles/3751-eksklyuziv-pixel-3-lite-sargo-v-nashih-rukah-s-jack-3-5-i-snapdragon-670\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://rozetked.me/articles/3751-eksklyuziv-pixel-3-lite-sargo-v-nashih-rukah-s-jack-3-5-i-snapdragon-670', {metric25:1})\">Rozetked</a>, the same blog that <a href=\"https://gizmodo.com/gigantic-leak-seemingly-blows-the-lid-off-googles-pixel-1828522906#_ga=2.32945853.2076877139.1542295344-1581414289.1541524565\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/gigantic-leak-seemingly-blows-the-lid-off-googles-pixel-1828522906#_ga=2.32945853.2076877139.1542295344-1581414289.1541524565', {metric25:1})\">leaked what turned out to be genuine versions of the Pixel 3</a> two months prior to launch, this new device appears to be a third, unreleased Pixel 3 model. Rozetked claims this is the device that was codenamed “Sargo,” which we first heard about earlier this summer after it was referenced in a few snippets of code in Google’s ARCore software.<br></p>",
            "<p>From the outside, it looks very similar to a standard Pixel 3, except that instead of a glass back, it apparently features a cheaper plastic rear panel and an FHD+ LCD display in place of the Pixel 3's AMOLED screen. Meanwhile, on the inside, the phone reportedly sports a mid-range Snapdragon 670 chip versus the Snapdragon 845 featured in the standard Pixel 3, along with 4GB of RAM(the same as a Pixel 3), and 32GB of storage. </p>",
            "<p>However, this apparent prototype has one thing its more expensive siblings don’t: a headphone jack. The rest of the phone’s specs are relatively unremarkable, according to Rozetked, including its 2,915 mAh battery and support for Qualcomm Quick Charge 4+. One small surprise is that it seems this device sports the same 8-MP and 12-MP front and rear cameras used on the current Pixel 3s. </p>",
            "<p><span class=\"twitter-embed\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=twitter-1063546020192313346&amp;autosize=1\" height=\"159\" id=\"twitter-1063546020192313346\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"500\" frameborder=\"0\"></iframe></span></p>",
            "<p>For all the people who wish Google would get back to offering solid mid-range devices, these photos offer a bit of hope. Rozetked claims this device—which has been dubbed the Pixel 3 Lite— carries a price tag between $400 to $500 and could be officially announced before the end of the year, or possibly sometime in early 2019. </p>",
            "<p>So while the Nexus line might be dead, this Pixel 3 Lite could be the successor stock Android fans have been waiting for since the <a href=\"https://gizmodo.com/the-nexus-5x-review-an-old-favorite-with-some-new-tric-1737670382\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-nexus-5x-review-an-old-favorite-with-some-new-tric-1737670382', {metric25:1})\">Nexus 5x</a> and <a href=\"https://gizmodo.com/the-nexus-6p-review-the-android-phone-for-everyone-1738315700\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-nexus-6p-review-the-android-phone-for-everyone-1738315700', {metric25:1})\">Nexus 6P</a> came out in late 2015. </p>",
            "<p>[<a href=\"https://rozetked.me/articles/3751-eksklyuziv-pixel-3-lite-sargo-v-nashih-rukah-s-jack-3-5-i-snapdragon-670\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://rozetked.me/articles/3751-eksklyuziv-pixel-3-lite-sargo-v-nashih-rukah-s-jack-3-5-i-snapdragon-670', {metric25:1})\">Rozetked</a>]</p>"
        ]
    },
    {
        "title": "Google's Pixel Stand Is a Smarter Breed of Wireless Charger",
        "author": "Sam Rutherford",
        "text": [
            "<p>In a world of increasingly complex tech, wireless chargers are refreshingly simple devices. Just take your phone, drop it on a pad or stand, and walk away. That’s it. And now that wireless charging is basically a standard feature for most flagship handsets, it’s quickly becoming the preferred way to keep your phone’s battery topped up. But what if your wireless charger could do more than just excite electrons without the need for wires or cables? Well, that’s exactly what Google is trying to do with the new <a href=\"https://store.google.com/us/product/pixel_stand?hl=en-US\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://store.google.com/us/product/pixel_stand?hl=en-US', {metric25:1})\">Pixel Stand</a>.<br></p>",
            "<p>To start, Google took a 10-watt wireless charging stand (<a href=\"https://gizmodo.com/we-tested-5-wireless-chargers-for-the-iphone-and-this-i-1821575429\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/we-tested-5-wireless-chargers-for-the-iphone-and-this-i-1821575429', {metric25:1})\">which is a bit faster than most wireless chargers</a>) and then it did what Google does best: programmed in a bunch of neat software tricks. And the result? When docked, the Pixel Stand transforms a Pixel 3 into a mini smart speaker plus <a href=\"https://gizmodo.com/googles-home-hub-is-a-great-start-to-a-smarter-home-1829844478#_ga=2.2570425.80129596.1540211252-2135808592.1525885870\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/googles-home-hub-is-a-great-start-to-a-smarter-home-1829844478#_ga=2.2570425.80129596.1540211252-2135808592.1525885870', {metric25:1})\">Home Hub</a>, with the potential to be even more in the future.</p>",
            "<p>Unlike like other wireless chargers, the Pixel Stand is smart (or at least smarter), so not only does it know where it is, it can also differentiate between different Pixel phones. There isn’t even a need to download the Pixel Stand app, as it should be pre-installed on all Pixel 3s. From there, you can name your stand before wading through its settings to best customize its functions for your needs</p>",
            "<p>If you’re someone who likes to keep a wireless charger next to the bed next to your bed, you can set it to automatically turn on Do Not Disturb mode so your phone won’t blink or vibrate when you’re trying to sleep. In fact, if you want to be even more specific, you can set the Pixel Stand to only turn on Do Not Disturb between set times, so that you can still see notifications during the day, and still get uninterrupted silence at night. And if you happen to have two Pixel Stands, say one at home and one at work, you can customize them individually to best suit their location.</p>",
            "<p>On top of the Pixel Stand’s charging and notification duties, Google also created custom music and photo interfaces, so that when a Pixel 3 is sitting on the stand, you can easily view things like album art and song titles at a glance, with big buttons along the bottom so you can pause and skip between tracks without needing to unlock the phone. Now, when you take into account the Pixel 3's powerful front-facing stereo speakers and the Pixel Stand’s bespoke music interface, suddenly everything begins to make sense. These products were designed in tandem, and when combined, a Pixel 3 essentially becomes Google Home Mini, except that unlike a Home Mini, it’s much easier to take your phone with you when you leave the room.</p>",
            "<p>As for pictures, the device’s dedicated gallery mode syncs with Google Photos and displays them on the Pixel 3's screen. You can set it to only pull images from specific albums (in case you’re worried about privacy) and it will even vary between single shots and a tw0-shot layout that makes the best of the phone’s real estate. So now, the Pixel Stand turns your phone into a mini digital picture frame too. But we’re not done yet.</p>",
            "<p>And for folks who have trouble getting up in the morning, the Pixel Stand also features what Google calls a Sunrise Alarm. The way it works is that based on whatever alarms you have set, 15 minutes before any noises go off, the Pixel 3's screen turns on and gradually shifts from orange to yellow in an attempt to wake you up more gently.</p>",
            "<p>However, because the Sunrise Alarm is reliant on the Pixel 3's screen for illumination, it doesn’t get quite as bright as a dedicated wake-up light. But if you prefer to sleep in pitch black light me, the extra yellow light is still quite noticeable. And if light alone isn’t enough to rouse you, when your alarm finally goes off, the Pixel Stand’s alarm screen also includes Snooze and Dismiss buttons so you can continue on (or not) with the rest of your day.</p>",
            "<p>Also, like everything else Google makes these days, the Pixel Stand also features Google Assistant integration. That means you can start your day by getting a quick rundown or your schedule and a weather forecast, control lights or other smart devices, or just ask it any other questions you might have.</p>",
            "<p>The Pixel Stand even has tie-ins with security gadgets like Nest’s Video Doorbell, so that anytime the camera senses motion, it will automatically send the video feed straight to your phone, assuming it’s sitting on a Pixel Stand. Sadly, this function is currently restricted to Google’s family of Nest devices, and while I did have a chance to see this in action during the Pixel 3 launch event, I don’t own any Nest products myself, so I haven’t been able to actually test it out. Hopefully, Google can partner up with more companies down the road so that this sort of functionality is available across a wider range of devices.</p>",
            "<p>Now as good as all this sounds, there are a few issues with the Pixel Stand. The most obvious of these is that none of these features work with non-Pixel phones, which is a real shame because many of the features are rooted in software, one might think it would be Google’s interest to make them available to the wider Android community. The other major problem is that while the Pixel Stand charges phones just fine in portrait or landscape mode, Google’s custom music screen only really works when the phone is resting vertically.</p>",
            "<p>I also had a few issues getting the Sunrise Alarm to work properly alongside Ambient Photo Mode, as the latter tended to override the alarm’s glowing wake up screen. And while the Pixel Stand boasts some relatively speedy charging speeds, priced at $80, it ain’t cheap either.</p>",
            "<p>Out of all this though, there’s one thing that feels truly shady. Thanks to its 10-watt wireless charging capabilities, the Pixel Stand topped off a Pixel 3 and Pixel 3 XL faster than other similarly priced chargers. That’s good, right? Well not really, because as part of its charging protocol, Google requires the Pixel 3 to establish a <a href=\"https://www.androidpolice.com/2018/10/22/google-limits-pixel-3-wireless-charging-rate-standard-5w-third-party-charging-pads/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidpolice.com/2018/10/22/google-limits-pixel-3-wireless-charging-rate-standard-5w-third-party-charging-pads/', {metric25:1})\">“secure handshake”</a> in order to get full 10-watt wireless charging. All non-Google-certified wireless stands are restricted to just 5-watt charging (even though the phone will say it’s “charging rapidly), regardless of their actual capabilities.</p>",
            "<p>This approach is a new spin on the walled ecosystems that Apple, Microsoft, and more recently, Google have built, and it doesn’t feel good. I’m sure part of the reasoning here is about protecting the device, but given all the smart capabilities of this stand, it seems like it should also be smart enough to detect how much juice is flowing in and regulate things appropriately, without the need to hamstring chargers made by other companies. Samsung and Apple don’t do this on their phones, and I wish Google wouldn’t either.</p>",
            "<p>But when compared to its less sophisticated brethren, the Pixel Stand serves as a reminder that wireless chargers can do more than just fill up your battery. And for anyone dead set on buying a new Pixel 3, I’d argue that a Pixel Stand is almost a required accessory, even if part of the reason for that is because Google refuses to play nice with others. It’s one part smart speaker, one part picture frame, and maybe someday, it will even be a portal into your home security. For $80, not only is the Pixel Stand an above average wireless charger, it makes an already intelligent phone just that much smarter.</p>",
            "<p><strong>[Update: 10/25 at 5:00 pm]</strong> We have updated the review to reflect that you can change the Pixel Stand’s settings even when your phone isn’t docked by going to Connected Devices &gt; Previously Connected Devices. Also, for retail Pixel 3 devices, there shouldn’t be a need to download the Pixel Stand app, as the app should come pre-installed.</p>"
        ]
    },
    {
        "title": "The Pixel 3 Won't Wirelessly Charge at Max Speed Except on Google-Approved Chargers",
        "author": "Tom McKay",
        "text": [
            "<p>If you’re considering getting one of Google’s new Pixel 3 devices, beware: Unless you use a Google-certified accessory, wireless fast charging will only work at half of the phone’s maximum 10 watt charging speed.<br></p>",
            "<p>Per reports in <a href=\"https://www.androidpolice.com/2018/10/23/google-limits-pixel-3-wireless-charging-rate-standard-5w-third-party-charging-pads/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidpolice.com/2018/10/23/google-limits-pixel-3-wireless-charging-rate-standard-5w-third-party-charging-pads/', {metric25:1})\">Android Police</a> and <a href=\"https://www.theverge.com/circuitbreaker/2018/10/23/18016492/google-pixel-3-fast-wireless-charging-approved-chargers-restriction-qi\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.theverge.com/circuitbreaker/2018/10/23/18016492/google-pixel-3-fast-wireless-charging-approved-chargers-restriction-qi', {metric25:1})\">the Verge</a>, unapproved models of wireless fast chargers will only work at 5 watt speed with the Pixel 3 line, despite it supporting the  Qi open wireless power transfer standard used by other manufacturers. Android Police wrote that Google told them the Pixel 3 line requires a “secure handshake” when using the company’s Pixel Stand to charge at 10 watts, and  the method involved isn’t supported by other chargers—and the  full 10-watt charging mode will only be enabled for third-party chargers  approved via its Made for Google program. Making things somewhat more confusing, Android Police noted that the Pixel 3 still displays a message saying “charging rapidly” when it’s connected to a third-party device charging at the lesser speed.</p>",
            "<p><a href=\"https://arstechnica.com/gadgets/2018/10/drm-for-chargers-google-pixel-3-locks-fast-qi-charging-to-its-own-79-stand/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://arstechnica.com/gadgets/2018/10/drm-for-chargers-google-pixel-3-locks-fast-qi-charging-to-its-own-79-stand/', {metric25:1})\">Ars Technica wrote</a> that Google told them in a statement that while the Pixel 3 supports Qi wireless charging, it only supports Qi charging via the 5 watt mode. The site also flagged a <a href=\"https://www.belkin.com/us/p/P-F7U050-MG/?irgwc=1&amp;clickid=RhTSHqWk4RYAQm2R5b1KFToCUkg1ic3YETIcQ80\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.belkin.com/us/p/P-F7U050-MG/?irgwc=1&amp;clickid=RhTSHqWk4RYAQm2R5b1KFToCUkg1ic3YETIcQ80', {metric25:1})\">Belkin product description</a> of an upcoming model mentioning “Google’s 10W proprietary wireless charging technology.”</p>",
            "<p>Finally, the Verge reported that Google confirmed the Pixel Stand does support other Qi-compatible devices, but only does so at the slower 5 watt rate. So a Pixel Stand is not going to charge rivals’ phones at the full speed, either.</p>",
            "<p>In a statement to the Verge, Google denied imposing any restrictions on third-party devices and said more options would be coming soon:</p>",
            "<p>The Pixel Stand costs a <a href=\"https://arstechnica.com/gadgets/2018/10/drm-for-chargers-google-pixel-3-locks-fast-qi-charging-to-its-own-79-stand/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://arstechnica.com/gadgets/2018/10/drm-for-chargers-google-pixel-3-locks-fast-qi-charging-to-its-own-79-stand/', {metric25:1})\">whopping $79</a>, and though it comes <a href=\"https://www.cnet.com/how-to/pixel-stand-5-things-to-know/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.cnet.com/how-to/pixel-stand-5-things-to-know/', {metric25:1})\">with other features</a> including Google Assistant and serving as a digital photo frame, that’s a massive premium over other third-party chargers which can cost as little as $15. The Belkin charger in question, which appeared to be the only other approved accessory listed yet, has a price of $59.99. Conversely, competitors’ devices largely support fast-charging speeds higher than 5 watts with broad cross-compatibility for chargers.</p>",
            "<p>Ars Technica compared the move to DRM, noting consumers will almost certainly not be pleased to discover they have to dig through their wallet to purchase an approved device:<br></p>",
            "<p>It is indeed somewhat strange Google, which had a roughly <a href=\"https://www.wired.co.uk/article/google-pixel-three-launch-market-share\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.wired.co.uk/article/google-pixel-three-launch-market-share', {metric25:1})\">two percent share</a> of the U.S. smartphone market earlier this year as well as negligible presence by the same metric elsewhere, decided on a wireless charging method sure to frustrate owners. While prices are likely to go down over time, it’s not clear cheap Google-certified wireless chargers will be widely available anytime soon. So factor that into your purchasing decision, especially if you’re the kind of person who regularly needs replacement accessories.</p>",
            "<p>Gizmodo has reached out to Google for comment, and we’ll update this post if we hear back.</p>",
            "<p>[<a href=\"https://www.androidpolice.com/2018/10/23/google-limits-pixel-3-wireless-charging-rate-standard-5w-third-party-charging-pads/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidpolice.com/2018/10/23/google-limits-pixel-3-wireless-charging-rate-standard-5w-third-party-charging-pads/', {metric25:1})\">Android Police</a> via <a href=\"https://www.theverge.com/circuitbreaker/2018/10/23/18016492/google-pixel-3-fast-wireless-charging-approved-chargers-restriction-qi\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.theverge.com/circuitbreaker/2018/10/23/18016492/google-pixel-3-fast-wireless-charging-approved-chargers-restriction-qi', {metric25:1})\">the Verge</a>]</p>"
        ]
    },
    {
        "title": "Google Promises a Fix for the Pixel 3's Biggest Issue 'in the Coming Weeks'",
        "author": "Sam Rutherford",
        "text": [
            "<p>With its nifty software tricks and superb camera, the <a href=\"https://gizmodo.com/google-pixel-3-review-the-other-way-to-make-a-killer-p-1829749807\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-pixel-3-review-the-other-way-to-make-a-killer-p-1829749807', {metric25:1})\">Pixel 3</a> is undoubtedly a good phone. But it ain’t perfect, and right now, the Pixel 3's biggest issue is wonky memory management.</p>",
            "<p>While it affects phones somewhat sporadically, problems with the Pixel’s 3 RAM management can cause apps to close unexpectedly in the background, or sometimes even shut down right in the middle of being used.</p>",
            "<p>Thankfully, it seems Google has identified the source of the issue and in a statement emailed to <a href=\"https://9to5google.com/2018/11/05/pixel-3-memory-issues-fix-update/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://9to5google.com/2018/11/05/pixel-3-memory-issues-fix-update/', {metric25:1})\">9to5Google,</a> a Google representative said the company is “rolling out a software update in the coming weeks to keep background apps from being prematurely closed in certain situations.”</p>",
            "<p>Now to be clear, for those that have been keeping track of Pixel 3 issues, the problem with memory management is separate, but not totally unrelated to the bug that sometimes resulted in the phone’s camera app not saving pictures. That was fixed via a <a href=\"https://www.androidpolice.com/2018/10/22/google-promises-fix-camera-bug-resulting-unsaved-photos/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidpolice.com/2018/10/22/google-promises-fix-camera-bug-resulting-unsaved-photos/', {metric25:1})\">software update in late October.</a> </p>",
            "<p>While there’s no specific timetable for when the upcoming patch will solve the Pixel 3's RAM woes, once that’s taken care of, the main things Pixel 3 owners can still look forward to is the arrival of Google’s low-light Night Sight camera mode and <a href=\"https://gizmodo.com/i-broke-google-duplex-but-its-still-impressive-1827131546\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/i-broke-google-duplex-but-its-still-impressive-1827131546', {metric25:1})\">Duplex</a>, the AI-powered phone call service that automatically books appointments or makes reservations for you.</p>",
            "<p>[<a href=\"https://9to5google.com/2018/11/05/pixel-3-memory-issues-fix-update/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://9to5google.com/2018/11/05/pixel-3-memory-issues-fix-update/', {metric25:1})\">9to5Google</a>]</p>"
        ]
    },
    {
        "title": "We're Liveblogging the Google Pixel 3 Event Right Here",
        "author": "Adam Clark Estes",
        "text": [
            "<p>As is the custom, Google’s big hardware day is here, and there have been so many leaks about the new Pixel phone, it practically feels like we’ve used it. Heck, some people <a href=\"https://gizmodo.com/capping-off-endless-leaks-the-pixel-3-xl-is-already-on-1829577936\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/capping-off-endless-leaks-the-pixel-3-xl-is-already-on-1829577936', {metric25:1})\">say they’ve already bought one</a>. But don’t let a few leaks spoil the fun. There are still bound to be some surprises.</p>",
            "<p>So the star of the Made by Google event is obviously going to be the Pixel 3 and the Pixel 3 XL. While lots of details about the phone have leaked, it’s still unclear how good the new camera system works, especially <a href=\"https://gizmodo.com/the-iphone-xs-is-forever-1829305262\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/the-iphone-xs-is-forever-1829305262', {metric25:1})\">given fresh competition</a> from the Apple iPhone XS. <a href=\"https://gizmodo.com/what-to-expect-from-googles-pixel-3-hardware-event-1829461865\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/what-to-expect-from-googles-pixel-3-hardware-event-1829461865', {metric25:1})\">We expect to see</a> a new Google Home with a display, a new Chromecast, new Pixel Buds, and possibly a new Chrome OS device. There’s always a chance Google will announce something zany, too, like last years Google Clips cameras, <a href=\"https://gizmodo.com/google-just-invented-lifelogging-1819146070\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-just-invented-lifelogging-1819146070', {metric25:1})\">a perplexing gadget</a> if we’ve ever seen one.</p>",
            "<p>The shindig kicks off at 11 a.m. ET and 8 a.m. PT. We’ll be live at the event in New York City and liveblogging below starting a little before then. You can also <a href=\"https://www.youtube.com/channel/UCIG1k8umaCIIrujZPzZPIMA\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.youtube.com/channel/UCIG1k8umaCIIrujZPzZPIMA', {metric25:1})\">watch it yourself on YouTube</a>.</p>"
        ]
    },
    {
        "title": "What to Expect From Google's Pixel 3 Hardware Event",
        "author": "Andrew Liszewski",
        "text": [
            "<p>In less than a week’s time Google will be holding court in New York to reveal some less-than-mysterious new hardware offerings. Those Pixel 3 and Pixel 3 XL smartphones might have been thoroughly leaked ahead of next week’s gathering, but what other surprises has Google managed to keep under wraps?<br></p>",
            "<p>The event officially gets under way at 11am ET on Tuesday, October 9, and as in past years you should be able to watch it live on YouTube. Gizmodo will  be there reporting on all the new hardware to find out what’s neat, what’s noteworthy, and what’s not worth your time. Until then, here’s a crash course on everything we expect to see.</p>",
            "<p>This one’s basically a foregone conclusion, and that’s not only because Google typically reveals its smartphones in October and the company tagged the official invite with the #madebygoogle hashtag it reserves for hardware. For months we’ve been inundated with <a href=\"https://gizmodo.com/is-this-really-what-the-google-pixel-3-will-look-like-1826421968#_ga=2.203869008.1124380106.1538414651-1778202016.1536932145\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/is-this-really-what-the-google-pixel-3-will-look-like-1826421968#_ga=2.203869008.1124380106.1538414651-1778202016.1536932145', {metric25:1})\">leak</a> after <a href=\"https://gizmodo.com/gigantic-leak-seemingly-blows-the-lid-off-googles-pixel-1828522906#_ga=2.203869008.1124380106.1538414651-1778202016.1536932145\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/gigantic-leak-seemingly-blows-the-lid-off-googles-pixel-1828522906#_ga=2.203869008.1124380106.1538414651-1778202016.1536932145', {metric25:1})\">leak</a> after <a href=\"https://gizmodo.com/google-s-notchless-pixel-3-seemingly-revealed-in-yet-an-1828728013#_ga=2.203869008.1124380106.1538414651-1778202016.1536932145\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-s-notchless-pixel-3-seemingly-revealed-in-yet-an-1828728013#_ga=2.203869008.1124380106.1538414651-1778202016.1536932145', {metric25:1})\">leak</a> of the devices leading up to this event.</p>",
            "<p><span class=\"twitter-embed\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=twitter-1032276175421353985&amp;autosize=1\" height=\"159\" id=\"twitter-1032276175421353985\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"500\" frameborder=\"0\"></iframe></span></p>",
            "<p>The <a href=\"https://gizmodo.com/gigantic-leak-seemingly-blows-the-lid-off-googles-pixel-1828522906#_ga=2.182265831.1124380106.1538414651-1778202016.1536932145\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/gigantic-leak-seemingly-blows-the-lid-off-googles-pixel-1828522906#_ga=2.182265831.1124380106.1538414651-1778202016.1536932145', {metric25:1})\">first and most thorough reveal</a> came from Russian blog <a href=\"https://rozetked.me/articles/2732-fotografii-google-pixel-3xl\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://rozetked.me/articles/2732-fotografii-google-pixel-3xl', {metric25:1})\">Rozetked</a>, which seemingly got its hands on a Pixel 3 XL almost two months ago. The leak appears to reveal that, at least for its larger handset, Google will also be embracing the notorious smartphone notch, while maintaining a larger bottom bezel to accommodate the Pixel’s forward-facing stereo speakers. The size of the Pixel 3 XL’s 2960 x 1440-pixel display hasn’t been confirmed yet, but the device apparently runs on a Snapdragon 845 processor and will come installed with Android 9 Pie—no surprises there.</p>",
            "<p><span class=\"twitter-embed\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=twitter-1032225048285855744&amp;autosize=1\" height=\"159\" id=\"twitter-1032225048285855744\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"500\" frameborder=\"0\"></iframe></span></p>",
            "<p><a href=\"https://rozetked.me/news/2792-primery-foto-na-google-pixel-3xl\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://rozetked.me/news/2792-primery-foto-na-google-pixel-3xl', {metric25:1})\">Rozetked</a> also took the opportunity to <a href=\"https://rozetked.me/news/2792-primery-foto-na-google-pixel-3xl\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://rozetked.me/news/2792-primery-foto-na-google-pixel-3xl', {metric25:1})\">try out the suspected Pixel 3 XL’s camera</a>, and the <a href=\"https://www.instagram.com/p/Bmgqbxpl9Zk/?utm_source=ig_web_copy_link\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.instagram.com/p/Bmgqbxpl9Zk/?utm_source=ig_web_copy_link', {metric25:1})\">results suggest</a> that the smartphone might once again out-perform other smartphone cameras on the market, which has been a hallmark selling point of the Pixel line in recent years.</p>",
            "<p>The leaked photos also revealed the smartphone’s packaging, which included what looked like a fully wired version of Google’s <a href=\"https://gizmodo.com/googles-pixel-buds-arent-even-close-to-being-good-1820411288#_ga=2.182265831.1124380106.1538414651-1778202016.1536932145\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/googles-pixel-buds-arent-even-close-to-being-good-1820411288#_ga=2.182265831.1124380106.1538414651-1778202016.1536932145', {metric25:1})\">Pixel Buds</a>, but they weren’t tested to see if they worked with the company’s Google Assistant or instant translation features like the wireless versions do.</p>",
            "<p><span class=\"\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=imgur-a/3KyuY4X&amp;autosize=1\" id=\"imgur-a/3KyuY4X\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"640\" frameborder=\"0\"></iframe></span></p>",
            "<p>Those of you with smaller hands and pockets <a href=\"https://gizmodo.com/google-s-notchless-pixel-3-seemingly-revealed-in-yet-an-1828728013#_ga=2.115032455.1041517054.1538481432-190464784.1538481432\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-s-notchless-pixel-3-seemingly-revealed-in-yet-an-1828728013#_ga=2.115032455.1041517054.1538481432-190464784.1538481432', {metric25:1})\">weren’t left out of the leak fun</a>, however. About a month ago a bunch of photos of the purported <a href=\"https://imgur.com/a/3KyuY4X\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://imgur.com/a/3KyuY4X', {metric25:1})\">Pixel 3 appeared in an Imgur gallery</a>, revealing a generous but reasonably-sized 5.5-inch screen (a half-inch larger than the Pixel 2), a two-tone back panel, a pair of eight-megapixel front-facing cameras that could facilitate wide-angle selfie shots, but no screen notch up top. Instead, the Pixel 3 will have aesthetically-pleasing matching bezels on the top and bottom.</p>",
            "<p>One other feature gleaned from the Pixel 3 photos is a battery with a potential capacity of around 3,000 mAh, which is not only larger than the Pixel 2's, but also larger than the 2,658 mAh battery Apple is including with the iPhone Xs.</p>",
            "<p><strong>Update 10/3/18 2:00pm EST</strong> — According to <a href=\"https://9to5google.com/2018/10/03/google-pixel-3-pre-orders-oct-9th-color-tease/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://9to5google.com/2018/10/03/google-pixel-3-pre-orders-oct-9th-color-tease/', {metric25:1})\">9to5Google</a>, Google sent an email to some of its customers that seemingly confirms that at least one of the products being revealed on October 9 will be available for pre-order immediately following the event:</p>",
            "<p>It seems vague, but the email also included an animated GIF of the number “3\" which could easily be interpreted to mean the new Pixel smartphones.</p>",
            "<p><strong>Update 10/4/18 12:51pm EST</strong> — <a href=\"https://www.androidheadlines.com/2018/10/google-pixel-3-xl-black-white-sand-pink.html\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidheadlines.com/2018/10/google-pixel-3-xl-black-white-sand-pink.html', {metric25:1})\">AndroidHeadlines</a> claims a reliable source has provided them with renders of not only the XL and regular versions of the Pixel 3, but <a href=\"https://www.androidheadlines.com/2018/10/google-pixel-3-xl-black-white-sand-pink.html\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidheadlines.com/2018/10/google-pixel-3-xl-black-white-sand-pink.html', {metric25:1})\">also the color options that will be available</a>. In addition to black and white, the Pixel 3s will possibly come in a light pink tint as well.</p>",
            "<p>Smart speakers became more than just talking heads when Amazon upgraded Alexa and the Echo Show with a touchscreen display back in 2017. Screens are now en vogue, and a smart addition as the <a href=\"https://gizmodo.com/google-and-lenovos-smart-display-trounces-amazons-in-ev-1827886084#_ga=2.114985095.1041517054.1538481432-190464784.1538481432\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-and-lenovos-smart-display-trounces-amazons-in-ev-1827886084#_ga=2.114985095.1041517054.1538481432-190464784.1538481432', {metric25:1})\">Lenovo Smart Display</a> for Google Assistant proved.</p>",
            "<p>So it comes as no surprise that back in August a <a href=\"https://asia.nikkei.com/Business/Business-Trends/Google-to-debut-display-equipped-AI-speaker-before-holidays\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://asia.nikkei.com/Business/Business-Trends/Google-to-debut-display-equipped-AI-speaker-before-holidays', {metric25:1})\">report from Nikkei</a> claimed <a href=\"https://gizmodo.com/google-may-finally-make-its-own-smart-speaker-with-a-sc-1828414631#_ga=2.118228105.1041517054.1538481432-190464784.1538481432\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-may-finally-make-its-own-smart-speaker-with-a-sc-1828414631#_ga=2.118228105.1041517054.1538481432-190464784.1538481432', {metric25:1})\">Google was planning to release a smart display of its own</a> ahead of the holiday season. A website called <a href=\"https://www.mysmartprice.com/gear/google-home-hub/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.mysmartprice.com/gear/google-home-hub/', {metric25:1})\">MySmartPrice</a> also shared what appears to be leaked renders of the device, revealing a seven-inch touchscreen. What remains to be seen is how Google could potentially differentiate its smart display from Lenovo’s, which runs stock Android and has enjoyed a few months head start. <a href=\"https://gizmodo.com/google-may-finally-make-its-own-smart-speaker-with-a-sc-1828414631\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-may-finally-make-its-own-smart-speaker-with-a-sc-1828414631', {metric25:1})\">Compatibility with smart home thermostats</a>? Extra functionality as a smart security camera for your home? Or will cute pastel colors be enough for these to outsell the competition?</p>",
            "<p>Yesterday <a href=\"https://www.theverge.com/circuitbreaker/2018/10/2/17925418/google-home-mini-new-aqua-blue-color-price-release-date\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.theverge.com/circuitbreaker/2018/10/2/17925418/google-home-mini-new-aqua-blue-color-price-release-date', {metric25:1})\">Google revealed a new Aqua-colored version of the Google Home Mini</a>, which seems to indicate the product isn’t going to see a  refresh next week. And if the pretty affordable  Home Mini isn’t getting an update this year, which is the most popular smart speaker Google sells, would the pricier Google Home be getting one? So far there’s no evidence that’s happening.</p>",
            "<p>Potentially <a href=\"https://gizmodo.com/did-the-fcc-just-reveal-google-s-next-streaming-dongle-1825155212\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/did-the-fcc-just-reveal-google-s-next-streaming-dongle-1825155212', {metric25:1})\">first leaked by FCC documentation</a> back in April, there’s now no doubt that a new version of Google’s streaming stick is en route after Best Buy sold a Chromecast 3 to a customer before the device was officially listed in the store’s system. Reddit user <a href=\"https://www.reddit.com/r/google/comments/9jtjww/i_think_i_bought_the_3rd_gen_chromecast_too_early/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.reddit.com/r/google/comments/9jtjww/i_think_i_bought_the_3rd_gen_chromecast_too_early/', {metric25:1})\">GroveStreetHomie shared a photo of the third-generation Chromecast</a> they managed to buy, which, according to previous leaks, will run on a quad-core Amlogic S905X processor powered by 2GB of RAM and 8GB of storage enabling 4K content to be streamed at up to 60 frames per second.</p>",
            "<p>When Apple killed the headphone jack, it tried to make up for it with a <a href=\"https://gizmodo.com/apple-airpods-are-too-simple-for-their-own-good-1790271698#_ga=2.106523907.1041517054.1538481432-190464784.1538481432\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/apple-airpods-are-too-simple-for-their-own-good-1790271698#_ga=2.106523907.1041517054.1538481432-190464784.1538481432', {metric25:1})\">great pair of wireless earbuds that helped fill the hole</a>. Google followed suit with its own wireless earbuds called the Pixel Buds that were, <a href=\"https://gizmodo.com/googles-pixel-buds-arent-even-close-to-being-good-1820411288#_ga=2.80413207.1041517054.1538481432-190464784.1538481432\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/googles-pixel-buds-arent-even-close-to-being-good-1820411288#_ga=2.80413207.1041517054.1538481432-190464784.1538481432', {metric25:1})\">by comparison, definitely not as great</a>. There’s a lot of room for improvement here, and a lot of catch up needed given how many excellent wireless earbud options are now on the market. Google could start by removing the cord that tethers the Pixel Buds together, improving the functionality of the charging case, and maybe even making that fancy real-time translation functionality available on more Android phones.</p>",
            "<p>The $1,000, transforming, Chrome OS-running Pixelbook is coming up on its one-year anniversary, which means it’s almost an antique at this point. Does Google plan to release an updated version with improved specs? There have been rumors about two successors in development code-named “Nocturne” and “Meowth” which were both apparently referenced in the Chromium source code (Google’s open-source web browser) earlier this year. </p>",
            "<p>According to <a href=\"https://9to5google.com/2018/09/27/nocturne-pixelbook-2-made-by-google-explained/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://9to5google.com/2018/09/27/nocturne-pixelbook-2-made-by-google-explained/', {metric25:1})\">9to5Google</a>, the new Pixelbook might actually be named the Pixel Slate and will come in the form of a Chrome OS-powered detachable tablet that can separate from a backlit keyboard accessory, instead of having it just flip out of the way beneath the screen. The Pixel Slate would potentially come in a version powered by Intel’s Kaby Lake processor for better performance, or the low-power Amber Lake variant for maximizing the device’s battery life and improving its price point.</p>",
            "<p>Other rumored features include a 3:2-ratio, 3,000 x 2,000-pixel display, two USB-C ports but no SD card slot, and a fingerprint sensor located on the tablet’s bezel.</p>",
            "<p>It would certainly be nice to see the developer of Wear OS release a smartwatch optimized for all the ins and outs of the wrist-worn operating system. But <a href=\"https://gizmodo.com/report-there-wont-be-any-google-smartwatch-this-year-1828763853#_ga=2.118228105.1041517054.1538481432-190464784.1538481432\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/report-there-wont-be-any-google-smartwatch-this-year-1828763853#_ga=2.118228105.1041517054.1538481432-190464784.1538481432', {metric25:1})\">2018 won’t be the year Google jumps on the wearable bandwagon</a>. During a <a href=\"https://www.tomsguide.com/us/no-pixel-watch-this-year,news-27956.html\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.tomsguide.com/us/no-pixel-watch-this-year,news-27956.html', {metric25:1})\">recent phone call with Tom’s Guide</a>, Miles Barr, Google’s director of engineering for Wear OS, confirmed the company had no plans to release a smartwatch this year, and would instead focus on improving Wear OS itself.</p>"
        ]
    },
    {
        "title": "Google Reportedly Vows Pixel 3 Camera Will Work Properly for Everyone Soon",
        "author": "Alex Cranz",
        "text": [
            "<p>A <a href=\"https://www.androidpolice.com/2018/10/19/google-pixel-3-latest-phone-suffer-photos-not-saved/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidpolice.com/2018/10/19/google-pixel-3-latest-phone-suffer-photos-not-saved/', {metric25:1})\">pernicious bug</a> has struck some Pixel 3 devices, leaving smartphone photographers missing many of the images they take. Per <a href=\"https://www.androidpolice.com/2018/10/22/google-promises-fix-camera-bug-resulting-unsaved-photos/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidpolice.com/2018/10/22/google-promises-fix-camera-bug-resulting-unsaved-photos/', {metric25:1})\">Android Police</a>, a fix for Google’s latest smartphone is on the way.</p>",
            "<p>While we found photos taken with the Pixel 3 to be mighty appealing, we have also been fortunate enough to not run into a bug that has <a href=\"https://www.reddit.com/r/Android/comments/9pbk6z/google_still_hasnt_fixed_the_issue_of_photos/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.reddit.com/r/Android/comments/9pbk6z/google_still_hasnt_fixed_the_issue_of_photos/', {metric25:1})\">left many rumblings on social media</a>. Periodically, photos taken with the phone simply won’t save for some users.</p>",
            "<p>The issue appears to occur when the Pixel 3's camera app shuts down immediately after a photo is taken—not having time to save the photo before closing. This could be due to a shortage of RAM. The Pixel 3 has just 4GB of RAM, while many other flagship (re: $800) Android phones have 6GB or more. <br></p>",
            "<p>In Android, applications shutting down suddenly is a common indication of a RAM shortage or a failure of the phone’s OS to manage memory appropriately, which is why many other Android phones have run into the issue, including all the earlier Pixels, the Nexus 5x, and a wide variety of budget devices.</p>",
            "<p>According to Android Police, Google says a fix will be rolled out to the Pixel 3 and Pixel 3 XL, as well as earlier Pixel devices, which also appear to have been affected (though without a similar online furor). It is not clear if this fix will affect all Android devices, or just the Pixel line—we’ve reached out to Google for clarification.</p>",
            "<p>“We will be rolling out a software update in the coming weeks to address the rare case of a photo not properly saving,” Google reportedly said.</p>",
            "<p>In the meanwhile, if you find yourself with a camera app that unexpectedly quits after a photo is taken, it might be a good idea to manually close other applications open on the device. Android is usually good about doing that itself, but clearly this isn’t always the case. Most phones should have a recent applications button (check the manufacturer website for your specific device) that shows all applications currently open. From there, you can quickly close any apps you don’t plan on using, forcibly making more memory available to the camera app.</p>",
            "<p>It’s not ideal, but it’s a reasonable solution until Google fixes things.</p>",
            "<p>[<a href=\"https://www.androidpolice.com/2018/10/22/google-promises-fix-camera-bug-resulting-unsaved-photos/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidpolice.com/2018/10/22/google-promises-fix-camera-bug-resulting-unsaved-photos/', {metric25:1})\">Android Police</a>]</p>"
        ]
    },
    {
        "title": "Pixel 3: Everything About Google's Great Android Phone Hope (Update: First Impressions)",
        "author": "Sam Rutherford",
        "text": [
            "<p>Google’s third-gen Pixels might be the most leaked phones ever. From numerous <a href=\"https://gizmodo.com/gigantic-leak-seemingly-blows-the-lid-off-googles-pixel-1828522906\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/gigantic-leak-seemingly-blows-the-lid-off-googles-pixel-1828522906', {metric25:1})\">Russian tech sites getting their hands</a> on production-ready devices to stores in Hong Kong selling <a href=\"https://www.engadget.com/2018/10/06/google-pixel-3-xl-hong-kong-leak-hands-on-video/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.engadget.com/2018/10/06/google-pixel-3-xl-hong-kong-leak-hands-on-video/', {metric25:1})\">handsets a week ahead</a> of the official announcement, there’s a lot info about the new Pixels floating around. But one thing all of the leaks couldn’t reveal were all the fancy software tricks that make the Pixels the finest Android phones around. Now we finally know the whole story.<br></p>",
            "<p>On the outside, the Pixel 3 doesn’t look all that different from its predecessors. However, Google says it’s using an entirely new matte glass on the back of the phones. It will come in three colors: black, white, and something Google is calling “Not Pink.”</p>",
            "<p>That standard Pixel 3 will feature a 5.5-inch screen, while the larger Pixel 3 XL will sport a 6.3-inch display. As suggested by the leaks, the Pixel 3 XL looks to maximize screen real estate with an edge-to-edge screen and a rather large notch on top, while the standard Pixel 3 offers a more traditional aesthetic with slim bezels on top and bottom. Thankfully, both phones feature the same flexible OLED touchscreen, so there shouldn’t be any major differences in colors between the devices like we saw <a href=\"https://gizmodo.com/google-is-investigating-an-issue-with-the-pixel-2-xl-s-1819765192\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-is-investigating-an-issue-with-the-pixel-2-xl-s-1819765192', {metric25:1})\">last year on the Pixel 2</a>.</p>",
            "<p>Elsewhere, Google says the Pixel 3's speakers should be about 40 percent louder than before and have been tuned with a special sound profile created by a Grammy-winning music producer. And to best show that off, Google will be giving new Pixel 3 owners six months of YouTube Music for free.</p>",
            "<p>Ok, so the new screen and speakers are nice, but since the beginning, Pixel phones’ most important feature has been its camera. But that doesn’t mean Google is hopping on the trend of adding tons of extra sensors to the back of its phones. Instead, Google is enhancing the camera software inside the phone to help you do things like take brighter, sharper, and more detailed photos even in challenging situations.</p>",
            "<p>On the Pixel 3, Google has created a custom imaging chip called the Pixel Visual Core and built it right into the phone, so you never have to worry about needing access to the cloud to make pics look their best. On top of that, there’s also a bunch of new photo modes like Top Shot, which automatically selects what it thinks is the best shot out of the bunch. And if you don’t like the photo the phone suggests, you can scroll through other images and select your favorite.</p>",
            "<p>Meanwhile, in lieu of adding a telephoto camera to the back of the Pixel 3, Google has created a new feature called Super Res Zoom that takes minutely different photos and then combines them in software to create a single, high-resolution pic. But the new photo features don’t stop there, because Google says the Pixel 3's Night Sight tool will let users create stunning low-light images without even using the phone’s flash. And for all the older Pixel phone owners out there, Night Sight is going to be available as an update later this year.</p>",
            "<p>In front, Google has upped the number of cams from one to two thanks to the addition of a new wide-angle camera so you can take group selfies with ease. Google claims the Pixel 3's front-facing camera offers a 184 percent larger field of view than an iPhone XS.</p>",
            "<p>And for a little bit of fun, Google is taking AR stickers and turning them into a whole new mode called Playground so you can add graphics and effects to pictures taken with both the front and rear cams. Google Lens is also getting an upgrade so that it will now work in real-time, which means you don’t need to snap a picture first if you want to identify a specific pair of shoes or sunglasses. There’s also Photo Booth Mode, Motion Auto Focus, and an even better Portrait Mode.</p>",
            "<p>To make Google’s new phones easier to live with, the Pixel 3 is also the first phone to get new features that can screen and block calls from scammers, along with a new gesture called “Flip to Shush” that will automatically put the phone in silent mode when its lying face down. And to protect all your info, the Pixel 3 also includes a Google Titan security chip to help cut down on any potential viruses or malware.</p>",
            "<p>After getting a chance to test out the new Pixel 3s in person, it feels like I’ve walked into an interesting dichotomy. On one hand, the Pixel 3's specs are relatively mundane. As you’d expect from a flagship Android device, you get a Qualcomm Snapdragon 845 chipset and your choice of 64GB or 128GB of storage. But the Pixel 3's 4GB of RAM and lack of microSD expandability seems a little skimpy for a $800 phone. The standard Pixel 3's battery also feels undersized at just 2,915 mAh.</p>",
            "<p>However, Google has improved the overall usage of the handset with Qi-based wireless charging (which is a first for a Pixel), while retaining IP68 water-resistance and improving the dual front-facing speakers to be what one Google rep called “loudest speakers” on any mainstream handset.</p>",
            "<p>But the most interesting thing about the Pixel 3's design is its new glass back. It still has that same two-tone look seen on previous Pixels, except this time its one continuous panel, which should improve strength and rigidity. On top of that, the texture of the glass switches a third of the way down the phone to something that feels like the soft-touch finish you get on ThinkPads and other laptops. But according to Google Pixel product manager Peter Prunuske, the texture isn’t just a coating that might rub off two or three months down the road, it’s actually a new special etching technique that results in a more grippy, less drop-prone feel.</p>",
            "<p>The biggest changes for the Pixel 3, however, are its software upgrades. Throughout the phone, Google has tailored the Pixel’s Android experience to be a smarter, more accommodating affair. That’s most obvious when it comes to the camera, because while the Pixel 3's rear camera resolution has stayed pat at 12-MP, it’s also the only flagship phone this year to feature just one camera on its back, even in its jumbo version. <br></p>",
            "<p>For its new Top Shot feature, Google has taken nods from high-end Olympus cameras by letting the phone capture images both before and after the shutter is pressed. From there, the phone can tell if someone was blinking or if a random object got in the way, which will prompt the phone to recommend a different frame that doesn’t have those issues.</p>",
            "<p>The Pixel 3's integration with the new Pixel Stand wireless charger is also surprisingly deep. Not only can you set your phone to automatically turn on Do-not-disturb mode when placed on the charger, by leveraging the Google Assistant, the Pixel Stand turns a Pixel 3 into a mini Home Hub of sorts.</p>",
            "<p>When paired, the Pixel 3 can show the live view from a Nest security camera anytime something triggers the motion sensor. Or you can use the Pixel 3 as a planning tool or smart speaker so you can see things like appointments or album art at a glance while you’re getting ready in the morning. While I want to test the two together more, the Pixel Stand seems like its going to be a mandatory add-on for anyone who buys a Pixel 3.</p>",
            "<p>The Pixel 3 is available for pre-order today starting at $800 for the standard Pixel 3, or $900 for the Pixel 3 XL. Shipments for pre-orders are expected to go out starting October 18th.</p>"
        ]
    },
    {
        "title": "Phones Are So Boring, I Want to Believe This Wild Pixel 3 Theory",
        "author": "Sam Rutherford",
        "text": [
            "<p>Yesterday, Google <a href=\"https://gizmodo.com/google-day-finally-gets-an-official-date-october-9-1828869359\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-day-finally-gets-an-official-date-october-9-1828869359', {metric25:1})\">finally sent out invites</a> for its annual fall product event set for October 9, and even with the <a href=\"https://gizmodo.com/tag/pixel-3\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/tag/pixel-3', {metric25:1})\">preponderance of leaks</a> showing the alleged Pixel 3 and Pixel 3 XL, the announcement instantly reinvigorated speculation about what else Google might have planned for the day.</p>",
            "<p>That brings us to YouTube channel Front Page Tech (FPT), which—shortly following Google’s invite announcement—<a href=\"https://www.youtube.com/watch?v=wNXXHJeejpI&amp;lc=UgwImSaVB1OMiY1BOsl4AaABAg\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.youtube.com/watch?v=wNXXHJeejpI&amp;lc=UgwImSaVB1OMiY1BOsl4AaABAg', {metric25:1})\">posted a video</a> claiming that someone from Google’s hardware team had reached out to them, apparently asking for permission to use a clip from a previous FPT episode during the October 9 product event.</p>",
            "<p class=\"has-video media-large video-embed align--bleed\"><span class=\"flex-video widescreen\"><iframe allowfullscreen=\"allowfullscreen\" data-chomp-id=\"wNXXHJeejpI\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=youtube-video-wNXXHJeejpI&amp;start=0\" data-recommend-id=\"youtube://wNXXHJeejpI\" height=\"450\" id=\"youtube-wNXXHJeejpI\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"800\" frameborder=\"0\"></iframe></span></p>",
            "<p>Where things start to get weird is that for the last few weeks, FPT’s Pixel 3 coverage has primarily consisted of videos hating on Google’s rumored phone for being ugly and poorly designed. Front Page Tech also claims that Google has reached out to a “handful” of other YouTubers, allegedly asking the channels for permission to use their clips to create “a very specific narrative,” since “all of the clips are people mocking them about the leaks and how terrible the phone looks.”</p>",
            "<p>This brings us to FPT’s wild theory—that, apparently, the only reason Google would ask for permission to play clips of people trashing the design of its leaked Pixel 3 is if those “leaks” were actually all just a smokescreen to distract the  media, while Google preps to show off entirely different devices in October.</p>",
            "<p>Now, speculation like this is as close to tinfoil hat territory as gadgets blogs will typically get, because if it’s true, it might be one of the greatest misinformation campaign pulled off by a company in the internet age. </p>",
            "<p>However, the sheer number of Pixel 3 and Pixel 3 XL leaks seem somewhat suspect, too. Over the past couple weeks, almost every day new reports have popped up about unannounced Pixel phones  being sighted all over the globe.</p>",
            "<p>There was the case of <a href=\"https://gizmodo.com/gigantic-leak-seemingly-blows-the-lid-off-googles-pixel-1828522906\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/gigantic-leak-seemingly-blows-the-lid-off-googles-pixel-1828522906', {metric25:1})\">multiple Russian blogs</a> that allegedly obtained final production Pixel 3 XL’s after they had apparently been stolen while in transit. Then there were numerous reports of an unnamed person spotted using a Pixel 3 XL <a href=\"https://mobilesyrup.com/2018/08/20/pixel-3-xl-spotted-ttc-toronto/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://mobilesyrup.com/2018/08/20/pixel-3-xl-spotted-ttc-toronto/', {metric25:1})\">while riding the subway in Toronto.</a> Later, someone posted photos of a regular <a href=\"https://gizmodo.com/google-s-notchless-pixel-3-seemingly-revealed-in-yet-an-1828728013\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-s-notchless-pixel-3-seemingly-revealed-in-yet-an-1828728013', {metric25:1})\">Pixel 3 showing a notchless design</a> that looked very different from what we’ve seen so far of the Pixel 3 XL. And earlier this week, there was yet another Pixel 3 XL sighting after the phone had <a href=\"https://gizmodo.com/someone-allegedly-left-a-pixel-3-xl-in-the-back-of-a-ly-1828776098\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/someone-allegedly-left-a-pixel-3-xl-in-the-back-of-a-ly-1828776098', {metric25:1})\">supposedly been left in the back of a Lyft.</a> </p>",
            "<p>Look, leaks get out. Shit happens. I get it. But the sheer number of alleged Pixel 3 leaks either means that Google has some of the most inept security when it comes to guarding info about unreleased devices, or there’s simply more going on than all these leaks have shown so far. This is not typical for companies like Google.</p>",
            "<p>That said, it’s still difficult to seriously buy into Front Page Tech’s Google Pixel 3 Bamboozle theory. But in the back of my mind, I kind of hope he’s right. 2018 hasn’t exactly been the most interesting year for phones, and a major part of Google’s fall launch event has seemingly already been spoiled, undercutting much of the excitement. If these fake leaks do result in some real surprises on October 9, then kudos to Google. I wish you the best in your trolling.</p>"
        ]
    },
    {
        "title": "If You Don’t Like the Pixel 3 XL’s New Notch, Google Says You Can Hide It",
        "author": "Andrew Liszewski",
        "text": [
            "<p>Notch haters of the world certainly had one more thing to complain about yesterday, as Google confirmed the <a href=\"https://gizmodo.com/pixel-3-everything-about-googles-great-android-phone-h-1829623157\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/pixel-3-everything-about-googles-great-android-phone-h-1829623157', {metric25:1})\">XL version of the new Pixel 3</a> would include a cutout at the top of the screen to accommodate the phone’s two front-facing cameras and sensors. But in a tweet yesterday, the Made by Google account noted that the <a href=\"https://twitter.com/madebygoogle/status/1049734782173605888\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://twitter.com/madebygoogle/status/1049734782173605888', {metric25:1})\">notch could be hidden</a> if you “prefer a more traditional smartphone look.”</p>",
            "<p>Replying to Twitter user <a href=\"https://twitter.com/mo7ammad_uj\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://twitter.com/mo7ammad_uj', {metric25:1})\">@mo7ammad_uj</a>’s question about hiding the Pixel 3 XL’s notch—as competing devices like the Xiaomi Pocophone F1 allow—Google’s account points out that it is indeed an option in Android Pie, although one currently only available <a href=\"https://www.androidauthority.com/hide-google-pixel-3-xl-notch-912675/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.androidauthority.com/hide-google-pixel-3-xl-notch-912675/', {metric25:1})\">inside a hidden Developer Options page</a>.</p>",
            "<p><span class=\"twitter-embed\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=twitter-1049734782173605888&amp;autosize=1\" height=\"159\" id=\"twitter-1049734782173605888\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"500\" frameborder=\"0\"></iframe></span></p>",
            "<p>The option will certainly make some potential Pixel 3 buyers happy, and we’ve reached out to Google to find out if the disappearing act will eventually be made more readily available to consumers, but the phone’s camera lenses and speakers up there aren’t really going anywhere. Instead, with the option turned on, the small sections of screen on either side of the notch simply get blacked out, creating a large bar that runs all the way across the top of the display.</p>",
            "<p><span class=\"twitter-embed\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=twitter-1050036131419607043&amp;autosize=1\" height=\"159\" id=\"twitter-1050036131419607043\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"500\" frameborder=\"0\"></iframe></span></p>",
            "<p>Whether those areas will always be lost screen real estate, or could one day be used to show status icons, is unclear. But users testing the developer option have found Android Pie’s clock and other icons simply pushed down and placed below the added black bar.</p>",
            "<p>[<a href=\"https://twitter.com/madebygoogle/status/1049734782173605888\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://twitter.com/madebygoogle/status/1049734782173605888', {metric25:1})\">Twitter</a> via <a href=\"https://www.engadget.com/2018/10/10/google-hide-pixel-3-xl-notch/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.engadget.com/2018/10/10/google-hide-pixel-3-xl-notch/', {metric25:1})\">Engadget</a>]</p>"
        ]
    },
    {
        "title": "Leaked Pics Show a Scary-Big Notch on an Alleged Pixel 3",
        "author": "Sam Rutherford",
        "text": [
            "<p>Based on the timing of last year’s <a href=\"https://www.google.com/search?q=pixel+2+launch+gizmodo&amp;rlz=1C1CHBF_enUS758US758&amp;oq=pixel+2+launch+gizmodo&amp;aqs=chrome..69i57.4183j0j7&amp;sourceid=chrome&amp;ie=UTF-8\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://www.google.com/search?q=pixel+2+launch+gizmodo&amp;rlz=1C1CHBF_enUS758US758&amp;oq=pixel+2+launch+gizmodo&amp;aqs=chrome..69i57.4183j0j7&amp;sourceid=chrome&amp;ie=UTF-8', {metric25:1})\">Pixel 2 launch</a>, we’re still a solid two months away from confirming whatever Google has planned for 2018. But that isn’t going to stop internet sleuths from trying to dig up any info they can. Over the weekend, two leaks popped up that could have some interesting consequences for what Google eventually announces later this year.<br></p>",
            "<p>The first piece of news comes from a post on the <a href=\"https://forum.xda-developers.com/pixel-2-xl/how-to/white-pixel-3-xl-pictures-xda-exclusive-t3822357\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://forum.xda-developers.com/pixel-2-xl/how-to/white-pixel-3-xl-pictures-xda-exclusive-t3822357', {metric25:1})\">XDA Developers forum</a> (<a href=\"https://imgur.com/a/upSdt3Z\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://imgur.com/a/upSdt3Z', {metric25:1})\">Imgur mirror here</a>) showing what appears to be leaked photos of the upcoming Pixel 3. While the first shot of the phone’s back doesn’t seem all that intriguing, aside from the lack of the two-toned design seen on <a href=\"https://gizmodo.com/pixel-2-review-google-sticks-to-what-it-does-best-1819557944\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/pixel-2-review-google-sticks-to-what-it-does-best-1819557944', {metric25:1})\">previous Pixels</a> and the absence of dual rear cameras, the front of the phone looks to be much more divisive. </p>",
            "<p><span class=\"twitter-embed\"><iframe allowfullscreen=\"allowfullscreen\" scrolling=\"no\" mozallowfullscreen=\"mozallowfullscreen\" data-src=\"/ajax/inset/iframe?id=twitter-1023608601774968832&amp;autosize=1\" height=\"159\" id=\"twitter-1023608601774968832\" webkitallowfullscreen=\"webkitAllowFullScreen\" class=\"core-inset lazyload\" width=\"500\" frameborder=\"0\"></iframe></span></p>",
            "<p>I mean, just look at it. That notch is huge. I’ve argued before that there’s <a href=\"https://gizmodo.com/after-just-6-months-the-phone-notch-is-already-deeply-1823469447\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/after-just-6-months-the-phone-notch-is-already-deeply-1823469447', {metric25:1})\">no sense in getting worked up about notches</a>, as they are often a practical solution to giving consumers a little extra screen. But the notch on this alleged Pixel 3 is a bit different. The sheer size of that sensor cluster looks like it will dwarf everything else on the market, while also protruding into the screen quite significantly. It’s a bold look for sure, but this might be an example of the whole notch trend taken a bit too far. </p>",
            "<p>The other piece of  Pixel news comes in the form of some code discovered by <a href=\"https://9to5google.com/2018/07/28/pixel-stand-google-pixel-3-assistant/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://9to5google.com/2018/07/28/pixel-stand-google-pixel-3-assistant/', {metric25:1})\">9to5Google</a> hidden within the latest version of the Google app, which sports a mention of a trusted dock and a string that says:</p>",
            "<p>While this isn’t the first time we’ve heard about <a href=\"https://9to5google.com/2018/06/15/google-app-8-8-apk-insight-teardown/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://9to5google.com/2018/06/15/google-app-8-8-apk-insight-teardown/', {metric25:1})\">Google potentially making a dock</a> intended for use with Pixel phones, the latest snippet of code paints a much better picture of what that device might actually be. On top of apparently being a standard wireless charger, which suggests the next Pixel will support wireless charging for the first time, it seems this “Pixel Stand” could also turn your phone into smart speaker of sorts that would use the phone’s screen to display info when appropriate.  </p>",
            "<p>Considering the recent launch of Google and Lenovo’s first <a href=\"https://gizmodo.com/google-and-lenovos-smart-display-trounces-amazons-in-ev-1827886084\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-and-lenovos-smart-display-trounces-amazons-in-ev-1827886084', {metric25:1})\">Smart Display</a>, the Pixel Stand could help Google build out its <a href=\"https://gizmodo.com/google-just-turned-a-huge-corner-in-the-smart-speaker-g-1826290334\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-just-turned-a-huge-corner-in-the-smart-speaker-g-1826290334', {metric25:1})\">quickly growing smart home lineup</a>, while also helping to bridge the gap between the $130 Google Home, the <a href=\"https://gizmodo.com/its-hard-not-to-love-the-google-home-mini-1819341054\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/its-hard-not-to-love-the-google-home-mini-1819341054', {metric25:1})\">$50 Home Mini</a>, and the Smart Display, which starts at $200. </p>",
            "<p>It’s still a bit too early to take any of these leaks as fact. However, if the Pixel 3 does end up sporting a humongous notch, it’s possible that Google’s most interesting product this fall will end up being the Pixel’s new accessories rather than the phone itself. </p>",
            "<p>[<a href=\"https://forum.xda-developers.com/pixel-2-xl/how-to/white-pixel-3-xl-pictures-xda-exclusive-t3822357\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://forum.xda-developers.com/pixel-2-xl/how-to/white-pixel-3-xl-pictures-xda-exclusive-t3822357', {metric25:1})\">XDA Developers</a>, <a href=\"https://9to5google.com/2018/07/28/pixel-stand-google-pixel-3-assistant/\" target=\"_blank\" rel=\"noopener\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'External link', 'https://9to5google.com/2018/07/28/pixel-stand-google-pixel-3-assistant/', {metric25:1})\">9to5Google</a>]</p>"
        ]
    },
    {
        "title": "Google Pixel 3 Review: The Other Way to Make a Killer Phone",
        "author": "Sam Rutherford",
        "text": [
            "<p>The history of smartphone improvement has largely relied on companies cramming faster or more powerful components into the now ubiquitous glass slabs we carry around. But the Pixel 3 is something else. Instead of focusing on things like a brighter screen, tons of RAM, or multiple rear cameras, almost all of the Pixel 3's advantages come from a software-first mindset. This results in a smarter, more intuitive experience that feels very different from the hardware-driven approaches employed by many of Google’s competitors. And while this isn’t Google’s first attempt at something like this, this third Pixel (we evaluated both it and the Pixel 3 XL) is the device that really pulls all of Google’s efforts together and makes it feel special.<br></p>",
            "<p>For those unfamiliar with the latest version of Android 9 Pie, Google’s mobile OS is what ties everything together. Clean and unfettered by add-ons or extra BS, Android on the Pixel 3 feels fast and snappy unlike anything else, though it’s difficult to say if that is simply the result of speedier animations or superior software optimization. Then you add on things like Google’s Living Wallpapers (which are endlessly entertaining), features from previous Pixels like Google’s Now Playing song ID feature, and the new stuff like Call Screen. You end up with one of, if not the most considered out-of-the-box smartphones experiences, no customizing required. In fact, Google’s Call Screen feature, which lets the Google Assistant intercept phone spam, may be the most important development since caller ID.</p>",
            "<p>But nowhere is Google’s software prowess more evident than with the Pixel 3's cameras, which largely eschew the current trend of cramming as many sensors and lenses onto a phone as possible in favor of sophisticated computational photography. For the rear camera, this means that in everyday situations, the Pixel 3's lone 12-MP camera often has an edge over Apple’s iPhone or a Samsung Galaxy in terms of colors and sharpness. And when it comes to things like cityscapes, Google’s HDR+ mode is especially engaging as it merges multiple frames and exposures together to produce shots with more detail in bright spots and richer colors and shady areas, often defying what you think is possible from a smartphone camera.</p>",
            "<p>There’s also the new Top Shot feature that uses machine learning to pick out bad shots where someone is blinking and suggest something better. And while it is a somewhat niche ability, when it works and you figure out how to tell that it’s on (make sure the Motion toggle is turned on), Top Shot plus Google’s gif-like Motion photos, burst mode, Photobooth mode, and AR-powered Playground mode means that there’s always fun to be had when taking pictures. (More on Top Shot way below.)</p>",
            "<p>I also love the Pixel 3's front cameras, which take the phone’s HDR processing and combines with it a second 8-MP camera to marry the best of what software and hardware can offer. That’s because as long as you’re not afraid of letting blemishes show, the Pixel 3's selfies are mystifyingly sharp in a way that often makes images from other $1,000 phones look bad. And when you want to snap a group selfie instead of a personal one, the Pixel 2's second cam lets you capture the same shockingly detailed images with a wide-angle field of view.<br></p>",
            "<p>As for the Pixel 3's general design, aside from the Pixel 3 XL’s unmistakable notch (which I’ve taken to calling “the bathtub”), the physical dimensions of both the 5.5-inch Pixel 3 and 6.3-inch Pixel 3s have changed so little that Google’s new official cases fit just as well on last year’s phones. Instead, Google worked on improving the Pixel’s build by adding new IP68 water-resistance, moving the volume rocker to the right to create a completely unblemished left side, and installing a new one-piece glass back.</p>",
            "<p>It not only increases durability when compared to the metal and glass construction of the Pixel 2, but the micro-etched soft-touch finish<br>on its bottom two-thirds is something that begs you not to put a case on the phone. Google even paid attention to little details like painting the inside of the phone’s USB-C port black and adding a splash of color to the Clearly White and Not Pink models’ power button. (Also, if you want to be accurate, Not Pink should really be called Sometimes Pink.)</p>",
            "<p>Inside, the Pixel 3 is powered by a Qualcomm Snapdragon 845 chipset, which puts it on the same playing field as every other high-end Android phone. However, the Pixel 3's 4GB of RAM and 64GB or 128GB storage feel a bit skimpy for a phone that starts at $800. That isn’t to say the phone needs more memory, but when it comes to value, not having extra RAM, or a microSD card slot for the option to tack on even more storage feels bad for a flagship device. Thankfully, Google didn’t ax the phone’s dual front-facing speakers, which are way louder than before, and when combined with Google’s Pixel Stand wireless charger, lets the Pixel 3 double as a mini smart speaker/home hub combo.</p>",
            "<p>That said, in terms of usefulness, one of the standard Pixel 3's biggest upgrades is a larger 2,915 mAh battery that lasted 10 hours and 50 minutes on our rundown test, a big jump up from the paltry 8:59 the Pixel 2 managed last year. Unfortunately, the same can’t be said of the Pixel 3 XL whose 3,430 mAh battery is actually slightly smaller than what you get in a Pixel 2 XL, which resulted in the Pixel 3 XL’s longevity increasing by less than 10 minutes to 11 hours and 24 minutes.<br></p>",
            "<p>And even though I’ve had the Pixel 3 for less than a week, the phone has made a lasting impression. Google’s dedication to software excellence is something that I’d say has finally surpassed the iPhone when it comes to being the simplest, most no-nonsense handset, particularly for the less technically inclined crowd. More often than not, the Pixel 3 is thoughtful, and presents you with the tools and info you want, and streamlines the process so that accessing them isn’t a hassle. However, I’d be remiss not to mention the downsides of Google’s game plan.</p>",
            "<p>The first and most obvious case are features like Top Shot mode. The Pixel’s software makes it hard to tell if the feature is working because it’s linked to the camera’s seemingly unrelated Motion setting, which can be set to off, auto, and on, with auto and on potentially giving you different results. But the settings complications don’t end there, because controls for major features like HDR+ aren’t shown by default. That means out of the box, you can’t actually turn on the phone’s HDR+ enhanced mode, which is very different from standard HDR+, and to even see the option in the main camera UI, you need to go into the camera’s advanced settings and enable the HDR+ control. Since the Pixel’s HDR+ is the best and most important part of its picture taking process, it shouldn’t be this difficult to turn on.</p>",
            "<p>But the true plight of a software-first mindset is that it can often feel like the user experience is never fully complete. Currently, the Pixel 3 is missing <a href=\"https://gizmodo.com/i-broke-google-duplex-but-its-still-impressive-1827131546\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/i-broke-google-duplex-but-its-still-impressive-1827131546', {metric25:1})\">Duplex</a>, Google’s AI-powered phone reception feature that can book appointments or make reservations over the phone on its own, as well as Night Sight mode, which is a special setting dedicated to capturing challenging low-light pictures. It’s unclear when they will be available. These are two major things Google teased at the Pixel 3's launch event, and in the case of Night Sight mode, it’s an even bigger bummer, because as is, the Pixel 3 often struggles in very low-light situations.</p>",
            "<p>And then there’s the Pixel 3's big what if: How much better could the Pixel 3 be if Google cared a little more about both hardware and software? On the standard Pixel 3, its bezels look oversized and slightly wasteful compared to even 18-month old phones like the <a href=\"https://gizmodo.com/samsung-galaxy-s8-review-the-prettiest-phone-wins-1794526975\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/samsung-galaxy-s8-review-the-prettiest-phone-wins-1794526975', {metric25:1})\">Galaxy S8</a>, while the bathtub notch and big chin on the Pixel 3 XL appear even clunkier. Also how about those cameras.</p>",
            "<p>With the inclusion of a new dual-cam system in front, Google clearly understands the value of having multiple cameras, and yet the camera in back doesn’t get any extra help. That’s frustrating because even though the Pixel’s Super Res Zoom feature is fine, it’s still not as good as a real 2x optical lens. There’s also a small concern regarding quality control because after turning them on for the first time, I noticed that the Pixel 3 and Pixel 3 XL’s OLED screens featured noticeably different color temperatures, which only gets worse the more off-center you are.</p>",
            "<p>Google says some variation between displays is a normal part of the manufacturing process, which is true. But this is the <a href=\"https://gizmodo.com/google-is-investigating-an-issue-with-the-pixel-2-xl-s-1819765192\" rel=\"nofollow\" onclick=\"window.ga('send', 'event', 'Embedded Url', 'Internal link', 'https://gizmodo.com/google-is-investigating-an-issue-with-the-pixel-2-xl-s-1819765192', {metric25:1})\">second year in a row this has happened</a> with Pixel devices. I can’t remember ever seeing such a big discrepancy when it comes to the displays on flagship Apple and Samsung handsets.</p>",
            "<p>However, don’t let these things distract you from what Google has accomplished. The Pixel 3 more than any phone before shows an almost Nintendo-like philosophy where it’s not the device’s specs or hardware that matter most, but the overall user experience. And on the Pixel 3, Google has taken its software and made it king, solving problems and preventing others with intelligence and good design.</p>",
            "<p>Android 9.0 • Qualcomm Snapdragon 845 • 4GB of RAM • 64GB or 128GB of storage • 5.5-inch FH+ OLED Display/6.3-inch QHD+ OLED display • dual 8-MP front cams • 12.2-MP rear cam • IP68 water resistance • Qi wireless charging • dual front-facing speakers • Bluetooth 5.0 • USB 3.1 Type-C port • 2.915 mAh battery/3,430 mAh battery • 5.7 x 2.7 x 0.3-inches/6.2 x 3.0 x 0.3-inches - 148 grams/184 grams • available in just black, clearly white, not pink</p>"
        ]
    }
]