[
{"title": "Google Pixel 3 review", "author": ["Matt Swider"]},
{"text": ["<p><strong>Update:</strong> <em>The Google Pixel 3 is still one of the best phones around, with not much in the way of new competition since launch. But it's still just as expensive as it was at launch too, so we've added a comparison to the cheaper OnePlus 6T.</em></p>", "<p>The Google Pixel 3 has the best smartphone camera you can buy today, and yet it comes in a one-hand-friendly size with a large enough screen to satisfy most people.</p>", "<p>You don’t need a big, pocket-busting phone to get great photos (this one has a 5.5-inch screen), nor do you need a dual-lens rear camera (it has a single lens on back), nor the fastest aperture on a phone (f/1.8 has been beaten by the LG and Samsung’s speedier f/1.5 aperture). Google proves that its 12.2MP photos are better because of machine-learning camera software and consistency.</p>", "<p>The Pixel 3 – and larger Pixel 3 XL – makes lugging around a <a href=\"https://www.techradar.com/news/best-compact-camera\">compact camera</a> or even an <a href=\"https://www.techradar.com/news/best-entry-level-dslr-camera\">entry-level DSLR</a> redundant. It also has features you can't get on professional cameras, unless you're constantly changing lenses. There are two front-facing 8MP cameras here, with the second lens designed for wide-angle selfies, enabling you to get groups photos without cutting people out of the picture.</p>", "<p>To this day, the <a href=\"https://www.techradar.com/reviews/google-pixel-2-review\">Google Pixel 2</a> camera still amazes us, and the Pixel 3 builds off of that success with better photo detail and enhanced HDR. What’s more, the color-rich OLED screen is far superior due to its 18:9 aspect ratio. It’s not bezel-less by any means, but you do get more screen real estate than on the Pixel 2 – and keep the front-facing stereo speakers. It also avoids Pixel 3 XL’s awkward notch cut out that so many people hate on.</p>", "<p>You’re not going to get <em>everything</em> in this small package. The battery falls short of bigger phones at a 2,915mAh capacity, offering all-day battery life with conservative use in our tests. Snapping 100 great photos in two hours was a real battery life drain. You’re also stuck with 64GB or 128GB – there’s no microSD card slot, and there’s no headphone jack. And, as much as we laud the behind-the-scenes camera software, the app doesn’t have all of Samsung's and LG's neat camera app tricks.</p>", "<p>The Google Pixel 3 is the ideal smartphone for anyone who cares about photo quality and isn’t satisfied with their phone’s picture-taking abilities today. It has the camera smarts and <a href=\"https://www.techradar.com/news/android-pie-9-features-release-date-and-phones-list\"><u>Android Pie</u></a>-powered AI smarts of the Pixel 3 XL, without the awkward notch cut-out at the top. And, unlike the comparable, one-hand-friendly <a href=\"https://www.techradar.com/reviews/iphone-xs-review\">iPhone XS</a>, it’s cheap – at least by 2018 flagship standards.</p>", "<p><em>Watch our first impressions of the Google Pixel 3 in video form below...</em></p>", "<p>The Google Pixel 3 landed on October 18 in the US, and November 1 in the UK and Australia. Availability is also slated for Canada, France, Germany, Japan, India, Ireland, Italy, Singapore, Spain, and Taiwan. Pre-orders began right after the October 9 launch event.</p>", "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/h4ax4uNX5fPuwLJ4wDndjd-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/h4ax4uNX5fPuwLJ4wDndjd-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/h4ax4uNX5fPuwLJ4wDndjd-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/h4ax4uNX5fPuwLJ4wDndjd.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/h4ax4uNX5fPuwLJ4wDndjd.jpg\"></p>", "<p>The Pixel 3 price is $799 (£739, AU$1,199) for the 64GB version, and $899 (£839, AU$1,349) for the 128GB version. We recommend more internal storage since you can’t upgrade later (there’s no microSD card slot on this phone).</p>", "<p>On contract in the US, it's exclusive to Verizon, starting at $33.33 a month for 64GB or $37.49 a month for 128GB for the duration of 24 months. Sadly, you won't find it sold at AT&amp;T, T-Mobile, Sprint, or other US carriers, but you can get the unlocked Google Pixel 3 at full price from official Google's store.</p>", "<p>It’s a price hike from the Google Pixel 2 (by $150), yet cheaper than an iPhone XS (by $200). You're paying for the more expansive screen and machine-learning camera, and the fact that almost all flagship smartphones cost more in 2018.</p>", "<p class=\"mid__article\"></p>", "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/cJ7KwbqcggTkoCUthNKkad-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/cJ7KwbqcggTkoCUthNKkad-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/cJ7KwbqcggTkoCUthNKkad-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/cJ7KwbqcggTkoCUthNKkad.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/cJ7KwbqcggTkoCUthNKkad.jpg\"></p>", "<p>The Pixel 3 retains Google's familiar two-tone design – the back has shiny glass at the top, while lower 80% has a matte finish. There's a more seamless transition between the two textures for a higher-quality look and feel, but overall its look hasn't changed dramatically.</p>", "<p>It easily fits in one hand, and, for the most part, you can operate it without resorting to using two hands. That's the best reason to choose the Pixel 3 over the Pixel 3 XL. It's screen size is big enough, yet the phone handfeel is rather manageable. That and it doesn't have an ugly notch cut out at the top, a design choice that a deal breaker for many. </p>", "<p>The Pixel 3 series looks similar to last year's phones, but it does in fact use different materials. The entire back is made of soft-touch glass using Corning Gorilla Glass 5. It's the same strengthened glass that protects the front screen, and it's all sandwiching an aluminum frame that has a hybrid coating – that's the only bit of metal you'll find on the outside.</p>", "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/5bvi4a2qPYyrN6iM4n9JmW.jpg\"></p>", "<p>Sure, the all-glass design makes the Pixel 3 more susceptible to damage (though we have yet to find the scratches others have reported), but glass also enables a better LTE connection and wireless charging. That's why we've seen a lack of aluminum-backed flagship phones in 2018. The Pixel 3 is the latest causality. </p>", "<p>Wireless charging is a new feature for the Pixel phones, and a welcome change now that Google has launched the Pixel Stand wireless charger alongside its new devices. We haven't had a wirelessly charging Google phone since the plastic <a href=\"https://www.techradar.com/reviews/phones/google-nexus-6-1271190/review\">Nexus 6</a>.</p>", "<p>More rounded edges are everywhere on the Pixel 3. Its frame is less boxy than previous Google phones, a trend we've seen from the iPhone and and others. Gone is the harsher silver bevel around the frame and rear fingerprint sensor. It's like Google put the Pixel 2 through a smoothing machine, and we like the results.</p>", "<p>You'll still find dual front-facing speakers on the Google Pixel 3. No one else is really doing this anymore (except Razer with the <a href=\"https://www.techradar.com/reviews/hands-on-razer-phone-2\">Razer Phone 2</a>), so it's nice to see in a flagship device. You'll also get Active Edge, which allows you to squeeze the sides of the phone to call up Google Assistant. We much prefer this squeeze mechanic as opposed to a dedicated AI button on the frame, like Samsung does with Bixby button (which we often confuse for the volume down button).</p>", "<p>The Pixel 3 comes with USB-C earbuds in the box, which means, no, there's no standard 3.5mm headphone jack (just like last year's Pixel 2) and without that microSD card slot, you're stuck with 64GB and 128GB storage configurations. </p>", "<p>The Pixel 3 color are rather muted, with 'Just Black' as our favorite of the trio. 'Clearly White' looks cheaper and 'Not Pink' isn't for everyone. Okay, it's the color you want if you're looking to stand out a bit, but we liked last year's unique Mint color more. You do get a fresh Mint color on the Clearly White Google Pixel 3 power button, however.</p>", "<p>The 5.5-inch OLED screen fits into modern times. It's big and expansive, and sits in a phone that's smaller than we had expected given the screen size rumors. The entire thing measures 145.6 x 68.2 x 7.9mm and weighs 148g. It's roughly the same size as the Pixel 2, which had a smaller 5-inch display.</p>", "<p>It's the grown up version of last year's phone. The Pixel 3 screen looks richer than last year's Pixel 2, too. The specs note that it has only a few more pixels per inch, but keep in mind the screen is much taller, so there are a lot more pixels spread across a half inch of extra screen. There's noticeably less bezel thanks to it's 18:9 aspect ratio rather than the dated 16:9 look. Last year's oversized bezel, we felt, was the biggest disappointment design-wise about the Pixel 2XL. The Google Pixel 3 fixes this issue.</p>", "<p>Oh, it still has bezel. There's no hiding the two front-facing cameras and speaker at the top and chin at the bottom. But it's the best we've seen from a phone with dual front-facing speakers and without a deep (some would say ugly) notch cut out.</p>"]},
{"title": "Google Pixel 3 review", "author": ["Matt Swider"]},
{"text": ["<p>The Google Pixel 3 has the best smartphone camera in the world. It's not because the photos it takes are dramatically better — but they're just marginally better. </p>", "<p>The bigger deal is that Google's 12.2MP camera is more consistent. We got more detailed, sharper, and slightly brighter photos from this Pixel 3 camera than the warmer iPhone XS and the Samsung Galaxy Note 9 cameras. There's less noise than the Pixel 2 and everything wasn't over-sharpened like the <a href=\"https://www.techradar.com/reviews/huawei-p20-pro-review\">Huawei P20 Pro</a> camera.</p>", "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/KC3b5wyzm6PQQqVZypNBZd-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/KC3b5wyzm6PQQqVZypNBZd-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/KC3b5wyzm6PQQqVZypNBZd-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/KC3b5wyzm6PQQqVZypNBZd.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/KC3b5wyzm6PQQqVZypNBZd.jpg\"></p>", "<p>A lot of this has to do with what's happening behind the scenes. The f/1.8 aperture isn't record-breaking, but Google's camera-dedicated Pixel Visual Core chip and its machine-learning software help deliver this single-lens rear camera its wow factor.</p>", "<p class=\"mid__article\"></p>", "<p>New software perks like Top Shot help avoid closed eyes by picking the right photo, while Night Sight (coming soon) will give the Google Pixel 3 the edge in most nighttime pictures. It's already doing a fine job (for a smartphone camera) in low-light, according to our tests.</p>", "<p>Super Res Zoom helps mitigate the fact that there's no telephoto lens here, with the ability to use backend software to improve digitally zoom The fact that the camera captures larger 1.4 micron pixels and has optical image stabilization (OIS) is also a difference maker.</p>", "<p>The same general photo consistency comes to the front-facing 8MP cameras. They reliably took photos with better HDR and less noise. One camera had a normal 75 degree field of view and the other has a wider 97 degree field of view.</p>", "<p>The wide-angle selfies are effective at telling more about who you're with and what you're posing in front of, so much so that Google refers to this secondary lens as it's Group Selfie Camera.</p>", "<p>The <a href=\"https://www.techradar.com/reviews/phones/mobile-phones/lg-v10-1305854/review\"><u>LG V10</u></a> introduced us to this wide selfie camera idea, and the <a href=\"https://www.techradar.com/reviews/lg-v40-thinq\"><u>LG V40</u></a> continues the trend. Google’s wide-angle photos are better, though they do have some caveats. The aperture is f/2.2 using this lens (vs f1.8 on the normal lens) but you won't notice a big difference in good lighting. The bigger caveat to the Group Selfie Camera is barrel distortion around the edges.</p>", "<p>Holding the phone just right helps capture more of what's around you, whether you're posing in front of a tall building or taking a crowded selfie. We posed in front of a distant Hollywood sign, and got an LA-emblazoned T-Shirt in the photo. With any normal selfie camera, the T-Shirt or the Hollywood sign would be cut out.</p>", "<p>Here's the problem: Holding in the wrong way takes unflattering photos that make you look like you've been through a funhouse mirror. You may be able to capture more of what's above you, but when more of your shirt fans out, you look like you've put on some awkward weight. Holding the phone out further or at a different angle usually helps. Taking selfies is a skill. Taking wide selfies will earn you another millennial merit badge.</p>", "<p>The Pixel 3 shoots impressive 4K video with a mix of optical image stabilization (OIS) and electronic software stabilization. Everything looks incredibly smooth, making the need for something like the DJI Osmo 2 gimbal less of a necessity. You won't, however, find the 4K to shoot 60 frames per second. Google has capped video at this max resolution at 30fps.</p>"]},
{"title": "Google Pixel 3 review", "author": ["Matt Swider"]},
{"text": ["<p>The Pixel 3 has a 2,915mAh battery, which is slightly smaller than we had hoped (the Samsung Galaxy S9 has a 3,000mAh and we think that could stand to last longer), but it's still an improvement over last year's 5-inch Pixel, which had a 2,700mAh unit. </p>", "<p>The battery life is the biggest downside to opting for the smaller Pixel 3. Yes, you can get all-day battery life from this phone with conservative use, but even normal use had us reaching for the charger before the end of the night. That's a problem when you're capturing so many photos using the great camera. The battery really takes a hit. </p>", "<p class=\"mid__article\"></p>", "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/D5ZGJJKNZh2mrrG7E4Ngg9-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/D5ZGJJKNZh2mrrG7E4Ngg9-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/D5ZGJJKNZh2mrrG7E4Ngg9-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/D5ZGJJKNZh2mrrG7E4Ngg9.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/D5ZGJJKNZh2mrrG7E4Ngg9.jpg\"></p>", "<p>Google's new Android 9 Pie software does give it more juice, with adaptive battery settings that work behind the scenes. It essentially limits the power of apps you don't use in the course of a day, and it's a perk that’s coming to all Android Pie phones (you may already have it on your current Android phone).</p>", "<p>The 18W charger returns for fastest charging speeds, but exclusive to the Pixel 3 and Pixel 3 XL (among Pixel phones, at least) is fast wireless charging. The new glass back gives this feature the ability to charge with any Qi charger. </p>", "<p>Google launched its minimalist-looking Pixel Stand wireless charger, which doubles as a way to see notifications and interact with Google Assistant, as if this were a mini Google Home Hub.The stand isn't ideal for traveling (it doesn't fold flat, sadly), but it's a nice option for slightly slower 10W charging on a night stand. We were able to reach 80% battery capacity in 1 hour and 39 minutes using wireless charging.</p>"]},
{"title": "Google Pixel 3 review", "author": ["Matt Swider"]},
{"text": ["<p>The Pixel 3 is a stable, fast-performing phone, though it isn't technically the fastest we've tested in 2018. That really shouldn't matter to most people.</p>", "<p>It's powered by the latest Qualcomm Snapdragon 845 chipset and 4GB of RAM, when rival phones are up to 6GB and even 8GB of RAM. Likewise, Apple's A12 chipset beats the Snapdragon 845 handedly in all benchmarking tests.</p>", "<p>Here's the good news, we didn't see slowdown from either the Pixel 3 or Pixel 3 XL. And the fact that Google owns the hardware and software should prove beneficial for smooth performance going forward. </p>", "<p>The Geekbench 4 benchmarking tests gives the Pixel 3 a multi-core score of 8,336, finishing behind the Samsung Galaxy S9. Long-term, the 4GB of RAM may prove to be an issue, and it may drop frames compared to the next-level performance of  the new <a href=\"https://www.techradar.com/reviews/hands-on-razer-phone-2\">Razer Phone 2</a> when gaming in 3D. But right now, we see nothing to dissuade the average user from buying this handset.</p>", "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/3EdwXQbYKfn7zRih9UZrcd-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/3EdwXQbYKfn7zRih9UZrcd-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/3EdwXQbYKfn7zRih9UZrcd-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/3EdwXQbYKfn7zRih9UZrcd.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/3EdwXQbYKfn7zRih9UZrcd.jpg\"></p>", "<p class=\"mid__article\"></p>", "<p>Android 9.0 Pie is now available for all Pixel phones, and the update comes out of the box with the Pixel 3 and Pixel 3 XL. It's a bit of a switch from previous Android operating systems in an effort to adapt to modern times.</p>", "<p>Namely, the onscreen home and back buttons have been visually downsized and come with different gestures attached to them. Tapping the <a href=\"https://www.techradar.com/reviews/iphone-xs-review\">iPhone XS</a>-like bottom home button bar (no longer a big circular button) sends you home, while swiping up on this flat bar opens the new recent menu to switch between apps. Swiping up further reveals the app drawer. The back button still works as normal, but is smaller than before.</p>", "<p>All of this is in an effort to give the Google Pixel 3 extra screen real estate. It’s effective and you’ll get used to the changes, even if it’s painstaking at first. Your muscle memory needs time to adjust.</p>", "<p>The trade-off is worth it, though it’s not Earth-shattering. The same goes for the time and the notification icons along the top, as the Android software is now fit for notched displays (even if this phone doesn’t have a screen cut out at the top).</p>", "<p>The right-aligned volume slider interface (right next to the physical volume slider) makes it easier to wrap your head around whether you're adjusting call volume or media volume. Essentially, the slider is now dedicated to media, with a smaller on-screen button to toggle vibrate/ringer/silent. We’ve also had less issues with misguided screen rotation thanks to the new software. That's such a small, but meaningful change for everyday use.</p>", "<p>Behind-the-scenes tools are even more groundbreaking. Adaptive battery life and adaptive brightness settings free you from having to worry about closing apps to save battery life and adjusting the brightness in different surroundings. Google’s machine-learning software does the heavy lifting by learning your behaviors and taking into account your environment.</p>", "<p>We haven’t seen App Slices and App Actions from the operating system, but they’re shortcuts coming soon so that you can access apps (and content within those apps) faster. We’ll update this review as more changes from the the Google Pixel 3 software over the next year.</p>"]},
{"title": "Google Pixel 3 review", "author": ["Matt Swider"]},
{"text": ["<p>The Google Pixel 3 is offering a lot, and in a tighter package than most other flagship phones – the larger Pixel 3 XL included. Chief among them is the single-lens 12.2MP rear camera that delivers slightly better photos and, even more importantly, consistently usable photos compared to the competition. Samsung and LG camera phones occasionally exhibited blurriness or poor low-light performance, and Apple’s iPhone XS Max liked to using warmer than necessary color tones. The Pixel 3 delivered the best pictures each and every time. The one and only time it blurred the foreground subject (us) was when we were wearing sunglasses – it so relies heavily on subject recognition.</p>", "<p>The Group Selfie Camera, part of Google’s front-facing 8MP camera duo, doesn’t revolutionize selfies. But it does help capture what you’re posing or who you’re posing with. It puts your selfies into context, especially when you're with a bunch of friends or in front of tall, iconic buildings. There are noticeable funhouse-mirror distortion around the edges if you’re not careful with how your frame your Group Selfie Camera shot.</p>", "<p>You will have to forgo the additional battery life that comes with larger phones when picking the smaller Pixel 3. That’s the one major issue we had with this smartphone, especially when photo-taking power users are the key audience.</p>", "<p>We liked carrying around the Google Pixel 3 more than the larger Google Pixel 3 XL. This is the one-hand-friendly version of the Pixel 3 XL that your grip will appreciate, and you don’t have to worry about the notch cut out at the top. It’s also cheaper than most other flagship phones in 2018, even if it is more expensive than the Pixel 2. It's not only Google's best camera yet, it's the best camera on any smartphone today.</p>", "<p>Yes, if you’re seeking the best camera phone at a reasonable size and a reasonable price. You’ll get the best photos from the Pixel 3 and Pixel 3 XL, and the smaller phone is more one-hand-friendly than most flagship handsets. Power users may want to opt for the larger Pixel 3 XL given its larger battery capacity.</p>", "<p>The 5.5-inch Google Pixel 3 is best in the hand (singular hand) of someone who wants the best phone camera without having to opt for a handset as big as the Samsung Galaxy Note 9 or iPhone XS Max. It’s priced competitively next to its rival phones, and delivers more consistently rich photos.</p>", "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/z7EU7n5ct4YonsBoXXTZBd-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/z7EU7n5ct4YonsBoXXTZBd-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/z7EU7n5ct4YonsBoXXTZBd-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/z7EU7n5ct4YonsBoXXTZBd.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/z7EU7n5ct4YonsBoXXTZBd.jpg\"></p>", "<p class=\"mid__article\"></p>", "<p>The Samsung Galaxy S9 is the chief rival to the Pixel 3, with a larger 5.8-inch screen and more elegantly curved design. Its 12MP camera is also incredible, though, in our tests, second best next to the Pixel 3 and Pixel 3 XL. Samsung’s camera software is a little more robust for selfie taking (triggering selfie photos is easier with your hand), smooth hyperlapses, and super slow motion footage.</p>", "<p><strong>Full review: </strong><a href=\"https://www.techradar.com/reviews/samsung-galaxy-s9-review\"><strong>Samsung Galaxy S9</strong></a></p>", "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/3gRav5C4iyXF7828hoytmh.jpg\"></p>", "<p>iPhone XS is great camera performer and has a 5.8-inch screens size. However, the operating system is a bit different from Android, so there’s some adjustment when entering or exiting Apple’s walled garden ecosystem. The photo colors are almost always warmer on the iPhone XS compared to the Pixel 3, and we found slightly more detail in Google’s camera.</p>", "<p><strong>Full review: </strong><a href=\"https://www.techradar.com/reviews/iphone-xs-review\"><strong>iPhone XS</strong></a></p>", "<p class=\"bordeaux-image-check\"><img src=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" alt=\"\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-normal=\"https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg\" data-src=\"https://cdn.mos.cms.futurecdn.net/GKy7J2cx6cAhk3SXC6ty8n-320-80.jpg\" data-srcset=\"https://cdn.mos.cms.futurecdn.net/GKy7J2cx6cAhk3SXC6ty8n-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/GKy7J2cx6cAhk3SXC6ty8n-650-80.jpg 650w\" data-sizes=\"auto\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/GKy7J2cx6cAhk3SXC6ty8n.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/GKy7J2cx6cAhk3SXC6ty8n.jpg\"></p>", "<p>The OnePlus 6T's camera isn't as good as the Pixel 3's, but given that it's a substantially cheaper phone that's okay. And it is a good snapper, with a 16MP and 20MP dual-lens arrangement on the back, complete with optical image stabilization.</p>", "<p>Elsewhere, the OnePlus 6T has the same chipset as the Pixel 3 and more RAM, along with a 6.41-inch screen with a 1080 x 2340 resolution and an in-screen fingerprint scanner.</p>", "<p><strong>Full review: </strong><a href=\"https://www.techradar.com/reviews/oneplus-6t-review\"><strong>OnePlus 6T</strong></a></p>"]}
]